7767517
101 117
Input            data                    0 1 data 0=128 1=128 2=3
Padding          75                       1 1 data 75 0=1 1=2 2=1 3=2 4=0 5=0.000000e+00 7=0 8=0
Convolution      76                       1 1 75 76 0=24 1=5 11=5 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=1800
ReLU             77                       1 1 76 77
Split            splitncnn_0              1 2 77 77_splitncnn_0 77_splitncnn_1
ConvolutionDepthWise 78                       1 1 77_splitncnn_1 78 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      79                       1 1 78 79 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=576
BinaryOp         80                       2 1 79 77_splitncnn_0 80 0=0
ReLU             81                       1 1 80 81
Split            splitncnn_1              1 2 81 81_splitncnn_0 81_splitncnn_1
Padding          82                       1 1 81_splitncnn_1 82 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=4
ConvolutionDepthWise 83                       1 1 81_splitncnn_0 83 0=24 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      84                       1 1 83 84 0=28 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=672
BinaryOp         85                       2 1 84 82 85 0=0
ReLU             86                       1 1 85 86
Split            splitncnn_2              1 2 86 86_splitncnn_0 86_splitncnn_1
Padding          87                       1 1 86_splitncnn_1 87 0=0 1=2 2=0 3=2 4=0 5=0.000000e+00 7=0 8=0
Pooling          88                       1 1 86_splitncnn_0 88 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Padding          89                       1 1 88 89 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=4
ConvolutionDepthWise 90                       1 1 87 90 0=28 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=252 7=28
Convolution      91                       1 1 90 91 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=896
BinaryOp         92                       2 1 91 89 92 0=0
ReLU             93                       1 1 92 93
Split            splitncnn_3              1 2 93 93_splitncnn_0 93_splitncnn_1
Padding          94                       1 1 93_splitncnn_1 94 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=4
ConvolutionDepthWise 95                       1 1 93_splitncnn_0 95 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Convolution      96                       1 1 95 96 0=36 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1152
BinaryOp         97                       2 1 96 94 97 0=0
ReLU             98                       1 1 97 98
Split            splitncnn_4              1 2 98 98_splitncnn_0 98_splitncnn_1
Padding          99                       1 1 98_splitncnn_1 99 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=6
ConvolutionDepthWise 100                      1 1 98_splitncnn_0 100 0=36 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=324 7=36
Convolution      101                      1 1 100 101 0=42 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1512
BinaryOp         102                      2 1 101 99 102 0=0
ReLU             103                      1 1 102 103
Split            splitncnn_5              1 2 103 103_splitncnn_0 103_splitncnn_1
Padding          104                      1 1 103_splitncnn_1 104 0=0 1=2 2=0 3=2 4=0 5=0.000000e+00 7=0 8=0
Pooling          105                      1 1 103_splitncnn_0 105 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Padding          106                      1 1 105 106 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=6
ConvolutionDepthWise 107                      1 1 104 107 0=42 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=378 7=42
Convolution      108                      1 1 107 108 0=48 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2016
BinaryOp         109                      2 1 108 106 109 0=0
ReLU             110                      1 1 109 110
Split            splitncnn_6              1 2 110 110_splitncnn_0 110_splitncnn_1
Padding          111                      1 1 110_splitncnn_1 111 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 112                      1 1 110_splitncnn_0 112 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=432 7=48
Convolution      113                      1 1 112 113 0=56 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2688
BinaryOp         114                      2 1 113 111 114 0=0
ReLU             115                      1 1 114 115
Split            splitncnn_7              1 2 115 115_splitncnn_0 115_splitncnn_1
Padding          116                      1 1 115_splitncnn_1 116 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 117                      1 1 115_splitncnn_0 117 0=56 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=504 7=56
Convolution      118                      1 1 117 118 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3584
BinaryOp         119                      2 1 118 116 119 0=0
ReLU             120                      1 1 119 120
Split            splitncnn_8              1 2 120 120_splitncnn_0 120_splitncnn_1
Padding          121                      1 1 120_splitncnn_1 121 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 122                      1 1 120_splitncnn_0 122 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
Convolution      123                      1 1 122 123 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
BinaryOp         124                      2 1 123 121 124 0=0
ReLU             125                      1 1 124 125
Split            splitncnn_9              1 2 125 125_splitncnn_0 125_splitncnn_1
Padding          126                      1 1 125_splitncnn_1 126 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 127                      1 1 125_splitncnn_0 127 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=648 7=72
Convolution      128                      1 1 127 128 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5760
BinaryOp         129                      2 1 128 126 129 0=0
ReLU             130                      1 1 129 130
Split            splitncnn_10             1 2 130 130_splitncnn_0 130_splitncnn_1
Padding          131                      1 1 130_splitncnn_1 131 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 132                      1 1 130_splitncnn_0 132 0=80 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=720 7=80
Convolution      133                      1 1 132 133 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7040
BinaryOp         134                      2 1 133 131 134 0=0
ReLU             135                      1 1 134 135
Split            splitncnn_11             1 2 135 135_splitncnn_0 135_splitncnn_1
Padding          136                      1 1 135_splitncnn_1 136 0=0 1=2 2=0 3=2 4=0 5=0.000000e+00 7=0 8=0
Pooling          137                      1 1 135_splitncnn_0 137 0=0 1=2 11=2 2=2 12=2 3=0 13=0 14=0 15=0 5=1
Padding          138                      1 1 137 138 0=0 1=0 2=0 3=0 4=0 5=0.000000e+00 7=0 8=8
ConvolutionDepthWise 139                      1 1 136 139 0=88 1=3 11=3 2=1 12=1 3=2 13=2 4=0 14=0 15=0 16=0 5=1 6=792 7=88
Convolution      140                      1 1 139 140 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8448
BinaryOp         141                      2 1 140 138 141 0=0
ReLU             142                      1 1 141 142
Split            splitncnn_12             1 2 142 142_splitncnn_0 142_splitncnn_1
ConvolutionDepthWise 143                      1 1 142_splitncnn_1 143 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      144                      1 1 143 144 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         145                      2 1 144 142_splitncnn_0 145 0=0
ReLU             146                      1 1 145 146
Split            splitncnn_13             1 2 146 146_splitncnn_0 146_splitncnn_1
ConvolutionDepthWise 147                      1 1 146_splitncnn_1 147 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      148                      1 1 147 148 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         149                      2 1 148 146_splitncnn_0 149 0=0
ReLU             150                      1 1 149 150
Split            splitncnn_14             1 2 150 150_splitncnn_0 150_splitncnn_1
ConvolutionDepthWise 151                      1 1 150_splitncnn_1 151 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      152                      1 1 151 152 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         153                      2 1 152 150_splitncnn_0 153 0=0
ReLU             154                      1 1 153 154
Split            splitncnn_15             1 2 154 154_splitncnn_0 154_splitncnn_1
ConvolutionDepthWise 155                      1 1 154_splitncnn_1 155 0=96 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Convolution      156                      1 1 155 156 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9216
BinaryOp         157                      2 1 156 154_splitncnn_0 157 0=0
ReLU             output                   1 1 157 output
