7767517
144 166
Input                    input.1                  0 1 input.1 -23330=4,3,352,352,3 0=352 1=352 2=3
Convolution              Conv_0                   1 1 input.1 447 -23330=4,3,176,176,24 0=24 1=3 3=2 4=1 5=1 6=648 9=1
Pooling                  MaxPool_2                1 1 447 448 -23330=4,3,88,88,24 1=3 2=2 3=1 5=1
Split                    splitncnn_0              1 2 448 448_splitncnn_0 448_splitncnn_1 -23330=8,3,88,88,24,3,88,88,24
ConvolutionDepthWise     Conv_3                   1 1 448_splitncnn_1 800 -23330=4,3,44,44,24 0=24 1=3 3=2 4=1 5=1 6=216 7=24
Convolution              Conv_4                   1 1 800 453 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
Convolution              Conv_6                   1 1 448_splitncnn_0 456 -23330=4,3,88,88,24 0=24 1=1 5=1 6=576 9=1
ConvolutionDepthWise     Conv_8                   1 1 456 809 -23330=4,3,44,44,24 0=24 1=3 3=2 4=1 5=1 6=216 7=24
Convolution              Conv_9                   1 1 809 461 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
Concat                   Concat_11                2 1 453 461 462 -23330=4,3,44,44,48
ShuffleChannel           Reshape_16               1 1 462 467 -23330=4,3,44,44,48 0=2 1=1
Slice                    Gather_20                1 2 467 469 471 -23330=8,3,44,44,24,3,44,44,24 -23300=2,-233,-233
Convolution              Conv_21                  1 1 471 474 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
ConvolutionDepthWise     Conv_23                  1 1 474 818 -23330=4,3,44,44,24 0=24 1=3 4=1 5=1 6=216 7=24
Convolution              Conv_24                  1 1 818 479 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
Concat                   Concat_26                2 1 469 479 480 -23330=4,3,44,44,48
ShuffleChannel           Reshape_31               1 1 480 485 -23330=4,3,44,44,48 0=2 1=1
Slice                    Gather_35                1 2 485 487 489 -23330=8,3,44,44,24,3,44,44,24 -23300=2,-233,-233
Convolution              Conv_36                  1 1 489 492 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
ConvolutionDepthWise     Conv_38                  1 1 492 827 -23330=4,3,44,44,24 0=24 1=3 4=1 5=1 6=216 7=24
Convolution              Conv_39                  1 1 827 497 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
Concat                   Concat_41                2 1 487 497 498 -23330=4,3,44,44,48
ShuffleChannel           Reshape_46               1 1 498 503 -23330=4,3,44,44,48 0=2 1=1
Slice                    Gather_50                1 2 503 505 507 -23330=8,3,44,44,24,3,44,44,24 -23300=2,-233,-233
Convolution              Conv_51                  1 1 507 510 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
ConvolutionDepthWise     Conv_53                  1 1 510 836 -23330=4,3,44,44,24 0=24 1=3 4=1 5=1 6=216 7=24
Convolution              Conv_54                  1 1 836 515 -23330=4,3,44,44,24 0=24 1=1 5=1 6=576 9=1
Concat                   Concat_56                2 1 505 515 516 -23330=4,3,44,44,48
Split                    splitncnn_1              1 2 516 516_splitncnn_0 516_splitncnn_1 -23330=8,3,44,44,48,3,44,44,48
ConvolutionDepthWise     Conv_57                  1 1 516_splitncnn_1 842 -23330=4,3,22,22,48 0=48 1=3 3=2 4=1 5=1 6=432 7=48
Convolution              Conv_58                  1 1 842 521 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Convolution              Conv_60                  1 1 516_splitncnn_0 524 -23330=4,3,44,44,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_62                  1 1 524 851 -23330=4,3,22,22,48 0=48 1=3 3=2 4=1 5=1 6=432 7=48
Convolution              Conv_63                  1 1 851 529 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_65                2 1 521 529 530 -23330=4,3,22,22,96
ShuffleChannel           Reshape_70               1 1 530 535 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_74                1 2 535 537 539 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_75                  1 1 539 542 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_77                  1 1 542 860 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_78                  1 1 860 547 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_80                2 1 537 547 548 -23330=4,3,22,22,96
ShuffleChannel           Reshape_85               1 1 548 553 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_89                1 2 553 555 557 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_90                  1 1 557 560 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_92                  1 1 560 869 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_93                  1 1 869 565 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_95                2 1 555 565 566 -23330=4,3,22,22,96
ShuffleChannel           Reshape_100              1 1 566 571 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_104               1 2 571 573 575 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_105                 1 1 575 578 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_107                 1 1 578 878 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_108                 1 1 878 583 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_110               2 1 573 583 584 -23330=4,3,22,22,96
ShuffleChannel           Reshape_115              1 1 584 589 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_119               1 2 589 591 593 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_120                 1 1 593 596 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_122                 1 1 596 887 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_123                 1 1 887 601 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_125               2 1 591 601 602 -23330=4,3,22,22,96
ShuffleChannel           Reshape_130              1 1 602 607 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_134               1 2 607 609 611 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_135                 1 1 611 614 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_137                 1 1 614 896 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_138                 1 1 896 619 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_140               2 1 609 619 620 -23330=4,3,22,22,96
ShuffleChannel           Reshape_145              1 1 620 625 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_149               1 2 625 627 629 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_150                 1 1 629 632 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_152                 1 1 632 905 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_153                 1 1 905 637 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_155               2 1 627 637 638 -23330=4,3,22,22,96
ShuffleChannel           Reshape_160              1 1 638 643 -23330=4,3,22,22,96 0=2 1=1
Slice                    Gather_164               1 2 643 645 647 -23330=8,3,22,22,48,3,22,22,48 -23300=2,-233,-233
Convolution              Conv_165                 1 1 647 650 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
ConvolutionDepthWise     Conv_167                 1 1 650 914 -23330=4,3,22,22,48 0=48 1=3 4=1 5=1 6=432 7=48
Convolution              Conv_168                 1 1 914 655 -23330=4,3,22,22,48 0=48 1=1 5=1 6=2304 9=1
Concat                   Concat_170               2 1 645 655 656 -23330=4,3,22,22,96
Split                    splitncnn_2              1 3 656 656_splitncnn_0 656_splitncnn_1 656_splitncnn_2 -23330=12,3,22,22,96,3,22,22,96,3,22,22,96
ConvolutionDepthWise     Conv_171                 1 1 656_splitncnn_2 920 -23330=4,3,11,11,96 0=96 1=3 3=2 4=1 5=1 6=864 7=96
Convolution              Conv_172                 1 1 920 661 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
Convolution              Conv_174                 1 1 656_splitncnn_1 664 -23330=4,3,22,22,96 0=96 1=1 5=1 6=9216 9=1
ConvolutionDepthWise     Conv_176                 1 1 664 929 -23330=4,3,11,11,96 0=96 1=3 3=2 4=1 5=1 6=864 7=96
Convolution              Conv_177                 1 1 929 669 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
Concat                   Concat_179               2 1 661 669 670 -23330=4,3,11,11,192
ShuffleChannel           Reshape_184              1 1 670 675 -23330=4,3,11,11,192 0=2 1=1
Slice                    Gather_188               1 2 675 677 679 -23330=8,3,11,11,96,3,11,11,96 -23300=2,-233,-233
Convolution              Conv_189                 1 1 679 682 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
ConvolutionDepthWise     Conv_191                 1 1 682 938 -23330=4,3,11,11,96 0=96 1=3 4=1 5=1 6=864 7=96
Convolution              Conv_192                 1 1 938 687 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
Concat                   Concat_194               2 1 677 687 688 -23330=4,3,11,11,192
ShuffleChannel           Reshape_199              1 1 688 693 -23330=4,3,11,11,192 0=2 1=1
Slice                    Gather_203               1 2 693 695 697 -23330=8,3,11,11,96,3,11,11,96 -23300=2,-233,-233
Convolution              Conv_204                 1 1 697 700 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
ConvolutionDepthWise     Conv_206                 1 1 700 947 -23330=4,3,11,11,96 0=96 1=3 4=1 5=1 6=864 7=96
Convolution              Conv_207                 1 1 947 705 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
Concat                   Concat_209               2 1 695 705 706 -23330=4,3,11,11,192
ShuffleChannel           Reshape_214              1 1 706 711 -23330=4,3,11,11,192 0=2 1=1
Slice                    Gather_218               1 2 711 713 715 -23330=8,3,11,11,96,3,11,11,96 -23300=2,-233,-233
Convolution              Conv_219                 1 1 715 718 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
ConvolutionDepthWise     Conv_221                 1 1 718 956 -23330=4,3,11,11,96 0=96 1=3 4=1 5=1 6=864 7=96
Convolution              Conv_222                 1 1 956 723 -23330=4,3,11,11,96 0=96 1=1 5=1 6=9216 9=1
Concat                   Concat_224               2 1 713 723 724 -23330=4,3,11,11,192
Split                    splitncnn_3              1 2 724 724_splitncnn_0 724_splitncnn_1 -23330=8,3,11,11,192,3,11,11,192
Convolution              Conv_225                 1 1 724_splitncnn_1 727 -23330=4,3,11,11,72 0=72 1=1 5=1 6=13824 9=1
Split                    splitncnn_4              1 2 727 727_splitncnn_0 727_splitncnn_1 -23330=8,3,11,11,72,3,11,11,72
ConvolutionDepthWise     Conv_227                 1 1 727_splitncnn_1 730 -23330=4,3,11,11,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_229                 1 1 730 968 -23330=4,3,11,11,72 0=72 1=1 5=1 6=5184
ConvolutionDepthWise     Conv_230                 1 1 968 735 -23330=4,3,11,11,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_232                 1 1 735 974 -23330=4,3,11,11,72 0=72 1=1 5=1 6=5184
Split                    splitncnn_5              1 2 974 974_splitncnn_0 974_splitncnn_1 -23330=8,3,11,11,72,3,11,11,72
ConvolutionDepthWise     Conv_233                 1 1 727_splitncnn_0 740 -23330=4,3,11,11,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_235                 1 1 740 980 -23330=4,3,11,11,72 0=72 1=1 5=1 6=5184
ConvolutionDepthWise     Conv_236                 1 1 980 745 -23330=4,3,11,11,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_238                 1 1 745 986 -23330=4,3,11,11,72 0=72 1=1 5=1 6=5184
Interp                   Resize_240               1 1 724_splitncnn_0 752 -23330=4,3,22,22,192 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   Concat_241               2 1 752 656_splitncnn_0 753 -23330=4,3,22,22,288
Convolution              Conv_242                 1 1 753 756 -23330=4,3,22,22,72 0=72 1=1 5=1 6=20736 9=1
Split                    splitncnn_6              1 2 756 756_splitncnn_0 756_splitncnn_1 -23330=8,3,22,22,72,3,22,22,72
ConvolutionDepthWise     Conv_244                 1 1 756_splitncnn_1 759 -23330=4,3,22,22,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_246                 1 1 759 995 -23330=4,3,22,22,72 0=72 1=1 5=1 6=5184
ConvolutionDepthWise     Conv_247                 1 1 995 764 -23330=4,3,22,22,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_249                 1 1 764 1001 -23330=4,3,22,22,72 0=72 1=1 5=1 6=5184
Split                    splitncnn_7              1 2 1001 1001_splitncnn_0 1001_splitncnn_1 -23330=8,3,22,22,72,3,22,22,72
ConvolutionDepthWise     Conv_250                 1 1 756_splitncnn_0 769 -23330=4,3,22,22,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_252                 1 1 769 1007 -23330=4,3,22,22,72 0=72 1=1 5=1 6=5184
ConvolutionDepthWise     Conv_253                 1 1 1007 774 -23330=4,3,22,22,72 0=72 1=5 4=2 5=1 6=1800 7=72 9=1
Convolution              Conv_255                 1 1 774 1013 -23330=4,3,22,22,72 0=72 1=1 5=1 6=5184
Convolution              Conv_256                 1 1 1013 783 -23330=4,3,22,22,12 0=12 1=1 5=1 6=864 9=4
Convolution              Conv_257                 1 1 1001_splitncnn_1 784 -23330=4,3,22,22,3 0=3 1=1 5=1 6=216 9=4
Convolution              Conv_258                 1 1 1001_splitncnn_0 779 -23330=4,3,22,22,80 0=80 1=1 5=1 6=5760
Convolution              Conv_259                 1 1 986 788 -23330=4,3,11,11,12 0=12 1=1 5=1 6=864 9=4
Convolution              Conv_260                 1 1 974_splitncnn_1 789 -23330=4,3,11,11,3 0=3 1=1 5=1 6=216 9=4
Convolution              Conv_261                 1 1 974_splitncnn_0 782 -23330=4,3,11,11,80 0=80 1=1 5=1 6=5760
Permute                  Transpose_264            1 1 779 785 -23330=4,3,80,22,22 0=5
Softmax                  Softmax_265              1 1 785 786 -23330=4,3,80,22,22 0=2 1=1
Permute                  Transpose_266            1 1 786 787 -23330=4,3,22,22,80 0=5
Permute                  Transpose_269            1 1 782 790 -23330=4,3,80,11,11 0=5
Softmax                  Softmax_270              1 1 790 791 -23330=4,3,80,11,11 0=2 1=1
Permute                  Transpose_271            1 1 791 792 -23330=4,3,11,11,80 0=5
Concat                   Concat_272               3 1 783 784 787 793 -23330=4,3,22,22,95
Permute                  Transpose_273            1 1 793 794 -23330=4,3,95,22,22 0=3
Concat                   Concat_274               3 1 788 789 792 795 -23330=4,3,11,11,95
Permute                  Transpose_275            1 1 795 796 -23330=4,3,95,11,11 0=3
Noop                     output                   2 1 794 796 output
