7767517
530 622
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_182                 1 1 1 2
Convolution              conv_1                   1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_183                 1 1 3 4
Convolution              conv_2                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_184                 1 1 5 6
Slice                    chunk_0                  1 2 6 7 8 -23300=2,-233,-233 1=0
Split                    splitncnn_0              1 2 8 9 10
Convolution              conv_3                   1 1 10 11 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_185                 1 1 11 12
Split                    splitncnn_1              1 2 12 13 14
Convolution              conv_4                   1 1 14 15 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_186                 1 1 15 16
Concat                   cat_0                    4 1 7 9 13 16 17 0=0
Convolution              conv_5                   1 1 17 18 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_187                 1 1 18 19
Pooling                  avgpool2d_363            1 1 19 20 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_6                   1 1 20 21 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_188                 1 1 21 22
Convolution              conv_7                   1 1 22 23 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_189                 1 1 23 24
Slice                    chunk_1                  1 2 24 25 26 -23300=2,-233,-233 1=0
Split                    splitncnn_2              1 3 26 27 28 29
Convolution              conv_8                   1 1 29 30 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_190                 1 1 30 31
Split                    splitncnn_3              1 2 31 32 33
Convolution              conv_9                   1 1 33 34 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_191                 1 1 34 35
Convolution              conv_10                  1 1 35 36 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_192                 1 1 36 37
BinaryOp                 add_0                    2 1 32 37 38 0=0
Split                    splitncnn_4              1 2 38 39 40
Convolution              conv_11                  1 1 40 41 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_193                 1 1 41 42
Convolution              conv_12                  1 1 42 43 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_194                 1 1 43 44
BinaryOp                 add_1                    2 1 39 44 45 0=0
Split                    splitncnn_5              1 2 45 46 47
Convolution              conv_13                  1 1 47 48 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_195                 1 1 48 49
Convolution              conv_14                  1 1 49 50 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_196                 1 1 50 51
BinaryOp                 add_2                    2 1 46 51 52 0=0
Convolution              conv_15                  1 1 28 53 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_197                 1 1 53 54
Concat                   cat_1                    2 1 52 54 55 0=0
Convolution              conv_16                  1 1 55 56 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_198                 1 1 56 57
Convolution              conv_17                  1 1 57 58 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_199                 1 1 58 59
Split                    splitncnn_6              1 3 59 60 61 62
Convolution              conv_18                  1 1 62 63 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_200                 1 1 63 64
Split                    splitncnn_7              1 2 64 65 66
Convolution              conv_19                  1 1 66 67 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_201                 1 1 67 68
Convolution              conv_20                  1 1 68 69 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_202                 1 1 69 70
BinaryOp                 add_3                    2 1 65 70 71 0=0
Split                    splitncnn_8              1 2 71 72 73
Convolution              conv_21                  1 1 73 74 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_203                 1 1 74 75
Convolution              conv_22                  1 1 75 76 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_204                 1 1 76 77
BinaryOp                 add_4                    2 1 72 77 78 0=0
Split                    splitncnn_9              1 2 78 79 80
Convolution              conv_23                  1 1 80 81 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_205                 1 1 81 82
Convolution              conv_24                  1 1 82 83 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_206                 1 1 83 84
BinaryOp                 add_5                    2 1 79 84 85 0=0
Convolution              conv_25                  1 1 61 86 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_207                 1 1 86 87
Concat                   cat_2                    2 1 85 87 88 0=0
Convolution              conv_26                  1 1 88 89 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_208                 1 1 89 90
Convolution              conv_27                  1 1 90 91 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_209                 1 1 91 92
Concat                   cat_3                    4 1 25 27 60 92 93 0=0
Convolution              conv_28                  1 1 93 94 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_210                 1 1 94 95
Split                    splitncnn_10             1 2 95 96 97
Pooling                  avgpool2d_364            1 1 97 98 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_29                  1 1 98 99 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296
Swish                    silu_211                 1 1 99 100
Convolution              conv_30                  1 1 100 101 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_212                 1 1 101 102
Slice                    chunk_2                  1 2 102 103 104 -23300=2,-233,-233 1=0
Split                    splitncnn_11             1 3 104 105 106 107
Convolution              conv_31                  1 1 107 108 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_213                 1 1 108 109
Split                    splitncnn_12             1 2 109 110 111
Convolution              conv_32                  1 1 111 112 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_214                 1 1 112 113
Convolution              conv_33                  1 1 113 114 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_215                 1 1 114 115
BinaryOp                 add_6                    2 1 110 115 116 0=0
Split                    splitncnn_13             1 2 116 117 118
Convolution              conv_34                  1 1 118 119 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_216                 1 1 119 120
Convolution              conv_35                  1 1 120 121 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_217                 1 1 121 122
BinaryOp                 add_7                    2 1 117 122 123 0=0
Split                    splitncnn_14             1 2 123 124 125
Convolution              conv_36                  1 1 125 126 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_218                 1 1 126 127
Convolution              conv_37                  1 1 127 128 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_219                 1 1 128 129
BinaryOp                 add_8                    2 1 124 129 130 0=0
Convolution              conv_38                  1 1 106 131 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_220                 1 1 131 132
Concat                   cat_4                    2 1 130 132 133 0=0
Convolution              conv_39                  1 1 133 134 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_221                 1 1 134 135
Convolution              conv_40                  1 1 135 136 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_222                 1 1 136 137
Split                    splitncnn_15             1 3 137 138 139 140
Convolution              conv_41                  1 1 140 141 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_223                 1 1 141 142
Split                    splitncnn_16             1 2 142 143 144
Convolution              conv_42                  1 1 144 145 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_224                 1 1 145 146
Convolution              conv_43                  1 1 146 147 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_225                 1 1 147 148
BinaryOp                 add_9                    2 1 143 148 149 0=0
Split                    splitncnn_17             1 2 149 150 151
Convolution              conv_44                  1 1 151 152 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_226                 1 1 152 153
Convolution              conv_45                  1 1 153 154 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_227                 1 1 154 155
BinaryOp                 add_10                   2 1 150 155 156 0=0
Split                    splitncnn_18             1 2 156 157 158
Convolution              conv_46                  1 1 158 159 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_228                 1 1 159 160
Convolution              conv_47                  1 1 160 161 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_229                 1 1 161 162
BinaryOp                 add_11                   2 1 157 162 163 0=0
Convolution              conv_48                  1 1 139 164 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_230                 1 1 164 165
Concat                   cat_5                    2 1 163 165 166 0=0
Convolution              conv_49                  1 1 166 167 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_231                 1 1 167 168
Convolution              conv_50                  1 1 168 169 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_232                 1 1 169 170
Concat                   cat_6                    4 1 103 105 138 170 171 0=0
Convolution              conv_51                  1 1 171 172 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_233                 1 1 172 173
Split                    splitncnn_19             1 2 173 174 175
Pooling                  avgpool2d_365            1 1 175 176 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_52                  1 1 176 177 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592
Swish                    silu_234                 1 1 177 178
Convolution              conv_53                  1 1 178 179 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_235                 1 1 179 180
Slice                    chunk_3                  1 2 180 181 182 -23300=2,-233,-233 1=0
Split                    splitncnn_20             1 3 182 183 184 185
Convolution              conv_54                  1 1 185 186 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_236                 1 1 186 187
Split                    splitncnn_21             1 2 187 188 189
Convolution              conv_55                  1 1 189 190 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_237                 1 1 190 191
Convolution              conv_56                  1 1 191 192 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_238                 1 1 192 193
BinaryOp                 add_12                   2 1 188 193 194 0=0
Split                    splitncnn_22             1 2 194 195 196
Convolution              conv_57                  1 1 196 197 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_239                 1 1 197 198
Convolution              conv_58                  1 1 198 199 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_240                 1 1 199 200
BinaryOp                 add_13                   2 1 195 200 201 0=0
Split                    splitncnn_23             1 2 201 202 203
Convolution              conv_59                  1 1 203 204 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_241                 1 1 204 205
Convolution              conv_60                  1 1 205 206 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_242                 1 1 206 207
BinaryOp                 add_14                   2 1 202 207 208 0=0
Convolution              conv_61                  1 1 184 209 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_243                 1 1 209 210
Concat                   cat_7                    2 1 208 210 211 0=0
Convolution              conv_62                  1 1 211 212 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_244                 1 1 212 213
Convolution              conv_63                  1 1 213 214 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_245                 1 1 214 215
Split                    splitncnn_24             1 3 215 216 217 218
Convolution              conv_64                  1 1 218 219 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_246                 1 1 219 220
Split                    splitncnn_25             1 2 220 221 222
Convolution              conv_65                  1 1 222 223 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_247                 1 1 223 224
Convolution              conv_66                  1 1 224 225 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_248                 1 1 225 226
BinaryOp                 add_15                   2 1 221 226 227 0=0
Split                    splitncnn_26             1 2 227 228 229
Convolution              conv_67                  1 1 229 230 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_249                 1 1 230 231
Convolution              conv_68                  1 1 231 232 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_250                 1 1 232 233
BinaryOp                 add_16                   2 1 228 233 234 0=0
Split                    splitncnn_27             1 2 234 235 236
Convolution              conv_69                  1 1 236 237 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_251                 1 1 237 238
Convolution              conv_70                  1 1 238 239 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_252                 1 1 239 240
BinaryOp                 add_17                   2 1 235 240 241 0=0
Convolution              conv_71                  1 1 217 242 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_253                 1 1 242 243
Concat                   cat_8                    2 1 241 243 244 0=0
Convolution              conv_72                  1 1 244 245 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_254                 1 1 245 246
Convolution              conv_73                  1 1 246 247 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_255                 1 1 247 248
Concat                   cat_9                    4 1 181 183 216 248 249 0=0
Convolution              conv_74                  1 1 249 250 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_256                 1 1 250 251
Convolution              conv_75                  1 1 251 252 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_257                 1 1 252 253
Split                    splitncnn_28             1 2 253 254 255
Pooling                  maxpool2d_179            1 1 255 256 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_29             1 2 256 257 258
Pooling                  maxpool2d_180            1 1 258 259 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_30             1 2 259 260 261
Pooling                  maxpool2d_181            1 1 261 262 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_10                   4 1 254 257 260 262 263 0=0
Convolution              conv_76                  1 1 263 264 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_258                 1 1 264 265
Split                    splitncnn_31             1 2 265 266 267
Interp                   upsample_361             1 1 267 268 0=1 1=2.0 2=2.0 6=0
Concat                   cat_11                   2 1 268 174 269 0=0
Convolution              conv_77                  1 1 269 270 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=21504
Swish                    silu_259                 1 1 270 271
Slice                    chunk_4                  1 2 271 272 273 -23300=2,-233,-233 1=0
Split                    splitncnn_32             1 3 273 274 275 276
Convolution              conv_78                  1 1 276 277 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_260                 1 1 277 278
Split                    splitncnn_33             1 2 278 279 280
Convolution              conv_79                  1 1 280 281 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_261                 1 1 281 282
Convolution              conv_80                  1 1 282 283 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_262                 1 1 283 284
BinaryOp                 add_18                   2 1 279 284 285 0=0
Split                    splitncnn_34             1 2 285 286 287
Convolution              conv_81                  1 1 287 288 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_263                 1 1 288 289
Convolution              conv_82                  1 1 289 290 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_264                 1 1 290 291
BinaryOp                 add_19                   2 1 286 291 292 0=0
Split                    splitncnn_35             1 2 292 293 294
Convolution              conv_83                  1 1 294 295 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_265                 1 1 295 296
Convolution              conv_84                  1 1 296 297 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_266                 1 1 297 298
BinaryOp                 add_20                   2 1 293 298 299 0=0
Convolution              conv_85                  1 1 275 300 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_267                 1 1 300 301
Concat                   cat_12                   2 1 299 301 302 0=0
Convolution              conv_86                  1 1 302 303 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_268                 1 1 303 304
Convolution              conv_87                  1 1 304 305 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_269                 1 1 305 306
Split                    splitncnn_36             1 3 306 307 308 309
Convolution              conv_88                  1 1 309 310 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_270                 1 1 310 311
Split                    splitncnn_37             1 2 311 312 313
Convolution              conv_89                  1 1 313 314 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_271                 1 1 314 315
Convolution              conv_90                  1 1 315 316 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_272                 1 1 316 317
BinaryOp                 add_21                   2 1 312 317 318 0=0
Split                    splitncnn_38             1 2 318 319 320
Convolution              conv_91                  1 1 320 321 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_273                 1 1 321 322
Convolution              conv_92                  1 1 322 323 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_274                 1 1 323 324
BinaryOp                 add_22                   2 1 319 324 325 0=0
Split                    splitncnn_39             1 2 325 326 327
Convolution              conv_93                  1 1 327 328 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_275                 1 1 328 329
Convolution              conv_94                  1 1 329 330 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_276                 1 1 330 331
BinaryOp                 add_23                   2 1 326 331 332 0=0
Convolution              conv_95                  1 1 308 333 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_277                 1 1 333 334
Concat                   cat_13                   2 1 332 334 335 0=0
Convolution              conv_96                  1 1 335 336 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_278                 1 1 336 337
Convolution              conv_97                  1 1 337 338 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_279                 1 1 338 339
Concat                   cat_14                   4 1 272 274 307 339 340 0=0
Convolution              conv_98                  1 1 340 341 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_280                 1 1 341 342
Split                    splitncnn_40             1 2 342 343 344
Interp                   upsample_362             1 1 344 345 0=1 1=2.0 2=2.0 6=0
Concat                   cat_15                   2 1 345 96 346 0=0
Convolution              conv_99                  1 1 346 347 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10240
Swish                    silu_281                 1 1 347 348
Slice                    chunk_5                  1 2 348 349 350 -23300=2,-233,-233 1=0
Split                    splitncnn_41             1 3 350 351 352 353
Convolution              conv_100                 1 1 353 354 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_282                 1 1 354 355
Split                    splitncnn_42             1 2 355 356 357
Convolution              conv_101                 1 1 357 358 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_283                 1 1 358 359
Convolution              conv_102                 1 1 359 360 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_284                 1 1 360 361
BinaryOp                 add_24                   2 1 356 361 362 0=0
Split                    splitncnn_43             1 2 362 363 364
Convolution              conv_103                 1 1 364 365 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_285                 1 1 365 366
Convolution              conv_104                 1 1 366 367 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_286                 1 1 367 368
BinaryOp                 add_25                   2 1 363 368 369 0=0
Split                    splitncnn_44             1 2 369 370 371
Convolution              conv_105                 1 1 371 372 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_287                 1 1 372 373
Convolution              conv_106                 1 1 373 374 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_288                 1 1 374 375
BinaryOp                 add_26                   2 1 370 375 376 0=0
Convolution              conv_107                 1 1 352 377 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_289                 1 1 377 378
Concat                   cat_16                   2 1 376 378 379 0=0
Convolution              conv_108                 1 1 379 380 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_290                 1 1 380 381
Convolution              conv_109                 1 1 381 382 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_291                 1 1 382 383
Split                    splitncnn_45             1 3 383 384 385 386
Convolution              conv_110                 1 1 386 387 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_292                 1 1 387 388
Split                    splitncnn_46             1 2 388 389 390
Convolution              conv_111                 1 1 390 391 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_293                 1 1 391 392
Convolution              conv_112                 1 1 392 393 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_294                 1 1 393 394
BinaryOp                 add_27                   2 1 389 394 395 0=0
Split                    splitncnn_47             1 2 395 396 397
Convolution              conv_113                 1 1 397 398 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_295                 1 1 398 399
Convolution              conv_114                 1 1 399 400 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_296                 1 1 400 401
BinaryOp                 add_28                   2 1 396 401 402 0=0
Split                    splitncnn_48             1 2 402 403 404
Convolution              conv_115                 1 1 404 405 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_297                 1 1 405 406
Convolution              conv_116                 1 1 406 407 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_298                 1 1 407 408
BinaryOp                 add_29                   2 1 403 408 409 0=0
Convolution              conv_117                 1 1 385 410 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_299                 1 1 410 411
Concat                   cat_17                   2 1 409 411 412 0=0
Convolution              conv_118                 1 1 412 413 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_300                 1 1 413 414
Convolution              conv_119                 1 1 414 415 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_301                 1 1 415 416
Concat                   cat_18                   4 1 349 351 384 416 417 0=0
Convolution              conv_120                 1 1 417 418 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_302                 1 1 418 419
Split                    splitncnn_49             1 3 419 420 421 422
Pooling                  avgpool2d_366            1 1 422 423 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_121                 1 1 423 424 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=27648
Swish                    silu_303                 1 1 424 425
Concat                   cat_19                   2 1 425 343 426 0=0
Convolution              conv_122                 1 1 426 427 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
Swish                    silu_304                 1 1 427 428
Slice                    chunk_6                  1 2 428 429 430 -23300=2,-233,-233 1=0
Split                    splitncnn_50             1 3 430 431 432 433
Convolution              conv_123                 1 1 433 434 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_305                 1 1 434 435
Split                    splitncnn_51             1 2 435 436 437
Convolution              conv_124                 1 1 437 438 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_306                 1 1 438 439
Convolution              conv_125                 1 1 439 440 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_307                 1 1 440 441
BinaryOp                 add_30                   2 1 436 441 442 0=0
Split                    splitncnn_52             1 2 442 443 444
Convolution              conv_126                 1 1 444 445 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_308                 1 1 445 446
Convolution              conv_127                 1 1 446 447 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_309                 1 1 447 448
BinaryOp                 add_31                   2 1 443 448 449 0=0
Split                    splitncnn_53             1 2 449 450 451
Convolution              conv_128                 1 1 451 452 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_310                 1 1 452 453
Convolution              conv_129                 1 1 453 454 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_311                 1 1 454 455
BinaryOp                 add_32                   2 1 450 455 456 0=0
Convolution              conv_130                 1 1 432 457 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_312                 1 1 457 458
Concat                   cat_20                   2 1 456 458 459 0=0
Convolution              conv_131                 1 1 459 460 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_313                 1 1 460 461
Convolution              conv_132                 1 1 461 462 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_314                 1 1 462 463
Split                    splitncnn_54             1 3 463 464 465 466
Convolution              conv_133                 1 1 466 467 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_315                 1 1 467 468
Split                    splitncnn_55             1 2 468 469 470
Convolution              conv_134                 1 1 470 471 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_316                 1 1 471 472
Convolution              conv_135                 1 1 472 473 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_317                 1 1 473 474
BinaryOp                 add_33                   2 1 469 474 475 0=0
Split                    splitncnn_56             1 2 475 476 477
Convolution              conv_136                 1 1 477 478 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_318                 1 1 478 479
Convolution              conv_137                 1 1 479 480 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_319                 1 1 480 481
BinaryOp                 add_34                   2 1 476 481 482 0=0
Split                    splitncnn_57             1 2 482 483 484
Convolution              conv_138                 1 1 484 485 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_320                 1 1 485 486
Convolution              conv_139                 1 1 486 487 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=5184
Swish                    silu_321                 1 1 487 488
BinaryOp                 add_35                   2 1 483 488 489 0=0
Convolution              conv_140                 1 1 465 490 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152
Swish                    silu_322                 1 1 490 491
Concat                   cat_21                   2 1 489 491 492 0=0
Convolution              conv_141                 1 1 492 493 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_323                 1 1 493 494
Convolution              conv_142                 1 1 494 495 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_324                 1 1 495 496
Concat                   cat_22                   4 1 429 431 464 496 497 0=0
Convolution              conv_143                 1 1 497 498 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_325                 1 1 498 499
Split                    splitncnn_58             1 3 499 500 501 502
Pooling                  avgpool2d_367            1 1 502 503 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_144                 1 1 503 504 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=55296
Swish                    silu_326                 1 1 504 505
Concat                   cat_23                   2 1 505 266 506 0=0
Convolution              conv_145                 1 1 506 507 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_327                 1 1 507 508
Slice                    chunk_7                  1 2 508 509 510 -23300=2,-233,-233 1=0
Split                    splitncnn_59             1 3 510 511 512 513
Convolution              conv_146                 1 1 513 514 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_328                 1 1 514 515
Split                    splitncnn_60             1 2 515 516 517
Convolution              conv_147                 1 1 517 518 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_329                 1 1 518 519
Convolution              conv_148                 1 1 519 520 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_330                 1 1 520 521
BinaryOp                 add_36                   2 1 516 521 522 0=0
Split                    splitncnn_61             1 2 522 523 524
Convolution              conv_149                 1 1 524 525 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_331                 1 1 525 526
Convolution              conv_150                 1 1 526 527 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_332                 1 1 527 528
BinaryOp                 add_37                   2 1 523 528 529 0=0
Split                    splitncnn_62             1 2 529 530 531
Convolution              conv_151                 1 1 531 532 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_333                 1 1 532 533
Convolution              conv_152                 1 1 533 534 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_334                 1 1 534 535
BinaryOp                 add_38                   2 1 530 535 536 0=0
Convolution              conv_153                 1 1 512 537 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_335                 1 1 537 538
Concat                   cat_24                   2 1 536 538 539 0=0
Convolution              conv_154                 1 1 539 540 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_336                 1 1 540 541
Convolution              conv_155                 1 1 541 542 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_337                 1 1 542 543
Split                    splitncnn_63             1 3 543 544 545 546
Convolution              conv_156                 1 1 546 547 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_338                 1 1 547 548
Split                    splitncnn_64             1 2 548 549 550
Convolution              conv_157                 1 1 550 551 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_339                 1 1 551 552
Convolution              conv_158                 1 1 552 553 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_340                 1 1 553 554
BinaryOp                 add_39                   2 1 549 554 555 0=0
Split                    splitncnn_65             1 2 555 556 557
Convolution              conv_159                 1 1 557 558 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_341                 1 1 558 559
Convolution              conv_160                 1 1 559 560 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_342                 1 1 560 561
BinaryOp                 add_40                   2 1 556 561 562 0=0
Split                    splitncnn_66             1 2 562 563 564
Convolution              conv_161                 1 1 564 565 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_343                 1 1 565 566
Convolution              conv_162                 1 1 566 567 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_344                 1 1 567 568
BinaryOp                 add_41                   2 1 563 568 569 0=0
Convolution              conv_163                 1 1 545 570 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_345                 1 1 570 571
Concat                   cat_25                   2 1 569 571 572 0=0
Convolution              conv_164                 1 1 572 573 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_346                 1 1 573 574
Convolution              conv_165                 1 1 574 575 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_347                 1 1 575 576
Concat                   cat_26                   4 1 509 511 544 576 577 0=0
Convolution              conv_166                 1 1 577 578 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_348                 1 1 578 579
Split                    splitncnn_67             1 2 579 580 581
Convolution              conv_167                 1 1 421 582 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_349                 1 1 582 583
ConvolutionDepthWise     convdw_374               1 1 583 584 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_350                 1 1 584 585
ConvolutionDepthWise     convdw_375               1 1 585 586 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_168                 1 1 420 587 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080
Swish                    silu_351                 1 1 587 588
Convolution              conv_169                 1 1 588 589 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_352                 1 1 589 590
Convolution              conv_170                 1 1 590 591 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Concat                   cat_27                   2 1 586 591 592 0=0
Convolution              conv_171                 1 1 501 593 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=55296
Swish                    silu_353                 1 1 593 594
ConvolutionDepthWise     convdw_376               1 1 594 595 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_354                 1 1 595 596
ConvolutionDepthWise     convdw_377               1 1 596 597 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_172                 1 1 500 598 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=69120
Swish                    silu_355                 1 1 598 599
Convolution              conv_173                 1 1 599 600 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_356                 1 1 600 601
Convolution              conv_174                 1 1 601 602 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Concat                   cat_28                   2 1 597 602 603 0=0
Convolution              conv_175                 1 1 581 604 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_357                 1 1 604 605
ConvolutionDepthWise     convdw_378               1 1 605 606 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 7=4
Swish                    silu_358                 1 1 606 607
ConvolutionDepthWise     convdw_379               1 1 607 608 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024 7=4
Convolution              conv_176                 1 1 580 609 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=92160
Swish                    silu_359                 1 1 609 610
Convolution              conv_177                 1 1 610 611 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_360                 1 1 611 612
Convolution              conv_178                 1 1 612 613 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Concat                   cat_29                   2 1 608 613 614 0=0
Reshape                  view_368                 1 1 592 615 0=-1 1=144
Permute                  transpose_371            1 1 615 616 0=1
Reshape                  view_369                 1 1 603 617 0=-1 1=144
Permute                  transpose_372            1 1 617 618 0=1
Reshape                  view_370                 1 1 614 619 0=-1 1=144
Permute                  transpose_373            1 1 619 620 0=1
Concat                   cat_30                   3 1 616 618 620 out0 0=0
