7767517
694 827
Input                    in0                      0 1 in0
MemoryData               pnnx_fold_1567_data      0 1 1 0=64 1=4
MemoryData               pnnx_fold_1446_data      0 1 2 0=64 1=4
Convolution              conv_8                   1 1 in0 3 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_143                 1 1 3 4
ConvolutionDepthWise     convdw_444               1 1 4 5 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2304 7=2
Swish                    silu_144                 1 1 5 6
Convolution              conv_9                   1 1 6 7 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_145                 1 1 7 8
Slice                    split_0                  1 2 8 9 10 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 10 11 12 13
ConvolutionDepthWise     convdw_445               1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=144 7=16
Convolution              conv_10                  1 1 14 15 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Swish                    silu_146                 1 1 15 16
ConvolutionDepthWise     convdw_446               1 1 16 17 0=16 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=784 7=16
Convolution              conv_11                  1 1 17 18 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Swish                    silu_147                 1 1 18 19
BinaryOp                 add_0                    2 1 12 19 20 0=0
Concat                   cat_0                    3 1 9 11 20 21 0=0
Convolution              conv_12                  1 1 21 22 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_148                 1 1 22 23
ConvolutionDepthWise     convdw_447               1 1 23 24 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=9216 7=4
Swish                    silu_149                 1 1 24 25
Convolution              conv_13                  1 1 25 26 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_150                 1 1 26 27
Slice                    split_1                  1 2 27 28 29 -23300=2,32,32 1=0
Split                    splitncnn_1              1 3 29 30 31 32
ConvolutionDepthWise     convdw_448               1 1 32 33 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_14                  1 1 33 34 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_151                 1 1 34 35
ConvolutionDepthWise     convdw_449               1 1 35 36 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_15                  1 1 36 37 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_152                 1 1 37 38
BinaryOp                 add_1                    2 1 31 38 39 0=0
Concat                   cat_1                    3 1 28 30 39 40 0=0
Convolution              conv_16                  1 1 40 41 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_153                 1 1 41 42
Split                    splitncnn_2              1 3 42 43 44 45
ConvolutionDepthWise     convdw_450               1 1 45 46 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=1152 7=128
Convolution              conv_17                  1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_154                 1 1 47 48
Convolution              conv_18                  1 1 48 49 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_155                 1 1 49 50
Split                    splitncnn_3              1 5 50 51 52 53 54 55
Convolution              conv_19                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_319              1 1 56 57 0=-1 1=128
Permute                  transpose_375            1 1 57 58 0=1
Convolution              conv_20                  1 1 54 59 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_4              1 2 59 60 61
ConvolutionDepthWise     convdw_451               1 1 61 62 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Reshape                  flatten_320              1 1 60 63 0=-1 1=64
Permute                  transpose_376            1 1 63 64 0=1
Reshape                  reshape_266              1 1 58 65 0=128 1=-1 2=4
Reshape                  reshape_267              1 1 64 66 0=64 1=-1 2=4
Slice                    split_2                  1 2 65 67 68 -23300=2,64,64 1=2
Permute                  transpose_377            1 1 67 69 0=1
Reshape                  view_278                 1 1 69 70 0=-1 1=32 11=2 2=4
Permute                  transpose_378            1 1 68 71 0=1
Reshape                  view_279                 1 1 71 72 0=-1 1=32 11=2 2=4
Permute                  transpose_379            1 1 66 73 0=1
Reshape                  view_280                 1 1 73 74 0=-1 1=32 11=2 2=4
Permute                  transpose_380            1 1 70 75 0=1
MatMul                   matmul_337               2 1 75 72 76
BinaryOp                 mul_2                    1 1 76 77 0=2 1=1 2=0.17677669
Split                    splitncnn_5              1 2 77 78 79
Reduction                max_353                  1 1 79 80 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_3                    2 1 78 80 81 0=1
UnaryOp                  exp_4                    1 1 81 82 0=7
Split                    splitncnn_6              1 2 82 83 84
Reduction                sum_367                  1 1 84 85 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_5                    2 1 83 85 86 0=3
MatMul                   matmultransb_0           2 1 74 86 87 0=1
Permute                  permute_248              1 1 87 88 0=4
Reshape                  Tensor.reshape_104       2 1 88 53 89 6="64,1w,1h"
Permute                  permute_249              1 1 89 90 0=4
BinaryOp                 add_6                    2 1 90 62 91 0=0
Convolution              conv_21                  1 1 91 92 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_7                    2 1 52 92 93 0=0
Split                    splitncnn_7              1 2 93 94 95
Convolution              conv_22                  1 1 95 96 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_156                 1 1 96 97
Convolution              conv_23                  1 1 97 98 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_8                    2 1 94 98 99 0=0
Split                    splitncnn_8              1 4 99 100 101 102 103
Convolution              conv_24                  1 1 103 104 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_321              1 1 104 105 0=-1 1=128
Permute                  transpose_382            1 1 105 106 0=1
Convolution              conv_25                  1 1 102 107 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_9              1 2 107 108 109
ConvolutionDepthWise     convdw_452               1 1 109 110 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Reshape                  flatten_322              1 1 108 111 0=-1 1=64
Permute                  transpose_383            1 1 111 112 0=1
Reshape                  reshape_268              1 1 106 113 0=128 1=-1 2=4
Reshape                  reshape_269              1 1 112 114 0=64 1=-1 2=4
Slice                    split_3                  1 2 113 115 116 -23300=2,64,64 1=2
Permute                  transpose_384            1 1 115 117 0=1
Reshape                  view_281                 1 1 117 118 0=-1 1=32 11=2 2=4
Permute                  transpose_385            1 1 116 119 0=1
Reshape                  view_282                 1 1 119 120 0=-1 1=32 11=2 2=4
Permute                  transpose_386            1 1 114 121 0=1
Reshape                  view_283                 1 1 121 122 0=-1 1=32 11=2 2=4
Permute                  transpose_387            1 1 118 123 0=1
MatMul                   matmul_339               2 1 123 120 124
BinaryOp                 mul_9                    1 1 124 125 0=2 1=1 2=0.17677669
Split                    splitncnn_10             1 2 125 126 127
Reduction                max_354                  1 1 127 128 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_10                   2 1 126 128 129 0=1
UnaryOp                  exp_11                   1 1 129 130 0=7
Split                    splitncnn_11             1 2 130 131 132
Reduction                sum_368                  1 1 132 133 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_12                   2 1 131 133 134 0=3
MatMul                   matmultransb_1           2 1 122 134 135 0=1
Permute                  permute_250              1 1 135 136 0=4
Reshape                  Tensor.reshape_107       2 1 136 101 137 6="64,1w,1h"
Permute                  permute_251              1 1 137 138 0=4
BinaryOp                 add_13                   2 1 138 110 139 0=0
Convolution              conv_26                  1 1 139 140 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_14                   2 1 100 140 141 0=0
Split                    splitncnn_12             1 2 141 142 143
Convolution              conv_27                  1 1 143 144 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_157                 1 1 144 145
Convolution              conv_28                  1 1 145 146 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_15                   2 1 142 146 147 0=0
Split                    splitncnn_13             1 5 147 148 149 150 151 152
Convolution              conv_29                  1 1 152 153 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_323              1 1 153 154 0=-1 1=128
Permute                  transpose_389            1 1 154 155 0=1
Convolution              conv_30                  1 1 151 156 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_14             1 2 156 157 158
ConvolutionDepthWise     convdw_453               1 1 158 159 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Reshape                  flatten_324              1 1 157 160 0=-1 1=64
Permute                  transpose_390            1 1 160 161 0=1
Reshape                  reshape_270              1 1 155 162 0=128 1=-1 2=4
Reshape                  reshape_271              1 1 161 163 0=64 1=-1 2=4
Slice                    split_4                  1 2 162 164 165 -23300=2,64,64 1=2
Permute                  transpose_391            1 1 164 166 0=1
Reshape                  view_284                 1 1 166 167 0=-1 1=32 11=2 2=4
Permute                  transpose_392            1 1 165 168 0=1
Reshape                  view_285                 1 1 168 169 0=-1 1=32 11=2 2=4
Permute                  transpose_393            1 1 163 170 0=1
Reshape                  view_286                 1 1 170 171 0=-1 1=32 11=2 2=4
Permute                  transpose_394            1 1 167 172 0=1
MatMul                   matmul_341               2 1 172 169 173
BinaryOp                 mul_16                   1 1 173 174 0=2 1=1 2=0.17677669
Split                    splitncnn_15             1 2 174 175 176
Reduction                max_355                  1 1 176 177 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_17                   2 1 175 177 178 0=1
UnaryOp                  exp_18                   1 1 178 179 0=7
Split                    splitncnn_16             1 2 179 180 181
Reduction                sum_369                  1 1 181 182 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_19                   2 1 180 182 183 0=3
MatMul                   matmultransb_2           2 1 171 183 184 0=1
Permute                  permute_252              1 1 184 185 0=4
Reshape                  Tensor.reshape_110       2 1 185 150 186 6="64,1w,1h"
Permute                  permute_253              1 1 186 187 0=4
BinaryOp                 add_20                   2 1 187 159 188 0=0
Convolution              conv_31                  1 1 188 189 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_21                   2 1 149 189 190 0=0
Split                    splitncnn_17             1 2 190 191 192
Convolution              conv_32                  1 1 192 193 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_158                 1 1 193 194
Convolution              conv_33                  1 1 194 195 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_22                   2 1 191 195 196 0=0
Split                    splitncnn_18             1 4 196 197 198 199 200
Convolution              conv_34                  1 1 200 201 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Reshape                  flatten_325              1 1 201 202 0=-1 1=128
Permute                  transpose_396            1 1 202 203 0=1
Convolution              conv_35                  1 1 199 204 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Split                    splitncnn_19             1 2 204 205 206
ConvolutionDepthWise     convdw_454               1 1 206 207 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64
Reshape                  flatten_326              1 1 205 208 0=-1 1=64
Permute                  transpose_397            1 1 208 209 0=1
Reshape                  reshape_272              1 1 203 210 0=128 1=-1 2=4
Reshape                  reshape_273              1 1 209 211 0=64 1=-1 2=4
Slice                    split_5                  1 2 210 212 213 -23300=2,64,64 1=2
Permute                  transpose_398            1 1 212 214 0=1
Reshape                  view_287                 1 1 214 215 0=-1 1=32 11=2 2=4
Permute                  transpose_399            1 1 213 216 0=1
Reshape                  view_288                 1 1 216 217 0=-1 1=32 11=2 2=4
Permute                  transpose_400            1 1 211 218 0=1
Reshape                  view_289                 1 1 218 219 0=-1 1=32 11=2 2=4
Permute                  transpose_401            1 1 215 220 0=1
MatMul                   matmul_343               2 1 220 217 221
BinaryOp                 mul_23                   1 1 221 222 0=2 1=1 2=0.17677669
Split                    splitncnn_20             1 2 222 223 224
Reduction                max_356                  1 1 224 225 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_24                   2 1 223 225 226 0=1
UnaryOp                  exp_25                   1 1 226 227 0=7
Split                    splitncnn_21             1 2 227 228 229
Reduction                sum_370                  1 1 229 230 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_26                   2 1 228 230 231 0=3
MatMul                   matmultransb_3           2 1 219 231 232 0=1
Permute                  permute_254              1 1 232 233 0=4
Reshape                  Tensor.reshape_113       2 1 233 198 234 6="64,1w,1h"
Permute                  permute_255              1 1 234 235 0=4
BinaryOp                 add_27                   2 1 235 207 236 0=0
Convolution              conv_36                  1 1 236 237 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 add_28                   2 1 197 237 238 0=0
Split                    splitncnn_22             1 2 238 239 240
Convolution              conv_37                  1 1 240 241 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_159                 1 1 241 242
Convolution              conv_38                  1 1 242 243 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 add_29                   2 1 239 243 244 0=0
Concat                   cat_2                    3 1 51 148 244 245 0=0
Convolution              conv_39                  1 1 245 246 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_160                 1 1 246 247
Split                    splitncnn_23             1 3 247 248 249 250
ConvolutionDepthWise     convdw_455               1 1 250 251 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=0 6=1152 7=128
Convolution              conv_40                  1 1 251 252 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_161                 1 1 252 253
Convolution              conv_41                  1 1 253 254 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_162                 1 1 254 255
Split                    splitncnn_24             1 5 255 256 257 258 259 260
Convolution              conv_42                  1 1 260 261 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_327              1 1 261 262 0=-1 1=256
Permute                  transpose_403            1 1 262 263 0=1
Convolution              conv_43                  1 1 259 264 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_25             1 2 264 265 266
ConvolutionDepthWise     convdw_456               1 1 266 267 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_328              1 1 265 268 0=-1 1=128
Permute                  transpose_404            1 1 268 269 0=1
Slice                    split_6                  1 2 263 270 271 -23300=2,128,128 1=1
Permute                  transpose_405            1 1 270 272 0=1
Reshape                  view_290                 1 1 272 273 0=-1 1=32 2=4
Permute                  transpose_406            1 1 271 274 0=1
Reshape                  view_291                 1 1 274 275 0=-1 1=32 2=4
Permute                  transpose_407            1 1 269 276 0=1
Reshape                  view_292                 1 1 276 277 0=-1 1=32 2=4
Permute                  transpose_408            1 1 273 278 0=1
MatMul                   matmul_345               2 1 278 275 279
BinaryOp                 mul_30                   1 1 279 280 0=2 1=1 2=0.17677669
Split                    splitncnn_26             1 2 280 281 282
Reduction                max_357                  1 1 282 283 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_31                   2 1 281 283 284 0=1
UnaryOp                  exp_32                   1 1 284 285 0=7
Split                    splitncnn_27             1 2 285 286 287
Reduction                sum_371                  1 1 287 288 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_33                   2 1 286 288 289 0=3
MatMul                   matmultransb_4           2 1 277 289 290 0=1
Permute                  permute_256              1 1 290 291 0=4
Reshape                  Tensor.reshape_114       2 1 291 258 292 6="128,1w,1h"
Permute                  permute_257              1 1 292 293 0=4
BinaryOp                 add_34                   2 1 293 267 294 0=0
Convolution              conv_44                  1 1 294 295 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_35                   2 1 257 295 296 0=0
Split                    splitncnn_28             1 2 296 297 298
Convolution              conv_45                  1 1 298 299 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_163                 1 1 299 300
Convolution              conv_46                  1 1 300 301 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_36                   2 1 297 301 302 0=0
Split                    splitncnn_29             1 4 302 303 304 305 306
Convolution              conv_47                  1 1 306 307 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_329              1 1 307 308 0=-1 1=256
Permute                  transpose_410            1 1 308 309 0=1
Convolution              conv_48                  1 1 305 310 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_30             1 2 310 311 312
ConvolutionDepthWise     convdw_457               1 1 312 313 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_330              1 1 311 314 0=-1 1=128
Permute                  transpose_411            1 1 314 315 0=1
Slice                    split_7                  1 2 309 316 317 -23300=2,128,128 1=1
Permute                  transpose_412            1 1 316 318 0=1
Reshape                  view_293                 1 1 318 319 0=-1 1=32 2=4
Permute                  transpose_413            1 1 317 320 0=1
Reshape                  view_294                 1 1 320 321 0=-1 1=32 2=4
Permute                  transpose_414            1 1 315 322 0=1
Reshape                  view_295                 1 1 322 323 0=-1 1=32 2=4
Permute                  transpose_415            1 1 319 324 0=1
MatMul                   matmul_347               2 1 324 321 325
BinaryOp                 mul_37                   1 1 325 326 0=2 1=1 2=0.17677669
Split                    splitncnn_31             1 2 326 327 328
Reduction                max_358                  1 1 328 329 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_38                   2 1 327 329 330 0=1
UnaryOp                  exp_39                   1 1 330 331 0=7
Split                    splitncnn_32             1 2 331 332 333
Reduction                sum_372                  1 1 333 334 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_40                   2 1 332 334 335 0=3
MatMul                   matmultransb_5           2 1 323 335 336 0=1
Permute                  permute_258              1 1 336 337 0=4
Reshape                  Tensor.reshape_115       2 1 337 304 338 6="128,1w,1h"
Permute                  permute_259              1 1 338 339 0=4
BinaryOp                 add_41                   2 1 339 313 340 0=0
Convolution              conv_49                  1 1 340 341 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_42                   2 1 303 341 342 0=0
Split                    splitncnn_33             1 2 342 343 344
Convolution              conv_50                  1 1 344 345 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_164                 1 1 345 346
Convolution              conv_51                  1 1 346 347 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_43                   2 1 343 347 348 0=0
Split                    splitncnn_34             1 5 348 349 350 351 352 353
Convolution              conv_52                  1 1 353 354 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_331              1 1 354 355 0=-1 1=256
Permute                  transpose_417            1 1 355 356 0=1
Convolution              conv_53                  1 1 352 357 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_35             1 2 357 358 359
ConvolutionDepthWise     convdw_458               1 1 359 360 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_332              1 1 358 361 0=-1 1=128
Permute                  transpose_418            1 1 361 362 0=1
Slice                    split_8                  1 2 356 363 364 -23300=2,128,128 1=1
Permute                  transpose_419            1 1 363 365 0=1
Reshape                  view_296                 1 1 365 366 0=-1 1=32 2=4
Permute                  transpose_420            1 1 364 367 0=1
Reshape                  view_297                 1 1 367 368 0=-1 1=32 2=4
Permute                  transpose_421            1 1 362 369 0=1
Reshape                  view_298                 1 1 369 370 0=-1 1=32 2=4
Permute                  transpose_422            1 1 366 371 0=1
MatMul                   matmul_349               2 1 371 368 372
BinaryOp                 mul_44                   1 1 372 373 0=2 1=1 2=0.17677669
Split                    splitncnn_36             1 2 373 374 375
Reduction                max_359                  1 1 375 376 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_45                   2 1 374 376 377 0=1
UnaryOp                  exp_46                   1 1 377 378 0=7
Split                    splitncnn_37             1 2 378 379 380
Reduction                sum_373                  1 1 380 381 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_47                   2 1 379 381 382 0=3
MatMul                   matmultransb_6           2 1 370 382 383 0=1
Permute                  permute_260              1 1 383 384 0=4
Reshape                  Tensor.reshape_116       2 1 384 351 385 6="128,1w,1h"
Permute                  permute_261              1 1 385 386 0=4
BinaryOp                 add_48                   2 1 386 360 387 0=0
Convolution              conv_54                  1 1 387 388 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_49                   2 1 350 388 389 0=0
Split                    splitncnn_38             1 2 389 390 391
Convolution              conv_55                  1 1 391 392 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_165                 1 1 392 393
Convolution              conv_56                  1 1 393 394 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_50                   2 1 390 394 395 0=0
Split                    splitncnn_39             1 4 395 396 397 398 399
Convolution              conv_57                  1 1 399 400 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  flatten_333              1 1 400 401 0=-1 1=256
Permute                  transpose_424            1 1 401 402 0=1
Convolution              conv_58                  1 1 398 403 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Split                    splitncnn_40             1 2 403 404 405
ConvolutionDepthWise     convdw_459               1 1 405 406 0=128 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3200 7=128
Reshape                  flatten_334              1 1 404 407 0=-1 1=128
Permute                  transpose_425            1 1 407 408 0=1
Slice                    split_9                  1 2 402 409 410 -23300=2,128,128 1=1
Permute                  transpose_426            1 1 409 411 0=1
Reshape                  view_299                 1 1 411 412 0=-1 1=32 2=4
Permute                  transpose_427            1 1 410 413 0=1
Reshape                  view_300                 1 1 413 414 0=-1 1=32 2=4
Permute                  transpose_428            1 1 408 415 0=1
Reshape                  view_301                 1 1 415 416 0=-1 1=32 2=4
Permute                  transpose_429            1 1 412 417 0=1
MatMul                   matmul_351               2 1 417 414 418
BinaryOp                 mul_51                   1 1 418 419 0=2 1=1 2=0.17677669
Split                    splitncnn_41             1 2 419 420 421
Reduction                max_360                  1 1 421 422 0=4 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 sub_52                   2 1 420 422 423 0=1
UnaryOp                  exp_53                   1 1 423 424 0=7
Split                    splitncnn_42             1 2 424 425 426
Reduction                sum_374                  1 1 426 427 0=0 1=0 -23303=1,-1 4=1 5=1
BinaryOp                 div_54                   2 1 425 427 428 0=3
MatMul                   matmultransb_7           2 1 416 428 429 0=1
Permute                  permute_262              1 1 429 430 0=4
Reshape                  Tensor.reshape_117       2 1 430 397 431 6="128,1w,1h"
Permute                  permute_263              1 1 431 432 0=4
BinaryOp                 add_55                   2 1 432 406 433 0=0
Convolution              conv_59                  1 1 433 434 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_56                   2 1 396 434 435 0=0
Split                    splitncnn_43             1 2 435 436 437
Convolution              conv_60                  1 1 437 438 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_166                 1 1 438 439
Convolution              conv_61                  1 1 439 440 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_57                   2 1 436 440 441 0=0
Concat                   cat_3                    3 1 256 349 441 442 0=0
Convolution              conv_62                  1 1 442 443 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_167                 1 1 443 444
Split                    splitncnn_44             1 2 444 445 446
Pooling                  avgpool2d_6              1 1 44 447 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Interp                   upsample_242             1 1 446 448 0=1 1=2.0 2=2.0 6=0
Concat                   cat_4                    3 1 447 248 448 449 0=0
Convolution              conv_63                  1 1 449 450 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_168                 1 1 450 451
Convolution              conv_64                  1 1 451 452 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_169                 1 1 452 453
Slice                    chunk_0                  1 3 453 454 455 456 -23300=3,-233,-233,-233 1=0
Split                    splitncnn_46             1 3 456 457 458 459
Split                    splitncnn_45             1 4 455 460 461 462 463
Convolution              conv_65                  1 1 463 464 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_170                 1 1 464 465
Split                    splitncnn_47             1 2 465 466 467
Reshape                  flatten_335              1 1 467 468 0=-1 1=64
Permute                  transpose_431            1 1 468 469 0=1
Split                    splitncnn_48             1 5 469 470 471 472 473 474
Reduction                mean_363                 1 1 474 475 0=3 1=0 -23303=1,0 4=0 5=1
Reduction                max_361                  1 1 473 476 0=4 1=0 -23303=1,0 4=0 5=1
Concat                   cat_5                    2 1 475 476 477 0=0
InnerProduct             linear_141               1 1 477 478 0=256 1=1 2=32768
Reshape                  view_302                 1 1 478 479 0=64 1=4
BinaryOp                 add_58                   2 1 2 479 480 0=0
Gemm                     gemm_0                   1 1 471 481 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=64 9=64
Reshape                  view_303                 1 1 481 482 0=16 1=4 2=-1
Permute                  transpose_432            1 1 482 483 0=2
Reshape                  view_304                 1 1 480 484 0=16 1=4 2=4
Permute                  permute_264              1 1 484 485 0=2
Reshape                  reshape_274              1 1 483 486 0=16 1=-1 2=4
Reshape                  reshape_275              1 1 485 487 0=16 1=4 2=4
MatMul                   matmultransb_8           2 1 486 487 488 0=1
BinaryOp                 div_59                   1 1 488 489 0=3 1=1 2=4.0
Reshape                  view_305                 1 1 489 490 0=4 1=-1 2=4
Reduction                mean_364                 1 1 490 491 0=3 1=0 -23303=1,0 4=0 5=1
Softmax                  softmax_246              1 1 491 492 0=0 1=1
Split                    splitncnn_49             1 2 492 493 494
Permute                  transpose_434            1 1 494 495 0=1
MatMul                   bmm_314                  2 1 495 472 496
Gemm                     gemm_1                   1 1 496 497 10=4 2=0 3=1 4=0 5=1 6=1 7=4 8=64 9=64
GELU                     gelu_137                 1 1 497 498
MatMul                   bmm_315                  2 1 493 498 499
Gemm                     gemm_2                   1 1 499 500 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=64 9=64
GELU                     gelu_138                 1 1 500 501
BinaryOp                 add_60                   2 1 501 470 502 0=0
Permute                  transpose_435            1 1 502 503 0=1
Reshape                  Tensor.view_150          2 1 503 466 504 6="1w,1h,64"
Convolution              conv_66                  1 1 462 505 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_171                 1 1 505 506
Concat                   cat_6                    2 1 504 506 507 0=0
Convolution              conv_67                  1 1 507 508 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_172                 1 1 508 509
Convolution              conv_68                  1 1 461 510 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_173                 1 1 510 511
Split                    splitncnn_50             1 2 511 512 513
Reshape                  flatten_336              1 1 513 514 0=-1 1=64
Permute                  transpose_436            1 1 514 515 0=1
Split                    splitncnn_51             1 5 515 516 517 518 519 520
Reduction                mean_365                 1 1 520 521 0=3 1=0 -23303=1,0 4=0 5=1
Reduction                max_362                  1 1 519 522 0=4 1=0 -23303=1,0 4=0 5=1
Concat                   cat_7                    2 1 521 522 523 0=0
InnerProduct             linear_142               1 1 523 524 0=256 1=1 2=32768
Reshape                  view_306                 1 1 524 525 0=64 1=4
BinaryOp                 add_61                   2 1 1 525 526 0=0
Gemm                     gemm_3                   1 1 517 527 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=64 9=64
Reshape                  view_307                 1 1 527 528 0=16 1=4 2=-1
Permute                  transpose_437            1 1 528 529 0=2
Reshape                  view_308                 1 1 526 530 0=16 1=4 2=4
Permute                  permute_265              1 1 530 531 0=2
Reshape                  reshape_276              1 1 529 532 0=16 1=-1 2=4
Reshape                  reshape_277              1 1 531 533 0=16 1=4 2=4
MatMul                   matmultransb_9           2 1 532 533 534 0=1
BinaryOp                 div_62                   1 1 534 535 0=3 1=1 2=4.0
Reshape                  view_309                 1 1 535 536 0=4 1=-1 2=4
Reduction                mean_366                 1 1 536 537 0=3 1=0 -23303=1,0 4=0 5=1
Softmax                  softmax_247              1 1 537 538 0=0 1=1
Split                    splitncnn_52             1 2 538 539 540
Permute                  transpose_439            1 1 540 541 0=1
MatMul                   bmm_317                  2 1 541 518 542
Gemm                     gemm_4                   1 1 542 543 10=4 2=0 3=1 4=0 5=1 6=1 7=4 8=64 9=64
GELU                     gelu_139                 1 1 543 544
MatMul                   bmm_318                  2 1 539 544 545
Gemm                     gemm_5                   1 1 545 546 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=64 9=64
GELU                     gelu_140                 1 1 546 547
BinaryOp                 add_63                   2 1 547 516 548 0=0
Permute                  transpose_440            1 1 548 549 0=1
Reshape                  Tensor.view_155          2 1 549 512 550 6="1w,1h,64"
Convolution              conv_69                  1 1 460 551 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_174                 1 1 551 552
Concat                   cat_8                    2 1 550 552 553 0=0
Convolution              conv_70                  1 1 553 554 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_175                 1 1 554 555
Convolution              conv_71                  1 1 459 556 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_176                 1 1 556 557
Split                    splitncnn_53             1 2 557 558 559
ConvolutionDepthWise     convdw_460               1 1 559 560 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_72                  1 1 560 561 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_177                 1 1 561 562
ConvolutionDepthWise     convdw_461               1 1 562 563 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_73                  1 1 563 564 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_178                 1 1 564 565
BinaryOp                 add_64                   2 1 558 565 566 0=0
Split                    splitncnn_54             1 2 566 567 568
ConvolutionDepthWise     convdw_462               1 1 568 569 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_74                  1 1 569 570 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_179                 1 1 570 571
ConvolutionDepthWise     convdw_463               1 1 571 572 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_75                  1 1 572 573 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_180                 1 1 573 574
BinaryOp                 add_65                   2 1 567 574 575 0=0
Convolution              conv_76                  1 1 458 576 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_181                 1 1 576 577
Concat                   cat_9                    2 1 575 577 578 0=0
Convolution              conv_77                  1 1 578 579 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_182                 1 1 579 580
Concat                   cat_10                   5 1 454 509 457 580 555 581 0=0
Convolution              conv_78                  1 1 581 582 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=40960
Swish                    silu_183                 1 1 582 583
Split                    splitncnn_55             1 5 583 584 585 586 587 588
Interp                   upsample_243             1 1 588 589 0=1 1=2.0 2=2.0 6=0
Split                    splitncnn_56             1 2 589 590 591
Pooling                  avgpool2d_7              1 1 587 592 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=1
Convolution              conv_79                  1 1 592 593 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_184                 1 1 593 594
Split                    splitncnn_57             1 2 594 595 596
BinaryOp                 mul_66                   1 1 584 597 0=2 1=1 2=0.73291016
BinaryOp                 add_67                   2 1 249 597 598 0=0
BinaryOp                 mul_68                   1 1 590 599 0=2 1=1 2=-0.01343536
BinaryOp                 add_69                   2 1 43 599 600 0=0
BinaryOp                 mul_70                   1 1 595 601 0=2 1=1 2=0.38134766
BinaryOp                 add_71                   2 1 445 601 602 0=0
Split                    splitncnn_58             1 2 602 603 604
Interp                   upsample_244             1 1 604 605 0=1 1=2.0 2=2.0 6=0
Concat                   cat_11                   2 1 605 598 606 0=0
Convolution              conv_80                  1 1 606 607 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_185                 1 1 607 608
Slice                    split_10                 1 2 608 609 610 -23300=2,64,64 1=0
Split                    splitncnn_59             1 3 610 611 612 613
Convolution              conv_81                  1 1 613 614 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_186                 1 1 614 615
Split                    splitncnn_60             1 2 615 616 617
ConvolutionDepthWise     convdw_464               1 1 617 618 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_82                  1 1 618 619 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_187                 1 1 619 620
ConvolutionDepthWise     convdw_465               1 1 620 621 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_83                  1 1 621 622 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_188                 1 1 622 623
BinaryOp                 add_72                   2 1 616 623 624 0=0
Split                    splitncnn_61             1 2 624 625 626
ConvolutionDepthWise     convdw_466               1 1 626 627 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_84                  1 1 627 628 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_189                 1 1 628 629
ConvolutionDepthWise     convdw_467               1 1 629 630 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_85                  1 1 630 631 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_190                 1 1 631 632
BinaryOp                 add_73                   2 1 625 632 633 0=0
Convolution              conv_86                  1 1 612 634 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_191                 1 1 634 635
Concat                   cat_12                   2 1 633 635 636 0=0
Convolution              conv_87                  1 1 636 637 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_192                 1 1 637 638
Concat                   cat_13                   3 1 609 611 638 639 0=0
Convolution              conv_88                  1 1 639 640 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_193                 1 1 640 641
Split                    splitncnn_62             1 2 641 642 643
BinaryOp                 mul_74                   1 1 585 644 0=2 1=1 2=-0.02716064
BinaryOp                 add_75                   2 1 642 644 645 0=0
Interp                   upsample_245             1 1 643 646 0=1 1=2.0 2=2.0 6=0
Concat                   cat_14                   2 1 646 600 647 0=0
Convolution              conv_89                  1 1 647 648 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_194                 1 1 648 649
Slice                    split_11                 1 2 649 650 651 -23300=2,32,32 1=0
Split                    splitncnn_63             1 3 651 652 653 654
Convolution              conv_90                  1 1 654 655 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_195                 1 1 655 656
Split                    splitncnn_64             1 2 656 657 658
ConvolutionDepthWise     convdw_468               1 1 658 659 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_91                  1 1 659 660 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_196                 1 1 660 661
ConvolutionDepthWise     convdw_469               1 1 661 662 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_92                  1 1 662 663 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_197                 1 1 663 664
BinaryOp                 add_76                   2 1 657 664 665 0=0
Split                    splitncnn_65             1 2 665 666 667
ConvolutionDepthWise     convdw_470               1 1 667 668 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=288 7=32
Convolution              conv_93                  1 1 668 669 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_198                 1 1 669 670
ConvolutionDepthWise     convdw_471               1 1 670 671 0=32 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=1568 7=32
Convolution              conv_94                  1 1 671 672 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_199                 1 1 672 673
BinaryOp                 add_77                   2 1 666 673 674 0=0
Convolution              conv_95                  1 1 653 675 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_200                 1 1 675 676
Concat                   cat_15                   2 1 674 676 677 0=0
Convolution              conv_96                  1 1 677 678 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_201                 1 1 678 679
Concat                   cat_16                   3 1 650 652 679 680 0=0
Convolution              conv_97                  1 1 680 681 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_202                 1 1 681 682
Convolution              conv_98                  1 1 591 683 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_203                 1 1 683 684
Eltwise                  weighted_sum_0           2 1 682 684 685 0=1 -23301=2,1.0,0.32373047
Split                    splitncnn_66             1 3 685 686 687 688
Convolution              conv_99                  1 1 687 689 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_204                 1 1 689 690
Concat                   cat_17                   2 1 690 645 691 0=0
Convolution              conv_100                 1 1 691 692 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_205                 1 1 692 693
Slice                    split_12                 1 2 693 694 695 -23300=2,64,64 1=0
Split                    splitncnn_67             1 3 695 696 697 698
Convolution              conv_101                 1 1 698 699 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_206                 1 1 699 700
Split                    splitncnn_68             1 2 700 701 702
ConvolutionDepthWise     convdw_472               1 1 702 703 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_102                 1 1 703 704 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_207                 1 1 704 705
ConvolutionDepthWise     convdw_473               1 1 705 706 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_103                 1 1 706 707 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_208                 1 1 707 708
BinaryOp                 add_80                   2 1 701 708 709 0=0
Split                    splitncnn_69             1 2 709 710 711
ConvolutionDepthWise     convdw_474               1 1 711 712 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=576 7=64
Convolution              conv_104                 1 1 712 713 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_209                 1 1 713 714
ConvolutionDepthWise     convdw_475               1 1 714 715 0=64 1=7 11=7 12=1 13=1 14=3 2=1 3=1 4=3 5=0 6=3136 7=64
Convolution              conv_105                 1 1 715 716 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_210                 1 1 716 717
BinaryOp                 add_81                   2 1 710 717 718 0=0
Convolution              conv_106                 1 1 697 719 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_211                 1 1 719 720
Concat                   cat_18                   2 1 718 720 721 0=0
Convolution              conv_107                 1 1 721 722 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_212                 1 1 722 723
Concat                   cat_19                   3 1 694 696 723 724 0=0
Convolution              conv_108                 1 1 724 725 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_213                 1 1 725 726
Split                    splitncnn_70             1 2 726 727 728
BinaryOp                 mul_82                   1 1 586 729 0=2 1=1 2=-0.11151123
BinaryOp                 add_83                   2 1 727 729 730 0=0
Split                    splitncnn_71             1 2 730 731 732
Convolution              conv_109                 1 1 728 733 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_214                 1 1 733 734
Concat                   cat_20                   2 1 734 603 735 0=0
Convolution              conv_110                 1 1 735 736 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_215                 1 1 736 737
Slice                    split_13                 1 2 737 738 739 -23300=2,128,128 1=0
Split                    splitncnn_72             1 3 739 740 741 742
Convolution              conv_111                 1 1 742 743 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_216                 1 1 743 744
Split                    splitncnn_73             1 2 744 745 746
ConvolutionDepthWise     convdw_476               1 1 746 747 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=1152 7=128
Convolution              conv_112                 1 1 747 748 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_217                 1 1 748 749
