7767517
15 12
pnnx.Input               in0                      0 1 0 #0=(1,3,16)f32
pnnx.Input               in1                      0 1 1 #1=(1,5,9,11)f32
pnnx.Input               in2                      0 1 2 #2=(14,8,5,9,10)f32
pnnx.Expression          pnnx_expr_2              0 1 3 expr=2
TopK                     TopK_0                   2 2 0 3 4 5 axis=1 largest=1 sorted=1 #0=(1,3,16)f32 #4=(1,2,16)f32 #5=(1,2,16)i64
pnnx.Expression          pnnx_expr_1              0 1 6 expr=4
TopK                     TopK_1                   2 2 1 6 7 8 axis=3 largest=0 sorted=1 #1=(1,5,9,11)f32 #7=(1,5,9,4)f32 #8=(1,5,9,4)i64
pnnx.Expression          pnnx_expr_0              0 1 9 expr=3
TopK                     TopK_2                   2 2 2 9 10 11 axis=0 largest=1 sorted=1 #2=(14,8,5,9,10)f32 #10=(3,8,5,9,10)f32 #11=(3,8,5,9,10)i64
pnnx.Output              out0                     1 0 4 #4=(1,2,16)f32
pnnx.Output              out1                     1 0 5 #5=(1,2,16)i64
pnnx.Output              out2                     1 0 7 #7=(1,5,9,4)f32
pnnx.Output              out3                     1 0 8 #8=(1,5,9,4)i64
pnnx.Output              out4                     1 0 10 #10=(3,8,5,9,10)f32
pnnx.Output              out5                     1 0 11 #11=(3,8,5,9,10)i64
