7767517
9 12
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Input                    in2                      0 1 in2
pnnx.Expression          pnnx_expr_2              0 1 3
TopK                     topk_0                   2 2 in0 3 out0 out1 0=1 1=1 2=1
pnnx.Expression          pnnx_expr_1              0 1 6
TopK                     topk_1                   2 2 in1 6 out2 out3 0=3 1=0 2=1
pnnx.Expression          pnnx_expr_0              0 1 9
TopK                     topk_2                   2 2 in2 9 out4 out5 0=0 1=1 2=1
