7767517
9 9
Input                    in0                      0 1 in0
Input                    in1                      0 1 in1
Convolution              conv_1                   1 1 in0 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432
Reshape                  view_4                   1 1 2 3 0=65536
InnerProduct             linear_2                 1 1 3 4 0=128 1=1 2=8388608
Gemm                     gemm_0                   1 1 in1 5 10=4 2=0 3=1 4=0 5=1 6=1 7=1 8=128 9=100
Reshape                  view_5                   1 1 5 6 0=128
Concat                   cat_0                    2 1 4 6 7 0=0
InnerProduct             linear_3                 1 1 7 out0 0=10 1=1 2=2560
