7767517
873 1205
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 24 in1 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 48 in2 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 48 in3 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
Input                    kv_cache                 0 48 cache_k0 cache_v0 cache_k1 cache_v1 cache_k2 cache_v2 cache_k3 cache_v3 cache_k4 cache_v4 cache_k5 cache_v5 cache_k6 cache_v6 cache_k7 cache_v7 cache_k8 cache_v8 cache_k9 cache_v9 cache_k10 cache_v10 cache_k11 cache_v11 cache_k12 cache_v12 cache_k13 cache_v13 cache_k14 cache_v14 cache_k15 cache_v15 cache_k16 cache_v16 cache_k17 cache_v17 cache_k18 cache_v18 cache_k19 cache_v19 cache_k20 cache_v20 cache_k21 cache_v21 cache_k22 cache_v22 cache_k23 cache_v23
RMSNorm                  rmsn_192                 1 1 2 126 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_4              1 3 126 127 128 129
Gemm                     gemm_0                   1 1 129 130 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_337              1 1 130 131 0=128 1=16 2=-1
Permute                  transpose_481            1 1 131 132 0=2
Gemm                     gemm_1                   1 1 128 133 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_338              1 1 133 134 0=128 1=8 2=-1
Permute                  transpose_482            1 1 134 135 0=2
Gemm                     gemm_2                   1 1 127 136 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_339              1 1 136 137 0=128 1=8 2=-1
Permute                  transpose_483            1 1 137 138 0=2
RotaryEmbed              rope_0                   3 1 132 76 125 139 0=0
RMSNorm                  rmsn_193                 1 1 139 140 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_1                   3 1 135 75 124 141 0=0
RMSNorm                  rmsn_194                 1 1 141 142 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_577            1 1 142 143 -23303=1,1
Tile                     expand_289               1 1 143 144 -23302=4,1,2,1,1
Reshape                  reshape_340              1 1 144 145 0=128 1=-1 2=16
ExpandDims               unsqueeze_578            1 1 138 146 -23303=1,1
Tile                     expand_290               1 1 146 147 -23302=4,1,2,1,1
Reshape                  reshape_341              1 1 147 148 0=128 1=-1 2=16
SDPA                     sdpa_625                 6 3 140 145 148 27 cache_k0 cache_v0 149 out_cache_k0 out_cache_v0 5=1 6=0.0883883 7=1
Permute                  transpose_484            1 1 149 150 0=2
Reshape                  reshape_342              1 1 150 151 0=2048 1=-1
Gemm                     gemm_3                   1 1 151 152 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_0                    2 1 1 152 153 0=0
Split                    splitncnn_5              1 2 153 154 155
RMSNorm                  rmsn_195                 1 1 155 156 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_6              1 2 156 157 158
Gemm                     gemm_4                   1 1 158 159 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_168                 1 1 159 160
Gemm                     gemm_5                   1 1 157 161 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_1                    2 1 160 161 162 0=2
Gemm                     gemm_6                   1 1 162 163 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_2                    2 1 154 163 164 0=0
Split                    splitncnn_7              1 2 164 165 166
RMSNorm                  rmsn_196                 1 1 166 167 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_8              1 3 167 168 169 170
Gemm                     gemm_7                   1 1 170 171 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_343              1 1 171 172 0=128 1=16 2=-1
Permute                  transpose_485            1 1 172 173 0=2
Gemm                     gemm_8                   1 1 169 174 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_344              1 1 174 175 0=128 1=8 2=-1
Permute                  transpose_486            1 1 175 176 0=2
Gemm                     gemm_9                   1 1 168 177 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_345              1 1 177 178 0=128 1=8 2=-1
Permute                  transpose_487            1 1 178 179 0=2
RotaryEmbed              rope_2                   3 1 173 74 123 180 0=0
RMSNorm                  rmsn_197                 1 1 180 181 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_3                   3 1 176 73 122 182 0=0
RMSNorm                  rmsn_198                 1 1 182 183 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_579            1 1 183 184 -23303=1,1
Tile                     expand_291               1 1 184 185 -23302=4,1,2,1,1
Reshape                  reshape_346              1 1 185 186 0=128 1=-1 2=16
ExpandDims               unsqueeze_580            1 1 179 187 -23303=1,1
Tile                     expand_292               1 1 187 188 -23302=4,1,2,1,1
Reshape                  reshape_347              1 1 188 189 0=128 1=-1 2=16
SDPA                     sdpa_626                 6 3 181 186 189 26 cache_k1 cache_v1 190 out_cache_k1 out_cache_v1 5=1 6=0.0883883 7=1
Permute                  transpose_488            1 1 190 191 0=2
Reshape                  reshape_348              1 1 191 192 0=2048 1=-1
Gemm                     gemm_10                  1 1 192 193 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_3                    2 1 165 193 194 0=0
Split                    splitncnn_9              1 2 194 195 196
RMSNorm                  rmsn_199                 1 1 196 197 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_10             1 2 197 198 199
Gemm                     gemm_11                  1 1 199 200 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_169                 1 1 200 201
Gemm                     gemm_12                  1 1 198 202 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_4                    2 1 201 202 203 0=2
Gemm                     gemm_13                  1 1 203 204 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_5                    2 1 195 204 205 0=0
Split                    splitncnn_11             1 2 205 206 207
RMSNorm                  rmsn_200                 1 1 207 208 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_12             1 3 208 209 210 211
Gemm                     gemm_14                  1 1 211 212 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_349              1 1 212 213 0=128 1=16 2=-1
Permute                  transpose_489            1 1 213 214 0=2
Gemm                     gemm_15                  1 1 210 215 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_350              1 1 215 216 0=128 1=8 2=-1
Permute                  transpose_490            1 1 216 217 0=2
Gemm                     gemm_16                  1 1 209 218 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_351              1 1 218 219 0=128 1=8 2=-1
Permute                  transpose_491            1 1 219 220 0=2
RotaryEmbed              rope_4                   3 1 214 72 121 221 0=0
RMSNorm                  rmsn_201                 1 1 221 222 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_5                   3 1 217 71 120 223 0=0
RMSNorm                  rmsn_202                 1 1 223 224 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_581            1 1 224 225 -23303=1,1
Tile                     expand_293               1 1 225 226 -23302=4,1,2,1,1
Reshape                  reshape_352              1 1 226 227 0=128 1=-1 2=16
ExpandDims               unsqueeze_582            1 1 220 228 -23303=1,1
Tile                     expand_294               1 1 228 229 -23302=4,1,2,1,1
Reshape                  reshape_353              1 1 229 230 0=128 1=-1 2=16
SDPA                     sdpa_627                 6 3 222 227 230 25 cache_k2 cache_v2 231 out_cache_k2 out_cache_v2 5=1 6=0.0883883 7=1
Permute                  transpose_492            1 1 231 232 0=2
Reshape                  reshape_354              1 1 232 233 0=2048 1=-1
Gemm                     gemm_17                  1 1 233 234 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_6                    2 1 206 234 235 0=0
Split                    splitncnn_13             1 2 235 236 237
RMSNorm                  rmsn_203                 1 1 237 238 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_14             1 2 238 239 240
Gemm                     gemm_18                  1 1 240 241 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_170                 1 1 241 242
Gemm                     gemm_19                  1 1 239 243 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_7                    2 1 242 243 244 0=2
Gemm                     gemm_20                  1 1 244 245 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_8                    2 1 236 245 246 0=0
Split                    splitncnn_15             1 2 246 247 248
RMSNorm                  rmsn_204                 1 1 248 249 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_16             1 3 249 250 251 252
Gemm                     gemm_21                  1 1 252 253 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_355              1 1 253 254 0=128 1=16 2=-1
Permute                  transpose_493            1 1 254 255 0=2
Gemm                     gemm_22                  1 1 251 256 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_356              1 1 256 257 0=128 1=8 2=-1
Permute                  transpose_494            1 1 257 258 0=2
Gemm                     gemm_23                  1 1 250 259 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_357              1 1 259 260 0=128 1=8 2=-1
Permute                  transpose_495            1 1 260 261 0=2
RotaryEmbed              rope_6                   3 1 255 70 119 262 0=0
RMSNorm                  rmsn_205                 1 1 262 263 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_7                   3 1 258 69 118 264 0=0
RMSNorm                  rmsn_206                 1 1 264 265 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_583            1 1 265 266 -23303=1,1
Tile                     expand_295               1 1 266 267 -23302=4,1,2,1,1
Reshape                  reshape_358              1 1 267 268 0=128 1=-1 2=16
ExpandDims               unsqueeze_584            1 1 261 269 -23303=1,1
Tile                     expand_296               1 1 269 270 -23302=4,1,2,1,1
Reshape                  reshape_359              1 1 270 271 0=128 1=-1 2=16
SDPA                     sdpa_628                 6 3 263 268 271 24 cache_k3 cache_v3 272 out_cache_k3 out_cache_v3 5=1 6=0.0883883 7=1
Permute                  transpose_496            1 1 272 273 0=2
Reshape                  reshape_360              1 1 273 274 0=2048 1=-1
Gemm                     gemm_24                  1 1 274 275 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_9                    2 1 247 275 276 0=0
Split                    splitncnn_17             1 2 276 277 278
RMSNorm                  rmsn_207                 1 1 278 279 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_18             1 2 279 280 281
Gemm                     gemm_25                  1 1 281 282 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_171                 1 1 282 283
Gemm                     gemm_26                  1 1 280 284 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_10                   2 1 283 284 285 0=2
Gemm                     gemm_27                  1 1 285 286 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_11                   2 1 277 286 287 0=0
Split                    splitncnn_19             1 2 287 288 289
RMSNorm                  rmsn_208                 1 1 289 290 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_20             1 3 290 291 292 293
Gemm                     gemm_28                  1 1 293 294 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_361              1 1 294 295 0=128 1=16 2=-1
Permute                  transpose_497            1 1 295 296 0=2
Gemm                     gemm_29                  1 1 292 297 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_362              1 1 297 298 0=128 1=8 2=-1
Permute                  transpose_498            1 1 298 299 0=2
Gemm                     gemm_30                  1 1 291 300 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_363              1 1 300 301 0=128 1=8 2=-1
Permute                  transpose_499            1 1 301 302 0=2
RotaryEmbed              rope_8                   3 1 296 68 117 303 0=0
RMSNorm                  rmsn_209                 1 1 303 304 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_9                   3 1 299 67 116 305 0=0
RMSNorm                  rmsn_210                 1 1 305 306 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_585            1 1 306 307 -23303=1,1
Tile                     expand_297               1 1 307 308 -23302=4,1,2,1,1
Reshape                  reshape_364              1 1 308 309 0=128 1=-1 2=16
ExpandDims               unsqueeze_586            1 1 302 310 -23303=1,1
Tile                     expand_298               1 1 310 311 -23302=4,1,2,1,1
Reshape                  reshape_365              1 1 311 312 0=128 1=-1 2=16
SDPA                     sdpa_629                 6 3 304 309 312 23 cache_k4 cache_v4 313 out_cache_k4 out_cache_v4 5=1 6=0.0883883 7=1
Permute                  transpose_500            1 1 313 314 0=2
Reshape                  reshape_366              1 1 314 315 0=2048 1=-1
Gemm                     gemm_31                  1 1 315 316 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_12                   2 1 288 316 317 0=0
Split                    splitncnn_21             1 2 317 318 319
RMSNorm                  rmsn_211                 1 1 319 320 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_22             1 2 320 321 322
Gemm                     gemm_32                  1 1 322 323 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_172                 1 1 323 324
Gemm                     gemm_33                  1 1 321 325 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_13                   2 1 324 325 326 0=2
Gemm                     gemm_34                  1 1 326 327 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_14                   2 1 318 327 328 0=0
Split                    splitncnn_23             1 2 328 329 330
RMSNorm                  rmsn_212                 1 1 330 331 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_24             1 3 331 332 333 334
Gemm                     gemm_35                  1 1 334 335 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_367              1 1 335 336 0=128 1=16 2=-1
Permute                  transpose_501            1 1 336 337 0=2
Gemm                     gemm_36                  1 1 333 338 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_368              1 1 338 339 0=128 1=8 2=-1
Permute                  transpose_502            1 1 339 340 0=2
Gemm                     gemm_37                  1 1 332 341 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_369              1 1 341 342 0=128 1=8 2=-1
Permute                  transpose_503            1 1 342 343 0=2
RotaryEmbed              rope_10                  3 1 337 66 115 344 0=0
RMSNorm                  rmsn_213                 1 1 344 345 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_11                  3 1 340 65 114 346 0=0
RMSNorm                  rmsn_214                 1 1 346 347 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_587            1 1 347 348 -23303=1,1
Tile                     expand_299               1 1 348 349 -23302=4,1,2,1,1
Reshape                  reshape_370              1 1 349 350 0=128 1=-1 2=16
ExpandDims               unsqueeze_588            1 1 343 351 -23303=1,1
Tile                     expand_300               1 1 351 352 -23302=4,1,2,1,1
Reshape                  reshape_371              1 1 352 353 0=128 1=-1 2=16
SDPA                     sdpa_630                 6 3 345 350 353 22 cache_k5 cache_v5 354 out_cache_k5 out_cache_v5 5=1 6=0.0883883 7=1
Permute                  transpose_504            1 1 354 355 0=2
Reshape                  reshape_372              1 1 355 356 0=2048 1=-1
Gemm                     gemm_38                  1 1 356 357 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_15                   2 1 329 357 358 0=0
Split                    splitncnn_25             1 2 358 359 360
RMSNorm                  rmsn_215                 1 1 360 361 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_26             1 2 361 362 363
Gemm                     gemm_39                  1 1 363 364 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_173                 1 1 364 365
Gemm                     gemm_40                  1 1 362 366 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_16                   2 1 365 366 367 0=2
Gemm                     gemm_41                  1 1 367 368 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_17                   2 1 359 368 369 0=0
Split                    splitncnn_27             1 2 369 370 371
RMSNorm                  rmsn_216                 1 1 371 372 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_28             1 3 372 373 374 375
Gemm                     gemm_42                  1 1 375 376 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_373              1 1 376 377 0=128 1=16 2=-1
Permute                  transpose_505            1 1 377 378 0=2
Gemm                     gemm_43                  1 1 374 379 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_374              1 1 379 380 0=128 1=8 2=-1
Permute                  transpose_506            1 1 380 381 0=2
Gemm                     gemm_44                  1 1 373 382 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_375              1 1 382 383 0=128 1=8 2=-1
Permute                  transpose_507            1 1 383 384 0=2
RotaryEmbed              rope_12                  3 1 378 64 113 385 0=0
RMSNorm                  rmsn_217                 1 1 385 386 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_13                  3 1 381 63 112 387 0=0
RMSNorm                  rmsn_218                 1 1 387 388 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_589            1 1 388 389 -23303=1,1
Tile                     expand_301               1 1 389 390 -23302=4,1,2,1,1
Reshape                  reshape_376              1 1 390 391 0=128 1=-1 2=16
ExpandDims               unsqueeze_590            1 1 384 392 -23303=1,1
Tile                     expand_302               1 1 392 393 -23302=4,1,2,1,1
Reshape                  reshape_377              1 1 393 394 0=128 1=-1 2=16
SDPA                     sdpa_631                 6 3 386 391 394 21 cache_k6 cache_v6 395 out_cache_k6 out_cache_v6 5=1 6=0.0883883 7=1
Permute                  transpose_508            1 1 395 396 0=2
Reshape                  reshape_378              1 1 396 397 0=2048 1=-1
Gemm                     gemm_45                  1 1 397 398 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_18                   2 1 370 398 399 0=0
Split                    splitncnn_29             1 2 399 400 401
RMSNorm                  rmsn_219                 1 1 401 402 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_30             1 2 402 403 404
Gemm                     gemm_46                  1 1 404 405 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_174                 1 1 405 406
Gemm                     gemm_47                  1 1 403 407 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_19                   2 1 406 407 408 0=2
Gemm                     gemm_48                  1 1 408 409 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_20                   2 1 400 409 410 0=0
Split                    splitncnn_31             1 2 410 411 412
RMSNorm                  rmsn_220                 1 1 412 413 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_32             1 3 413 414 415 416
Gemm                     gemm_49                  1 1 416 417 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_379              1 1 417 418 0=128 1=16 2=-1
Permute                  transpose_509            1 1 418 419 0=2
Gemm                     gemm_50                  1 1 415 420 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_380              1 1 420 421 0=128 1=8 2=-1
Permute                  transpose_510            1 1 421 422 0=2
Gemm                     gemm_51                  1 1 414 423 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_381              1 1 423 424 0=128 1=8 2=-1
Permute                  transpose_511            1 1 424 425 0=2
RotaryEmbed              rope_14                  3 1 419 62 111 426 0=0
RMSNorm                  rmsn_221                 1 1 426 427 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_15                  3 1 422 61 110 428 0=0
RMSNorm                  rmsn_222                 1 1 428 429 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_591            1 1 429 430 -23303=1,1
Tile                     expand_303               1 1 430 431 -23302=4,1,2,1,1
Reshape                  reshape_382              1 1 431 432 0=128 1=-1 2=16
ExpandDims               unsqueeze_592            1 1 425 433 -23303=1,1
Tile                     expand_304               1 1 433 434 -23302=4,1,2,1,1
Reshape                  reshape_383              1 1 434 435 0=128 1=-1 2=16
SDPA                     sdpa_632                 6 3 427 432 435 20 cache_k7 cache_v7 436 out_cache_k7 out_cache_v7 5=1 6=0.0883883 7=1
Permute                  transpose_512            1 1 436 437 0=2
Reshape                  reshape_384              1 1 437 438 0=2048 1=-1
Gemm                     gemm_52                  1 1 438 439 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_21                   2 1 411 439 440 0=0
Split                    splitncnn_33             1 2 440 441 442
RMSNorm                  rmsn_223                 1 1 442 443 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_34             1 2 443 444 445
Gemm                     gemm_53                  1 1 445 446 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_175                 1 1 446 447
Gemm                     gemm_54                  1 1 444 448 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_22                   2 1 447 448 449 0=2
Gemm                     gemm_55                  1 1 449 450 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_23                   2 1 441 450 451 0=0
Split                    splitncnn_35             1 2 451 452 453
RMSNorm                  rmsn_224                 1 1 453 454 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_36             1 3 454 455 456 457
Gemm                     gemm_56                  1 1 457 458 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_385              1 1 458 459 0=128 1=16 2=-1
Permute                  transpose_513            1 1 459 460 0=2
Gemm                     gemm_57                  1 1 456 461 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_386              1 1 461 462 0=128 1=8 2=-1
Permute                  transpose_514            1 1 462 463 0=2
Gemm                     gemm_58                  1 1 455 464 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_387              1 1 464 465 0=128 1=8 2=-1
Permute                  transpose_515            1 1 465 466 0=2
RotaryEmbed              rope_16                  3 1 460 60 109 467 0=0
RMSNorm                  rmsn_225                 1 1 467 468 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_17                  3 1 463 59 108 469 0=0
RMSNorm                  rmsn_226                 1 1 469 470 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_593            1 1 470 471 -23303=1,1
Tile                     expand_305               1 1 471 472 -23302=4,1,2,1,1
Reshape                  reshape_388              1 1 472 473 0=128 1=-1 2=16
ExpandDims               unsqueeze_594            1 1 466 474 -23303=1,1
Tile                     expand_306               1 1 474 475 -23302=4,1,2,1,1
Reshape                  reshape_389              1 1 475 476 0=128 1=-1 2=16
SDPA                     sdpa_633                 6 3 468 473 476 19 cache_k8 cache_v8 477 out_cache_k8 out_cache_v8 5=1 6=0.0883883 7=1
Permute                  transpose_516            1 1 477 478 0=2
Reshape                  reshape_390              1 1 478 479 0=2048 1=-1
Gemm                     gemm_59                  1 1 479 480 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_24                   2 1 452 480 481 0=0
Split                    splitncnn_37             1 2 481 482 483
RMSNorm                  rmsn_227                 1 1 483 484 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_38             1 2 484 485 486
Gemm                     gemm_60                  1 1 486 487 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_176                 1 1 487 488
Gemm                     gemm_61                  1 1 485 489 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_25                   2 1 488 489 490 0=2
Gemm                     gemm_62                  1 1 490 491 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_26                   2 1 482 491 492 0=0
Split                    splitncnn_39             1 2 492 493 494
RMSNorm                  rmsn_228                 1 1 494 495 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_40             1 3 495 496 497 498
Gemm                     gemm_63                  1 1 498 499 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_391              1 1 499 500 0=128 1=16 2=-1
Permute                  transpose_517            1 1 500 501 0=2
Gemm                     gemm_64                  1 1 497 502 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_392              1 1 502 503 0=128 1=8 2=-1
Permute                  transpose_518            1 1 503 504 0=2
Gemm                     gemm_65                  1 1 496 505 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_393              1 1 505 506 0=128 1=8 2=-1
Permute                  transpose_519            1 1 506 507 0=2
RotaryEmbed              rope_18                  3 1 501 58 107 508 0=0
RMSNorm                  rmsn_229                 1 1 508 509 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_19                  3 1 504 57 106 510 0=0
RMSNorm                  rmsn_230                 1 1 510 511 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_595            1 1 511 512 -23303=1,1
Tile                     expand_307               1 1 512 513 -23302=4,1,2,1,1
Reshape                  reshape_394              1 1 513 514 0=128 1=-1 2=16
ExpandDims               unsqueeze_596            1 1 507 515 -23303=1,1
Tile                     expand_308               1 1 515 516 -23302=4,1,2,1,1
Reshape                  reshape_395              1 1 516 517 0=128 1=-1 2=16
SDPA                     sdpa_634                 6 3 509 514 517 18 cache_k9 cache_v9 518 out_cache_k9 out_cache_v9 5=1 6=0.0883883 7=1
Permute                  transpose_520            1 1 518 519 0=2
Reshape                  reshape_396              1 1 519 520 0=2048 1=-1
Gemm                     gemm_66                  1 1 520 521 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_27                   2 1 493 521 522 0=0
Split                    splitncnn_41             1 2 522 523 524
RMSNorm                  rmsn_231                 1 1 524 525 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_42             1 2 525 526 527
Gemm                     gemm_67                  1 1 527 528 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_177                 1 1 528 529
Gemm                     gemm_68                  1 1 526 530 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_28                   2 1 529 530 531 0=2
Gemm                     gemm_69                  1 1 531 532 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_29                   2 1 523 532 533 0=0
Split                    splitncnn_43             1 2 533 534 535
RMSNorm                  rmsn_232                 1 1 535 536 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_44             1 3 536 537 538 539
Gemm                     gemm_70                  1 1 539 540 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_397              1 1 540 541 0=128 1=16 2=-1
Permute                  transpose_521            1 1 541 542 0=2
Gemm                     gemm_71                  1 1 538 543 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_398              1 1 543 544 0=128 1=8 2=-1
Permute                  transpose_522            1 1 544 545 0=2
Gemm                     gemm_72                  1 1 537 546 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_399              1 1 546 547 0=128 1=8 2=-1
Permute                  transpose_523            1 1 547 548 0=2
RotaryEmbed              rope_20                  3 1 542 56 105 549 0=0
RMSNorm                  rmsn_233                 1 1 549 550 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_21                  3 1 545 55 104 551 0=0
RMSNorm                  rmsn_234                 1 1 551 552 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_597            1 1 552 553 -23303=1,1
Tile                     expand_309               1 1 553 554 -23302=4,1,2,1,1
Reshape                  reshape_400              1 1 554 555 0=128 1=-1 2=16
ExpandDims               unsqueeze_598            1 1 548 556 -23303=1,1
Tile                     expand_310               1 1 556 557 -23302=4,1,2,1,1
Reshape                  reshape_401              1 1 557 558 0=128 1=-1 2=16
SDPA                     sdpa_635                 6 3 550 555 558 17 cache_k10 cache_v10 559 out_cache_k10 out_cache_v10 5=1 6=0.0883883 7=1
Permute                  transpose_524            1 1 559 560 0=2
Reshape                  reshape_402              1 1 560 561 0=2048 1=-1
Gemm                     gemm_73                  1 1 561 562 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_30                   2 1 534 562 563 0=0
Split                    splitncnn_45             1 2 563 564 565
RMSNorm                  rmsn_235                 1 1 565 566 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_46             1 2 566 567 568
Gemm                     gemm_74                  1 1 568 569 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_178                 1 1 569 570
Gemm                     gemm_75                  1 1 567 571 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_31                   2 1 570 571 572 0=2
Gemm                     gemm_76                  1 1 572 573 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_32                   2 1 564 573 574 0=0
Split                    splitncnn_47             1 2 574 575 576
RMSNorm                  rmsn_236                 1 1 576 577 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_48             1 3 577 578 579 580
Gemm                     gemm_77                  1 1 580 581 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_403              1 1 581 582 0=128 1=16 2=-1
Permute                  transpose_525            1 1 582 583 0=2
Gemm                     gemm_78                  1 1 579 584 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_404              1 1 584 585 0=128 1=8 2=-1
Permute                  transpose_526            1 1 585 586 0=2
Gemm                     gemm_79                  1 1 578 587 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_405              1 1 587 588 0=128 1=8 2=-1
Permute                  transpose_527            1 1 588 589 0=2
RotaryEmbed              rope_22                  3 1 583 54 103 590 0=0
RMSNorm                  rmsn_237                 1 1 590 591 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_23                  3 1 586 53 102 592 0=0
RMSNorm                  rmsn_238                 1 1 592 593 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_599            1 1 593 594 -23303=1,1
Tile                     expand_311               1 1 594 595 -23302=4,1,2,1,1
Reshape                  reshape_406              1 1 595 596 0=128 1=-1 2=16
ExpandDims               unsqueeze_600            1 1 589 597 -23303=1,1
Tile                     expand_312               1 1 597 598 -23302=4,1,2,1,1
Reshape                  reshape_407              1 1 598 599 0=128 1=-1 2=16
SDPA                     sdpa_636                 6 3 591 596 599 16 cache_k11 cache_v11 600 out_cache_k11 out_cache_v11 5=1 6=0.0883883 7=1
Permute                  transpose_528            1 1 600 601 0=2
Reshape                  reshape_408              1 1 601 602 0=2048 1=-1
Gemm                     gemm_80                  1 1 602 603 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_33                   2 1 575 603 604 0=0
Split                    splitncnn_49             1 2 604 605 606
RMSNorm                  rmsn_239                 1 1 606 607 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_50             1 2 607 608 609
Gemm                     gemm_81                  1 1 609 610 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_179                 1 1 610 611
Gemm                     gemm_82                  1 1 608 612 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_34                   2 1 611 612 613 0=2
Gemm                     gemm_83                  1 1 613 614 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_35                   2 1 605 614 615 0=0
Split                    splitncnn_51             1 2 615 616 617
RMSNorm                  rmsn_240                 1 1 617 618 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_52             1 3 618 619 620 621
Gemm                     gemm_84                  1 1 621 622 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_409              1 1 622 623 0=128 1=16 2=-1
Permute                  transpose_529            1 1 623 624 0=2
Gemm                     gemm_85                  1 1 620 625 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_410              1 1 625 626 0=128 1=8 2=-1
Permute                  transpose_530            1 1 626 627 0=2
Gemm                     gemm_86                  1 1 619 628 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_411              1 1 628 629 0=128 1=8 2=-1
Permute                  transpose_531            1 1 629 630 0=2
RotaryEmbed              rope_24                  3 1 624 52 101 631 0=0
RMSNorm                  rmsn_241                 1 1 631 632 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_25                  3 1 627 51 100 633 0=0
RMSNorm                  rmsn_242                 1 1 633 634 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_601            1 1 634 635 -23303=1,1
Tile                     expand_313               1 1 635 636 -23302=4,1,2,1,1
Reshape                  reshape_412              1 1 636 637 0=128 1=-1 2=16
ExpandDims               unsqueeze_602            1 1 630 638 -23303=1,1
Tile                     expand_314               1 1 638 639 -23302=4,1,2,1,1
Reshape                  reshape_413              1 1 639 640 0=128 1=-1 2=16
SDPA                     sdpa_637                 6 3 632 637 640 15 cache_k12 cache_v12 641 out_cache_k12 out_cache_v12 5=1 6=0.0883883 7=1
Permute                  transpose_532            1 1 641 642 0=2
Reshape                  reshape_414              1 1 642 643 0=2048 1=-1
Gemm                     gemm_87                  1 1 643 644 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_36                   2 1 616 644 645 0=0
Split                    splitncnn_53             1 2 645 646 647
RMSNorm                  rmsn_243                 1 1 647 648 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_54             1 2 648 649 650
Gemm                     gemm_88                  1 1 650 651 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_180                 1 1 651 652
Gemm                     gemm_89                  1 1 649 653 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_37                   2 1 652 653 654 0=2
Gemm                     gemm_90                  1 1 654 655 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_38                   2 1 646 655 656 0=0
Split                    splitncnn_55             1 2 656 657 658
RMSNorm                  rmsn_244                 1 1 658 659 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_56             1 3 659 660 661 662
Gemm                     gemm_91                  1 1 662 663 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_415              1 1 663 664 0=128 1=16 2=-1
Permute                  transpose_533            1 1 664 665 0=2
Gemm                     gemm_92                  1 1 661 666 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_416              1 1 666 667 0=128 1=8 2=-1
Permute                  transpose_534            1 1 667 668 0=2
Gemm                     gemm_93                  1 1 660 669 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_417              1 1 669 670 0=128 1=8 2=-1
Permute                  transpose_535            1 1 670 671 0=2
RotaryEmbed              rope_26                  3 1 665 50 99 672 0=0
RMSNorm                  rmsn_245                 1 1 672 673 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_27                  3 1 668 49 98 674 0=0
RMSNorm                  rmsn_246                 1 1 674 675 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_603            1 1 675 676 -23303=1,1
Tile                     expand_315               1 1 676 677 -23302=4,1,2,1,1
Reshape                  reshape_418              1 1 677 678 0=128 1=-1 2=16
ExpandDims               unsqueeze_604            1 1 671 679 -23303=1,1
Tile                     expand_316               1 1 679 680 -23302=4,1,2,1,1
Reshape                  reshape_419              1 1 680 681 0=128 1=-1 2=16
SDPA                     sdpa_638                 6 3 673 678 681 14 cache_k13 cache_v13 682 out_cache_k13 out_cache_v13 5=1 6=0.0883883 7=1
Permute                  transpose_536            1 1 682 683 0=2
Reshape                  reshape_420              1 1 683 684 0=2048 1=-1
Gemm                     gemm_94                  1 1 684 685 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_39                   2 1 657 685 686 0=0
Split                    splitncnn_57             1 2 686 687 688
RMSNorm                  rmsn_247                 1 1 688 689 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_58             1 2 689 690 691
Gemm                     gemm_95                  1 1 691 692 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_181                 1 1 692 693
Gemm                     gemm_96                  1 1 690 694 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_40                   2 1 693 694 695 0=2
Gemm                     gemm_97                  1 1 695 696 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_41                   2 1 687 696 697 0=0
Split                    splitncnn_59             1 2 697 698 699
RMSNorm                  rmsn_248                 1 1 699 700 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_60             1 3 700 701 702 703
Gemm                     gemm_98                  1 1 703 704 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_421              1 1 704 705 0=128 1=16 2=-1
Permute                  transpose_537            1 1 705 706 0=2
Gemm                     gemm_99                  1 1 702 707 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_422              1 1 707 708 0=128 1=8 2=-1
Permute                  transpose_538            1 1 708 709 0=2
Gemm                     gemm_100                 1 1 701 710 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_423              1 1 710 711 0=128 1=8 2=-1
Permute                  transpose_539            1 1 711 712 0=2
RotaryEmbed              rope_28                  3 1 706 48 97 713 0=0
RMSNorm                  rmsn_249                 1 1 713 714 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_29                  3 1 709 47 96 715 0=0
RMSNorm                  rmsn_250                 1 1 715 716 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_605            1 1 716 717 -23303=1,1
Tile                     expand_317               1 1 717 718 -23302=4,1,2,1,1
Reshape                  reshape_424              1 1 718 719 0=128 1=-1 2=16
ExpandDims               unsqueeze_606            1 1 712 720 -23303=1,1
Tile                     expand_318               1 1 720 721 -23302=4,1,2,1,1
Reshape                  reshape_425              1 1 721 722 0=128 1=-1 2=16
SDPA                     sdpa_639                 6 3 714 719 722 13 cache_k14 cache_v14 723 out_cache_k14 out_cache_v14 5=1 6=0.0883883 7=1
Permute                  transpose_540            1 1 723 724 0=2
Reshape                  reshape_426              1 1 724 725 0=2048 1=-1
Gemm                     gemm_101                 1 1 725 726 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_42                   2 1 698 726 727 0=0
Split                    splitncnn_61             1 2 727 728 729
RMSNorm                  rmsn_251                 1 1 729 730 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_62             1 2 730 731 732
Gemm                     gemm_102                 1 1 732 733 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_182                 1 1 733 734
Gemm                     gemm_103                 1 1 731 735 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_43                   2 1 734 735 736 0=2
Gemm                     gemm_104                 1 1 736 737 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_44                   2 1 728 737 738 0=0
Split                    splitncnn_63             1 2 738 739 740
RMSNorm                  rmsn_252                 1 1 740 741 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_64             1 3 741 742 743 744
Gemm                     gemm_105                 1 1 744 745 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_427              1 1 745 746 0=128 1=16 2=-1
Permute                  transpose_541            1 1 746 747 0=2
Gemm                     gemm_106                 1 1 743 748 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_428              1 1 748 749 0=128 1=8 2=-1
Permute                  transpose_542            1 1 749 750 0=2
Gemm                     gemm_107                 1 1 742 751 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_429              1 1 751 752 0=128 1=8 2=-1
Permute                  transpose_543            1 1 752 753 0=2
RotaryEmbed              rope_30                  3 1 747 46 95 754 0=0
RMSNorm                  rmsn_253                 1 1 754 755 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_31                  3 1 750 45 94 756 0=0
RMSNorm                  rmsn_254                 1 1 756 757 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_607            1 1 757 758 -23303=1,1
Tile                     expand_319               1 1 758 759 -23302=4,1,2,1,1
Reshape                  reshape_430              1 1 759 760 0=128 1=-1 2=16
ExpandDims               unsqueeze_608            1 1 753 761 -23303=1,1
Tile                     expand_320               1 1 761 762 -23302=4,1,2,1,1
Reshape                  reshape_431              1 1 762 763 0=128 1=-1 2=16
SDPA                     sdpa_640                 6 3 755 760 763 12 cache_k15 cache_v15 764 out_cache_k15 out_cache_v15 5=1 6=0.0883883 7=1
Permute                  transpose_544            1 1 764 765 0=2
Reshape                  reshape_432              1 1 765 766 0=2048 1=-1
Gemm                     gemm_108                 1 1 766 767 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_45                   2 1 739 767 768 0=0
Split                    splitncnn_65             1 2 768 769 770
RMSNorm                  rmsn_255                 1 1 770 771 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_66             1 2 771 772 773
Gemm                     gemm_109                 1 1 773 774 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_183                 1 1 774 775
Gemm                     gemm_110                 1 1 772 776 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_46                   2 1 775 776 777 0=2
Gemm                     gemm_111                 1 1 777 778 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_47                   2 1 769 778 779 0=0
Split                    splitncnn_67             1 2 779 780 781
RMSNorm                  rmsn_256                 1 1 781 782 0=1024 1=1.000000e-05 2=1
Split                    splitncnn_68             1 3 782 783 784 785
Gemm                     gemm_112                 1 1 785 786 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_433              1 1 786 787 0=128 1=16 2=-1
Permute                  transpose_545            1 1 787 788 0=2
Gemm                     gemm_113                 1 1 784 789 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_434              1 1 789 790 0=128 1=8 2=-1
Permute                  transpose_546            1 1 790 791 0=2
Gemm                     gemm_114                 1 1 783 792 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_435              1 1 792 793 0=128 1=8 2=-1
Permute                  transpose_547            1 1 793 794 0=2
RotaryEmbed              rope_32                  3 1 788 44 93 795 0=0
RMSNorm                  rmsn_257                 1 1 795 796 0=128 1=1.000000e-05 2=1
RotaryEmbed              rope_33                  3 1 791 43 92 797 0=0
RMSNorm                  rmsn_258                 1 1 797 798 0=128 1=1.000000e-05 2=1
ExpandDims               unsqueeze_609            1 1 798 799 -23303=1,1
Tile                     expand_321               1 1 799 800 -23302=4,1,2,1,1
Reshape                  reshape_436              1 1 800 801 0=128 1=-1 2=16
