7767517
869 1181
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 6 in1 4 5 6 7 8 9
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 12 in2 11 12 13 14 15 16 17 18 19 20 21 22
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 12 in3 24 25 26 27 28 29 30 31 32 33 34 35
Input                    kv_cache                 0 12 cache_k0 cache_v0 cache_k1 cache_v1 cache_k2 cache_v2 cache_k3 cache_v3 cache_k4 cache_v4 cache_k5 cache_v5
Input                    gdr_cache                0 18 cache_gdr0 cache_gdr1 cache_gdr2 cache_gdr3 cache_gdr4 cache_gdr5 cache_gdr6 cache_gdr7 cache_gdr8 cache_gdr9 cache_gdr10 cache_gdr11 cache_gdr12 cache_gdr13 cache_gdr14 cache_gdr15 cache_gdr16 cache_gdr17
Input                    conv_cache               0 18 cache_conv0 cache_conv1 cache_conv2 cache_conv3 cache_conv4 cache_conv5 cache_conv6 cache_conv7 cache_conv8 cache_conv9 cache_conv10 cache_conv11 cache_conv12 cache_conv13 cache_conv14 cache_conv15 cache_conv16 cache_conv17
MemoryData               model_language_model_layers_22_linear_attn_data 0 1 36 0=16
MemoryData               pnnx_unique_49_data      0 1 37 0=16
MemoryData               model_language_model_layers_22_linear_attn_conv1d_data 0 1 38 0=4 1=1 2=6144
MemoryData               model_language_model_layers_21_linear_attn_data 0 1 39 0=16
MemoryData               pnnx_unique_46_data      0 1 40 0=16
MemoryData               model_language_model_layers_21_linear_attn_conv1d_data 0 1 41 0=4 1=1 2=6144
MemoryData               model_language_model_layers_20_linear_attn_data 0 1 42 0=16
MemoryData               pnnx_unique_43_data      0 1 43 0=16
MemoryData               model_language_model_layers_20_linear_attn_conv1d_data 0 1 44 0=4 1=1 2=6144
MemoryData               model_language_model_layers_18_linear_attn_data 0 1 45 0=16
MemoryData               pnnx_unique_40_data      0 1 46 0=16
MemoryData               model_language_model_layers_18_linear_attn_conv1d_data 0 1 47 0=4 1=1 2=6144
MemoryData               model_language_model_layers_17_linear_attn_data 0 1 48 0=16
MemoryData               pnnx_unique_37_data      0 1 49 0=16
MemoryData               model_language_model_layers_17_linear_attn_conv1d_data 0 1 50 0=4 1=1 2=6144
MemoryData               model_language_model_layers_16_linear_attn_data 0 1 51 0=16
MemoryData               pnnx_unique_34_data      0 1 52 0=16
MemoryData               model_language_model_layers_16_linear_attn_conv1d_data 0 1 53 0=4 1=1 2=6144
MemoryData               model_language_model_layers_14_linear_attn_data 0 1 54 0=16
MemoryData               pnnx_unique_31_data      0 1 55 0=16
MemoryData               model_language_model_layers_14_linear_attn_conv1d_data 0 1 56 0=4 1=1 2=6144
MemoryData               model_language_model_layers_13_linear_attn_data 0 1 57 0=16
MemoryData               pnnx_unique_28_data      0 1 58 0=16
MemoryData               model_language_model_layers_13_linear_attn_conv1d_data 0 1 59 0=4 1=1 2=6144
MemoryData               model_language_model_layers_12_linear_attn_data 0 1 60 0=16
MemoryData               pnnx_unique_25_data      0 1 61 0=16
MemoryData               model_language_model_layers_12_linear_attn_conv1d_data 0 1 62 0=4 1=1 2=6144
MemoryData               model_language_model_layers_10_linear_attn_data 0 1 63 0=16
MemoryData               pnnx_unique_22_data      0 1 64 0=16
MemoryData               model_language_model_layers_10_linear_attn_conv1d_data 0 1 65 0=4 1=1 2=6144
MemoryData               model_language_model_layers_9_linear_attn_data 0 1 66 0=16
MemoryData               pnnx_unique_19_data      0 1 67 0=16
MemoryData               model_language_model_layers_9_linear_attn_conv1d_data 0 1 68 0=4 1=1 2=6144
MemoryData               model_language_model_layers_8_linear_attn_data 0 1 69 0=16
MemoryData               pnnx_unique_16_data      0 1 70 0=16
MemoryData               model_language_model_layers_8_linear_attn_conv1d_data 0 1 71 0=4 1=1 2=6144
MemoryData               model_language_model_layers_6_linear_attn_data 0 1 72 0=16
MemoryData               pnnx_unique_13_data      0 1 73 0=16
MemoryData               model_language_model_layers_6_linear_attn_conv1d_data 0 1 74 0=4 1=1 2=6144
MemoryData               model_language_model_layers_5_linear_attn_data 0 1 75 0=16
MemoryData               pnnx_unique_10_data      0 1 76 0=16
MemoryData               model_language_model_layers_5_linear_attn_conv1d_data 0 1 77 0=4 1=1 2=6144
MemoryData               model_language_model_layers_4_linear_attn_data 0 1 78 0=16
MemoryData               pnnx_unique_7_data       0 1 79 0=16
MemoryData               model_language_model_layers_4_linear_attn_conv1d_data 0 1 80 0=4 1=1 2=6144
MemoryData               model_language_model_layers_2_linear_attn_data 0 1 81 0=16
MemoryData               pnnx_unique_4_data       0 1 82 0=16
MemoryData               model_language_model_layers_2_linear_attn_conv1d_data 0 1 83 0=4 1=1 2=6144
MemoryData               model_language_model_layers_1_linear_attn_data 0 1 84 0=16
MemoryData               pnnx_unique_1_data       0 1 85 0=16
MemoryData               model_language_model_layers_1_linear_attn_conv1d_data 0 1 86 0=4 1=1 2=6144
MemoryData               model_language_model_layers_0_linear_attn_data 0 1 87 0=16
MemoryData               pnnx_unique_0_data       0 1 88 0=16
MemoryData               model_language_model_layers_0_linear_attn_conv1d_data 0 1 89 0=4 1=1 2=6144
RMSNorm                  rmsn_234                 1 1 2 90 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_4              1 4 90 91 92 93 94
Gemm                     gemm_0                   1 1 94 95 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_1                   1 1 93 96 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_2                   1 1 92 97 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_3                   1 1 91 98 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                short_conv               3 2 89 95 cache_conv0 99 out_cache_conv0
Slice                    split_0                  1 3 99 100 101 102 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_325              1 1 100 103 0=128 1=16 2=-1
Reshape                  reshape_326              1 1 101 104 0=128 1=16 2=-1
Reshape                  reshape_327              1 1 102 105 0=128 1=16 2=-1
GatedDeltaRule           gated_delta_rule         8 2 88 87 97 98 103 104 105 cache_gdr0 106 out_cache_gdr0
Reshape                  reshape_328              1 1 106 107 0=128 1=-1
Reshape                  reshape_329              1 1 96 108 0=128 1=-1
RMSNorm                  rmsn_235                 1 1 107 109 0=128 1=1.000000e-06 2=1
Swish                    silu_192                 1 1 108 110
BinaryOp                 mul_0                    2 1 109 110 111 0=2
Reshape                  reshape_330              1 1 111 112 0=2048 1=-1
Gemm                     gemm_4                   1 1 112 113 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_1                    2 1 1 113 114 0=0
Split                    splitncnn_5              1 2 114 115 116
RMSNorm                  rmsn_236                 1 1 116 117 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_6              1 2 117 118 119
Gemm                     gemm_5                   1 1 119 120 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_193                 1 1 120 121
Gemm                     gemm_6                   1 1 118 122 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_2                    2 1 121 122 123 0=2
Gemm                     gemm_7                   1 1 123 124 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_3                    2 1 115 124 125 0=0
Split                    splitncnn_7              1 2 125 126 127
RMSNorm                  rmsn_237                 1 1 127 128 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_8              1 4 128 129 130 131 132
Gemm                     gemm_8                   1 1 132 133 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_9                   1 1 131 134 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_10                  1 1 130 135 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_11                  1 1 129 136 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_0            3 2 86 133 cache_conv1 137 out_cache_conv1
Slice                    split_1                  1 3 137 138 139 140 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_331              1 1 138 141 0=128 1=16 2=-1
Reshape                  reshape_332              1 1 139 142 0=128 1=16 2=-1
Reshape                  reshape_333              1 1 140 143 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_1            8 2 85 84 135 136 141 142 143 cache_gdr1 144 out_cache_gdr1
Reshape                  reshape_334              1 1 144 145 0=128 1=-1
Reshape                  reshape_335              1 1 134 146 0=128 1=-1
RMSNorm                  rmsn_238                 1 1 145 147 0=128 1=1.000000e-06 2=1
Swish                    silu_194                 1 1 146 148
BinaryOp                 mul_4                    2 1 147 148 149 0=2
Reshape                  reshape_336              1 1 149 150 0=2048 1=-1
Gemm                     gemm_12                  1 1 150 151 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_5                    2 1 126 151 152 0=0
Split                    splitncnn_9              1 2 152 153 154
RMSNorm                  rmsn_239                 1 1 154 155 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_10             1 2 155 156 157
Gemm                     gemm_13                  1 1 157 158 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_195                 1 1 158 159
Gemm                     gemm_14                  1 1 156 160 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_6                    2 1 159 160 161 0=2
Gemm                     gemm_15                  1 1 161 162 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_7                    2 1 153 162 163 0=0
Split                    splitncnn_11             1 2 163 164 165
RMSNorm                  rmsn_240                 1 1 165 166 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_12             1 4 166 167 168 169 170
Gemm                     gemm_16                  1 1 170 171 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_17                  1 1 169 172 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_18                  1 1 168 173 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_19                  1 1 167 174 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_2            3 2 83 171 cache_conv2 175 out_cache_conv2
Slice                    split_2                  1 3 175 176 177 178 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_337              1 1 176 179 0=128 1=16 2=-1
Reshape                  reshape_338              1 1 177 180 0=128 1=16 2=-1
Reshape                  reshape_339              1 1 178 181 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_3            8 2 82 81 173 174 179 180 181 cache_gdr2 182 out_cache_gdr2
Reshape                  reshape_340              1 1 182 183 0=128 1=-1
Reshape                  reshape_341              1 1 172 184 0=128 1=-1
RMSNorm                  rmsn_241                 1 1 183 185 0=128 1=1.000000e-06 2=1
Swish                    silu_196                 1 1 184 186
BinaryOp                 mul_8                    2 1 185 186 187 0=2
Reshape                  reshape_342              1 1 187 188 0=2048 1=-1
Gemm                     gemm_20                  1 1 188 189 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_9                    2 1 164 189 190 0=0
Split                    splitncnn_13             1 2 190 191 192
RMSNorm                  rmsn_242                 1 1 192 193 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_14             1 2 193 194 195
Gemm                     gemm_21                  1 1 195 196 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_197                 1 1 196 197
Gemm                     gemm_22                  1 1 194 198 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_10                   2 1 197 198 199 0=2
Gemm                     gemm_23                  1 1 199 200 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_11                   2 1 191 200 201 0=0
Split                    splitncnn_15             1 2 201 202 203
RMSNorm                  rmsn_243                 1 1 203 204 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_16             1 3 204 205 206 207
Gemm                     gemm_24                  1 1 207 208 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=1024
Reshape                  reshape_343              1 1 208 209 0=512 1=8 2=-1
Slice                    chunk_0                  1 2 209 210 211 -23300=2,-233,-233 1=2
Reshape                  reshape_344              1 1 211 212 0=2048 1=-1
RMSNorm                  rmsn_244                 1 1 210 213 0=256 1=1.000000e-06 2=1
Permute                  transpose_475            1 1 213 214 0=2
Gemm                     gemm_25                  1 1 206 215 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_345              1 1 215 216 0=256 1=2 2=-1
RMSNorm                  rmsn_245                 1 1 216 217 0=256 1=1.000000e-06 2=1
Permute                  transpose_476            1 1 217 218 0=2
Gemm                     gemm_26                  1 1 205 219 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_346              1 1 219 220 0=256 1=2 2=-1
Permute                  transpose_477            1 1 220 221 0=2
Slice                    tensor_split_0           1 2 214 222 223 -23300=2,64,-233 1=2
Slice                    tensor_split_1           1 2 218 224 225 -23300=2,64,-233 1=2
RotaryEmbed              rope_0                   3 1 222 22 35 226 0=0
RotaryEmbed              rope_1                   3 1 224 21 34 227 0=0
Concat                   cat_0                    2 1 226 223 228 0=2
Concat                   cat_1                    2 1 227 225 229 0=2
ExpandDims               unsqueeze_499            1 1 229 230 -23303=1,1
Tile                     expand_313               1 1 230 231 -23302=4,1,4,1,1
Reshape                  reshape_347              1 1 231 232 0=256 1=-1 2=8
ExpandDims               unsqueeze_500            1 1 221 233 -23303=1,1
Tile                     expand_314               1 1 233 234 -23302=4,1,4,1,1
Reshape                  reshape_348              1 1 234 235 0=256 1=-1 2=8
SDPA                     sdpa_511                 6 3 228 232 235 9 cache_k0 cache_v0 236 out_cache_k0 out_cache_v0 5=1 7=1
Permute                  transpose_478            1 1 236 237 0=2
Reshape                  reshape_349              1 1 237 238 0=2048 1=-1
Sigmoid                  sigmoid_186              1 1 212 239
BinaryOp                 mul_12                   2 1 238 239 240 0=2
Gemm                     gemm_27                  1 1 240 241 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_13                   2 1 202 241 242 0=0
Split                    splitncnn_17             1 2 242 243 244
RMSNorm                  rmsn_246                 1 1 244 245 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_18             1 2 245 246 247
Gemm                     gemm_28                  1 1 247 248 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_198                 1 1 248 249
Gemm                     gemm_29                  1 1 246 250 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_14                   2 1 249 250 251 0=2
Gemm                     gemm_30                  1 1 251 252 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_15                   2 1 243 252 253 0=0
Split                    splitncnn_19             1 2 253 254 255
RMSNorm                  rmsn_247                 1 1 255 256 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_20             1 4 256 257 258 259 260
Gemm                     gemm_31                  1 1 260 261 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_32                  1 1 259 262 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_33                  1 1 258 263 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_34                  1 1 257 264 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_4            3 2 80 261 cache_conv3 265 out_cache_conv3
Slice                    split_3                  1 3 265 266 267 268 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_350              1 1 266 269 0=128 1=16 2=-1
Reshape                  reshape_351              1 1 267 270 0=128 1=16 2=-1
Reshape                  reshape_352              1 1 268 271 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_5            8 2 79 78 263 264 269 270 271 cache_gdr3 272 out_cache_gdr3
Reshape                  reshape_353              1 1 272 273 0=128 1=-1
Reshape                  reshape_354              1 1 262 274 0=128 1=-1
RMSNorm                  rmsn_248                 1 1 273 275 0=128 1=1.000000e-06 2=1
Swish                    silu_199                 1 1 274 276
BinaryOp                 mul_16                   2 1 275 276 277 0=2
Reshape                  reshape_355              1 1 277 278 0=2048 1=-1
Gemm                     gemm_35                  1 1 278 279 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_17                   2 1 254 279 280 0=0
Split                    splitncnn_21             1 2 280 281 282
RMSNorm                  rmsn_249                 1 1 282 283 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_22             1 2 283 284 285
Gemm                     gemm_36                  1 1 285 286 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_200                 1 1 286 287
Gemm                     gemm_37                  1 1 284 288 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_18                   2 1 287 288 289 0=2
Gemm                     gemm_38                  1 1 289 290 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_19                   2 1 281 290 291 0=0
Split                    splitncnn_23             1 2 291 292 293
RMSNorm                  rmsn_250                 1 1 293 294 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_24             1 4 294 295 296 297 298
Gemm                     gemm_39                  1 1 298 299 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_40                  1 1 297 300 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_41                  1 1 296 301 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_42                  1 1 295 302 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_6            3 2 77 299 cache_conv4 303 out_cache_conv4
Slice                    split_4                  1 3 303 304 305 306 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_356              1 1 304 307 0=128 1=16 2=-1
Reshape                  reshape_357              1 1 305 308 0=128 1=16 2=-1
Reshape                  reshape_358              1 1 306 309 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_7            8 2 76 75 301 302 307 308 309 cache_gdr4 310 out_cache_gdr4
Reshape                  reshape_359              1 1 310 311 0=128 1=-1
Reshape                  reshape_360              1 1 300 312 0=128 1=-1
RMSNorm                  rmsn_251                 1 1 311 313 0=128 1=1.000000e-06 2=1
Swish                    silu_201                 1 1 312 314
BinaryOp                 mul_20                   2 1 313 314 315 0=2
Reshape                  reshape_361              1 1 315 316 0=2048 1=-1
Gemm                     gemm_43                  1 1 316 317 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_21                   2 1 292 317 318 0=0
Split                    splitncnn_25             1 2 318 319 320
RMSNorm                  rmsn_252                 1 1 320 321 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_26             1 2 321 322 323
Gemm                     gemm_44                  1 1 323 324 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_202                 1 1 324 325
Gemm                     gemm_45                  1 1 322 326 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_22                   2 1 325 326 327 0=2
Gemm                     gemm_46                  1 1 327 328 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_23                   2 1 319 328 329 0=0
Split                    splitncnn_27             1 2 329 330 331
RMSNorm                  rmsn_253                 1 1 331 332 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_28             1 4 332 333 334 335 336
Gemm                     gemm_47                  1 1 336 337 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_48                  1 1 335 338 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_49                  1 1 334 339 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_50                  1 1 333 340 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_8            3 2 74 337 cache_conv5 341 out_cache_conv5
Slice                    split_5                  1 3 341 342 343 344 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_362              1 1 342 345 0=128 1=16 2=-1
Reshape                  reshape_363              1 1 343 346 0=128 1=16 2=-1
Reshape                  reshape_364              1 1 344 347 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_9            8 2 73 72 339 340 345 346 347 cache_gdr5 348 out_cache_gdr5
Reshape                  reshape_365              1 1 348 349 0=128 1=-1
Reshape                  reshape_366              1 1 338 350 0=128 1=-1
RMSNorm                  rmsn_254                 1 1 349 351 0=128 1=1.000000e-06 2=1
Swish                    silu_203                 1 1 350 352
BinaryOp                 mul_24                   2 1 351 352 353 0=2
Reshape                  reshape_367              1 1 353 354 0=2048 1=-1
Gemm                     gemm_51                  1 1 354 355 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_25                   2 1 330 355 356 0=0
Split                    splitncnn_29             1 2 356 357 358
RMSNorm                  rmsn_255                 1 1 358 359 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_30             1 2 359 360 361
Gemm                     gemm_52                  1 1 361 362 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_204                 1 1 362 363
Gemm                     gemm_53                  1 1 360 364 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_26                   2 1 363 364 365 0=2
Gemm                     gemm_54                  1 1 365 366 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_27                   2 1 357 366 367 0=0
Split                    splitncnn_31             1 2 367 368 369
RMSNorm                  rmsn_256                 1 1 369 370 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_32             1 3 370 371 372 373
Gemm                     gemm_55                  1 1 373 374 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=1024
Reshape                  reshape_368              1 1 374 375 0=512 1=8 2=-1
Slice                    chunk_1                  1 2 375 376 377 -23300=2,-233,-233 1=2
Reshape                  reshape_369              1 1 377 378 0=2048 1=-1
RMSNorm                  rmsn_257                 1 1 376 379 0=256 1=1.000000e-06 2=1
Permute                  transpose_479            1 1 379 380 0=2
Gemm                     gemm_56                  1 1 372 381 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_370              1 1 381 382 0=256 1=2 2=-1
RMSNorm                  rmsn_258                 1 1 382 383 0=256 1=1.000000e-06 2=1
Permute                  transpose_480            1 1 383 384 0=2
Gemm                     gemm_57                  1 1 371 385 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_371              1 1 385 386 0=256 1=2 2=-1
Permute                  transpose_481            1 1 386 387 0=2
Slice                    tensor_split_2           1 2 380 388 389 -23300=2,64,-233 1=2
Slice                    tensor_split_3           1 2 384 390 391 -23300=2,64,-233 1=2
RotaryEmbed              rope_2                   3 1 388 20 33 392 0=0
RotaryEmbed              rope_3                   3 1 390 19 32 393 0=0
Concat                   cat_2                    2 1 392 389 394 0=2
Concat                   cat_3                    2 1 393 391 395 0=2
ExpandDims               unsqueeze_501            1 1 395 396 -23303=1,1
Tile                     expand_315               1 1 396 397 -23302=4,1,4,1,1
Reshape                  reshape_372              1 1 397 398 0=256 1=-1 2=8
ExpandDims               unsqueeze_502            1 1 387 399 -23303=1,1
Tile                     expand_316               1 1 399 400 -23302=4,1,4,1,1
Reshape                  reshape_373              1 1 400 401 0=256 1=-1 2=8
SDPA                     sdpa_512                 6 3 394 398 401 8 cache_k1 cache_v1 402 out_cache_k1 out_cache_v1 5=1 7=1
Permute                  transpose_482            1 1 402 403 0=2
Reshape                  reshape_374              1 1 403 404 0=2048 1=-1
Sigmoid                  sigmoid_187              1 1 378 405
BinaryOp                 mul_28                   2 1 404 405 406 0=2
Gemm                     gemm_58                  1 1 406 407 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_29                   2 1 368 407 408 0=0
Split                    splitncnn_33             1 2 408 409 410
RMSNorm                  rmsn_259                 1 1 410 411 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_34             1 2 411 412 413
Gemm                     gemm_59                  1 1 413 414 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_205                 1 1 414 415
Gemm                     gemm_60                  1 1 412 416 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_30                   2 1 415 416 417 0=2
Gemm                     gemm_61                  1 1 417 418 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_31                   2 1 409 418 419 0=0
Split                    splitncnn_35             1 2 419 420 421
RMSNorm                  rmsn_260                 1 1 421 422 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_36             1 4 422 423 424 425 426
Gemm                     gemm_62                  1 1 426 427 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_63                  1 1 425 428 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_64                  1 1 424 429 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_65                  1 1 423 430 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_10           3 2 71 427 cache_conv6 431 out_cache_conv6
Slice                    split_6                  1 3 431 432 433 434 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_375              1 1 432 435 0=128 1=16 2=-1
Reshape                  reshape_376              1 1 433 436 0=128 1=16 2=-1
Reshape                  reshape_377              1 1 434 437 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_11           8 2 70 69 429 430 435 436 437 cache_gdr6 438 out_cache_gdr6
Reshape                  reshape_378              1 1 438 439 0=128 1=-1
Reshape                  reshape_379              1 1 428 440 0=128 1=-1
RMSNorm                  rmsn_261                 1 1 439 441 0=128 1=1.000000e-06 2=1
Swish                    silu_206                 1 1 440 442
BinaryOp                 mul_32                   2 1 441 442 443 0=2
Reshape                  reshape_380              1 1 443 444 0=2048 1=-1
Gemm                     gemm_66                  1 1 444 445 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_33                   2 1 420 445 446 0=0
Split                    splitncnn_37             1 2 446 447 448
RMSNorm                  rmsn_262                 1 1 448 449 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_38             1 2 449 450 451
Gemm                     gemm_67                  1 1 451 452 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_207                 1 1 452 453
Gemm                     gemm_68                  1 1 450 454 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_34                   2 1 453 454 455 0=2
Gemm                     gemm_69                  1 1 455 456 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_35                   2 1 447 456 457 0=0
Split                    splitncnn_39             1 2 457 458 459
RMSNorm                  rmsn_263                 1 1 459 460 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_40             1 4 460 461 462 463 464
Gemm                     gemm_70                  1 1 464 465 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_71                  1 1 463 466 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_72                  1 1 462 467 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_73                  1 1 461 468 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_12           3 2 68 465 cache_conv7 469 out_cache_conv7
Slice                    split_7                  1 3 469 470 471 472 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_381              1 1 470 473 0=128 1=16 2=-1
Reshape                  reshape_382              1 1 471 474 0=128 1=16 2=-1
Reshape                  reshape_383              1 1 472 475 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_13           8 2 67 66 467 468 473 474 475 cache_gdr7 476 out_cache_gdr7
Reshape                  reshape_384              1 1 476 477 0=128 1=-1
Reshape                  reshape_385              1 1 466 478 0=128 1=-1
RMSNorm                  rmsn_264                 1 1 477 479 0=128 1=1.000000e-06 2=1
Swish                    silu_208                 1 1 478 480
BinaryOp                 mul_36                   2 1 479 480 481 0=2
Reshape                  reshape_386              1 1 481 482 0=2048 1=-1
Gemm                     gemm_74                  1 1 482 483 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_37                   2 1 458 483 484 0=0
Split                    splitncnn_41             1 2 484 485 486
RMSNorm                  rmsn_265                 1 1 486 487 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_42             1 2 487 488 489
Gemm                     gemm_75                  1 1 489 490 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_209                 1 1 490 491
Gemm                     gemm_76                  1 1 488 492 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_38                   2 1 491 492 493 0=2
Gemm                     gemm_77                  1 1 493 494 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_39                   2 1 485 494 495 0=0
Split                    splitncnn_43             1 2 495 496 497
RMSNorm                  rmsn_266                 1 1 497 498 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_44             1 4 498 499 500 501 502
Gemm                     gemm_78                  1 1 502 503 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_79                  1 1 501 504 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_80                  1 1 500 505 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_81                  1 1 499 506 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_14           3 2 65 503 cache_conv8 507 out_cache_conv8
Slice                    split_8                  1 3 507 508 509 510 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_387              1 1 508 511 0=128 1=16 2=-1
Reshape                  reshape_388              1 1 509 512 0=128 1=16 2=-1
Reshape                  reshape_389              1 1 510 513 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_15           8 2 64 63 505 506 511 512 513 cache_gdr8 514 out_cache_gdr8
Reshape                  reshape_390              1 1 514 515 0=128 1=-1
Reshape                  reshape_391              1 1 504 516 0=128 1=-1
RMSNorm                  rmsn_267                 1 1 515 517 0=128 1=1.000000e-06 2=1
Swish                    silu_210                 1 1 516 518
BinaryOp                 mul_40                   2 1 517 518 519 0=2
Reshape                  reshape_392              1 1 519 520 0=2048 1=-1
Gemm                     gemm_82                  1 1 520 521 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_41                   2 1 496 521 522 0=0
Split                    splitncnn_45             1 2 522 523 524
RMSNorm                  rmsn_268                 1 1 524 525 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_46             1 2 525 526 527
Gemm                     gemm_83                  1 1 527 528 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_211                 1 1 528 529
Gemm                     gemm_84                  1 1 526 530 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_42                   2 1 529 530 531 0=2
Gemm                     gemm_85                  1 1 531 532 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_43                   2 1 523 532 533 0=0
Split                    splitncnn_47             1 2 533 534 535
RMSNorm                  rmsn_269                 1 1 535 536 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_48             1 3 536 537 538 539
Gemm                     gemm_86                  1 1 539 540 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=1024
Reshape                  reshape_393              1 1 540 541 0=512 1=8 2=-1
Slice                    chunk_2                  1 2 541 542 543 -23300=2,-233,-233 1=2
Reshape                  reshape_394              1 1 543 544 0=2048 1=-1
RMSNorm                  rmsn_270                 1 1 542 545 0=256 1=1.000000e-06 2=1
Permute                  transpose_483            1 1 545 546 0=2
Gemm                     gemm_87                  1 1 538 547 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_395              1 1 547 548 0=256 1=2 2=-1
RMSNorm                  rmsn_271                 1 1 548 549 0=256 1=1.000000e-06 2=1
Permute                  transpose_484            1 1 549 550 0=2
Gemm                     gemm_88                  1 1 537 551 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_396              1 1 551 552 0=256 1=2 2=-1
Permute                  transpose_485            1 1 552 553 0=2
Slice                    tensor_split_4           1 2 546 554 555 -23300=2,64,-233 1=2
Slice                    tensor_split_5           1 2 550 556 557 -23300=2,64,-233 1=2
RotaryEmbed              rope_4                   3 1 554 18 31 558 0=0
RotaryEmbed              rope_5                   3 1 556 17 30 559 0=0
Concat                   cat_4                    2 1 558 555 560 0=2
Concat                   cat_5                    2 1 559 557 561 0=2
ExpandDims               unsqueeze_503            1 1 561 562 -23303=1,1
Tile                     expand_317               1 1 562 563 -23302=4,1,4,1,1
Reshape                  reshape_397              1 1 563 564 0=256 1=-1 2=8
ExpandDims               unsqueeze_504            1 1 553 565 -23303=1,1
Tile                     expand_318               1 1 565 566 -23302=4,1,4,1,1
Reshape                  reshape_398              1 1 566 567 0=256 1=-1 2=8
SDPA                     sdpa_513                 6 3 560 564 567 7 cache_k2 cache_v2 568 out_cache_k2 out_cache_v2 5=1 7=1
Permute                  transpose_486            1 1 568 569 0=2
Reshape                  reshape_399              1 1 569 570 0=2048 1=-1
Sigmoid                  sigmoid_188              1 1 544 571
BinaryOp                 mul_44                   2 1 570 571 572 0=2
Gemm                     gemm_89                  1 1 572 573 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_45                   2 1 534 573 574 0=0
Split                    splitncnn_49             1 2 574 575 576
RMSNorm                  rmsn_272                 1 1 576 577 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_50             1 2 577 578 579
Gemm                     gemm_90                  1 1 579 580 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_212                 1 1 580 581
Gemm                     gemm_91                  1 1 578 582 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_46                   2 1 581 582 583 0=2
Gemm                     gemm_92                  1 1 583 584 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_47                   2 1 575 584 585 0=0
Split                    splitncnn_51             1 2 585 586 587
RMSNorm                  rmsn_273                 1 1 587 588 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_52             1 4 588 589 590 591 592
Gemm                     gemm_93                  1 1 592 593 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_94                  1 1 591 594 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_95                  1 1 590 595 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_96                  1 1 589 596 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_16           3 2 62 593 cache_conv9 597 out_cache_conv9
Slice                    split_9                  1 3 597 598 599 600 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_400              1 1 598 601 0=128 1=16 2=-1
Reshape                  reshape_401              1 1 599 602 0=128 1=16 2=-1
Reshape                  reshape_402              1 1 600 603 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_17           8 2 61 60 595 596 601 602 603 cache_gdr9 604 out_cache_gdr9
Reshape                  reshape_403              1 1 604 605 0=128 1=-1
Reshape                  reshape_404              1 1 594 606 0=128 1=-1
RMSNorm                  rmsn_274                 1 1 605 607 0=128 1=1.000000e-06 2=1
Swish                    silu_213                 1 1 606 608
BinaryOp                 mul_48                   2 1 607 608 609 0=2
Reshape                  reshape_405              1 1 609 610 0=2048 1=-1
Gemm                     gemm_97                  1 1 610 611 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_49                   2 1 586 611 612 0=0
Split                    splitncnn_53             1 2 612 613 614
RMSNorm                  rmsn_275                 1 1 614 615 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_54             1 2 615 616 617
Gemm                     gemm_98                  1 1 617 618 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_214                 1 1 618 619
Gemm                     gemm_99                  1 1 616 620 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_50                   2 1 619 620 621 0=2
Gemm                     gemm_100                 1 1 621 622 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_51                   2 1 613 622 623 0=0
Split                    splitncnn_55             1 2 623 624 625
RMSNorm                  rmsn_276                 1 1 625 626 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_56             1 4 626 627 628 629 630
Gemm                     gemm_101                 1 1 630 631 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_102                 1 1 629 632 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_103                 1 1 628 633 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_104                 1 1 627 634 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_18           3 2 59 631 cache_conv10 635 out_cache_conv10
Slice                    split_10                 1 3 635 636 637 638 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_406              1 1 636 639 0=128 1=16 2=-1
Reshape                  reshape_407              1 1 637 640 0=128 1=16 2=-1
Reshape                  reshape_408              1 1 638 641 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_19           8 2 58 57 633 634 639 640 641 cache_gdr10 642 out_cache_gdr10
Reshape                  reshape_409              1 1 642 643 0=128 1=-1
Reshape                  reshape_410              1 1 632 644 0=128 1=-1
RMSNorm                  rmsn_277                 1 1 643 645 0=128 1=1.000000e-06 2=1
Swish                    silu_215                 1 1 644 646
BinaryOp                 mul_52                   2 1 645 646 647 0=2
Reshape                  reshape_411              1 1 647 648 0=2048 1=-1
Gemm                     gemm_105                 1 1 648 649 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_53                   2 1 624 649 650 0=0
Split                    splitncnn_57             1 2 650 651 652
RMSNorm                  rmsn_278                 1 1 652 653 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_58             1 2 653 654 655
Gemm                     gemm_106                 1 1 655 656 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_216                 1 1 656 657
Gemm                     gemm_107                 1 1 654 658 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_54                   2 1 657 658 659 0=2
Gemm                     gemm_108                 1 1 659 660 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_55                   2 1 651 660 661 0=0
Split                    splitncnn_59             1 2 661 662 663
RMSNorm                  rmsn_279                 1 1 663 664 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_60             1 4 664 665 666 667 668
Gemm                     gemm_109                 1 1 668 669 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=1024
Gemm                     gemm_110                 1 1 667 670 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Gemm                     gemm_111                 1 1 666 671 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
Gemm                     gemm_112                 1 1 665 672 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=16 9=1024
ShortConv                pnnx_unique_20           3 2 56 669 cache_conv11 673 out_cache_conv11
Slice                    split_11                 1 3 673 674 675 676 -23300=3,2048,2048,2048 1=1
Reshape                  reshape_412              1 1 674 677 0=128 1=16 2=-1
Reshape                  reshape_413              1 1 675 678 0=128 1=16 2=-1
Reshape                  reshape_414              1 1 676 679 0=128 1=16 2=-1
GatedDeltaRule           pnnx_unique_21           8 2 55 54 671 672 677 678 679 cache_gdr11 680 out_cache_gdr11
Reshape                  reshape_415              1 1 680 681 0=128 1=-1
Reshape                  reshape_416              1 1 670 682 0=128 1=-1
RMSNorm                  rmsn_280                 1 1 681 683 0=128 1=1.000000e-06 2=1
Swish                    silu_217                 1 1 682 684
BinaryOp                 mul_56                   2 1 683 684 685 0=2
Reshape                  reshape_417              1 1 685 686 0=2048 1=-1
Gemm                     gemm_113                 1 1 686 687 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_57                   2 1 662 687 688 0=0
Split                    splitncnn_61             1 2 688 689 690
RMSNorm                  rmsn_281                 1 1 690 691 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_62             1 2 691 692 693
Gemm                     gemm_114                 1 1 693 694 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_218                 1 1 694 695
Gemm                     gemm_115                 1 1 692 696 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
BinaryOp                 mul_58                   2 1 695 696 697 0=2
Gemm                     gemm_116                 1 1 697 698 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3584
BinaryOp                 add_59                   2 1 689 698 699 0=0
Split                    splitncnn_63             1 2 699 700 701
RMSNorm                  rmsn_282                 1 1 701 702 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_64             1 3 702 703 704 705
Gemm                     gemm_117                 1 1 705 706 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=1024
Reshape                  reshape_418              1 1 706 707 0=512 1=8 2=-1
Slice                    chunk_3                  1 2 707 708 709 -23300=2,-233,-233 1=2
Reshape                  reshape_419              1 1 709 710 0=2048 1=-1
RMSNorm                  rmsn_283                 1 1 708 711 0=256 1=1.000000e-06 2=1
Permute                  transpose_487            1 1 711 712 0=2
Gemm                     gemm_118                 1 1 704 713 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_420              1 1 713 714 0=256 1=2 2=-1
RMSNorm                  rmsn_284                 1 1 714 715 0=256 1=1.000000e-06 2=1
Permute                  transpose_488            1 1 715 716 0=2
Gemm                     gemm_119                 1 1 703 717 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=512 9=1024
Reshape                  reshape_421              1 1 717 718 0=256 1=2 2=-1
Permute                  transpose_489            1 1 718 719 0=2
Slice                    tensor_split_6           1 2 712 720 721 -23300=2,64,-233 1=2
Slice                    tensor_split_7           1 2 716 722 723 -23300=2,64,-233 1=2
RotaryEmbed              rope_6                   3 1 720 16 29 724 0=0
RotaryEmbed              rope_7                   3 1 722 15 28 725 0=0
Concat                   cat_6                    2 1 724 721 726 0=2
Concat                   cat_7                    2 1 725 723 727 0=2
ExpandDims               unsqueeze_505            1 1 727 728 -23303=1,1
Tile                     expand_319               1 1 728 729 -23302=4,1,4,1,1
Reshape                  reshape_422              1 1 729 730 0=256 1=-1 2=8
ExpandDims               unsqueeze_506            1 1 719 731 -23303=1,1
Tile                     expand_320               1 1 731 732 -23302=4,1,4,1,1
Reshape                  reshape_423              1 1 732 733 0=256 1=-1 2=8
SDPA                     sdpa_514                 6 3 726 730 733 6 cache_k3 cache_v3 734 out_cache_k3 out_cache_v3 5=1 7=1
Permute                  transpose_490            1 1 734 735 0=2
Reshape                  reshape_424              1 1 735 736 0=2048 1=-1
Sigmoid                  sigmoid_189              1 1 710 737
BinaryOp                 mul_60                   2 1 736 737 738 0=2
Gemm                     gemm_120                 1 1 738 739 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_61                   2 1 700 739 740 0=0
Split                    splitncnn_65             1 2 740 741 742
RMSNorm                  rmsn_285                 1 1 742 743 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_66             1 2 743 744 745
Gemm                     gemm_121                 1 1 745 746 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3584 9=1024
Swish                    silu_219                 1 1 746 747
