7767517
1017 1405
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 28 in1 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 56 in2 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 56 in3 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145
Input                    kv_cache                 0 56 cache_k0 cache_v0 cache_k1 cache_v1 cache_k2 cache_v2 cache_k3 cache_v3 cache_k4 cache_v4 cache_k5 cache_v5 cache_k6 cache_v6 cache_k7 cache_v7 cache_k8 cache_v8 cache_k9 cache_v9 cache_k10 cache_v10 cache_k11 cache_v11 cache_k12 cache_v12 cache_k13 cache_v13 cache_k14 cache_v14 cache_k15 cache_v15 cache_k16 cache_v16 cache_k17 cache_v17 cache_k18 cache_v18 cache_k19 cache_v19 cache_k20 cache_v20 cache_k21 cache_v21 cache_k22 cache_v22 cache_k23 cache_v23 cache_k24 cache_v24 cache_k25 cache_v25 cache_k26 cache_v26 cache_k27 cache_v27
RMSNorm                  rmsn_196                 1 1 2 146 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_4              1 3 146 147 148 149
Gemm                     gemm_0                   1 1 149 150 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_393              1 1 150 151 0=128 1=16 2=-1
RMSNorm                  rmsn_197                 1 1 151 152 0=128 1=1.000000e-06 2=1
Permute                  transpose_561            1 1 152 153 0=2
Gemm                     gemm_1                   1 1 148 154 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_394              1 1 154 155 0=128 1=8 2=-1
RMSNorm                  rmsn_198                 1 1 155 156 0=128 1=1.000000e-06 2=1
Permute                  transpose_562            1 1 156 157 0=2
Gemm                     gemm_2                   1 1 147 158 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_395              1 1 158 159 0=128 1=8 2=-1
Permute                  transpose_563            1 1 159 160 0=2
RotaryEmbed              rope_0                   3 1 153 88 145 161 0=0
RotaryEmbed              rope_1                   3 1 157 87 144 162 0=0
ExpandDims               unsqueeze_673            1 1 162 163 -23303=1,1
Tile                     expand_337               1 1 163 164 -23302=4,1,2,1,1
Reshape                  reshape_396              1 1 164 165 0=128 1=-1 2=16
ExpandDims               unsqueeze_674            1 1 160 166 -23303=1,1
Tile                     expand_338               1 1 166 167 -23302=4,1,2,1,1
Reshape                  reshape_397              1 1 167 168 0=128 1=-1 2=16
SDPA                     sdpa_729                 6 3 161 165 168 31 cache_k0 cache_v0 169 out_cache_k0 out_cache_v0 5=1 6=0.0883883 7=1
Permute                  transpose_564            1 1 169 170 0=2
Reshape                  reshape_398              1 1 170 171 0=2048 1=-1
Gemm                     gemm_3                   1 1 171 172 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_0                    2 1 1 172 173 0=0
Split                    splitncnn_5              1 2 173 174 175
RMSNorm                  rmsn_199                 1 1 175 176 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_6              1 2 176 177 178
Gemm                     gemm_4                   1 1 178 179 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_309                 1 1 179 180
Gemm                     gemm_5                   1 1 177 181 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_1                    2 1 180 181 182 0=2
Gemm                     gemm_6                   1 1 182 183 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_2                    2 1 174 183 184 0=0
Split                    splitncnn_7              1 2 184 185 186
RMSNorm                  rmsn_200                 1 1 186 187 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_8              1 3 187 188 189 190
Gemm                     gemm_7                   1 1 190 191 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_399              1 1 191 192 0=128 1=16 2=-1
RMSNorm                  rmsn_201                 1 1 192 193 0=128 1=1.000000e-06 2=1
Permute                  transpose_565            1 1 193 194 0=2
Gemm                     gemm_8                   1 1 189 195 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_400              1 1 195 196 0=128 1=8 2=-1
RMSNorm                  rmsn_202                 1 1 196 197 0=128 1=1.000000e-06 2=1
Permute                  transpose_566            1 1 197 198 0=2
Gemm                     gemm_9                   1 1 188 199 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_401              1 1 199 200 0=128 1=8 2=-1
Permute                  transpose_567            1 1 200 201 0=2
RotaryEmbed              rope_2                   3 1 194 86 143 202 0=0
RotaryEmbed              rope_3                   3 1 198 85 142 203 0=0
ExpandDims               unsqueeze_675            1 1 203 204 -23303=1,1
Tile                     expand_339               1 1 204 205 -23302=4,1,2,1,1
Reshape                  reshape_402              1 1 205 206 0=128 1=-1 2=16
ExpandDims               unsqueeze_676            1 1 201 207 -23303=1,1
Tile                     expand_340               1 1 207 208 -23302=4,1,2,1,1
Reshape                  reshape_403              1 1 208 209 0=128 1=-1 2=16
SDPA                     sdpa_730                 6 3 202 206 209 30 cache_k1 cache_v1 210 out_cache_k1 out_cache_v1 5=1 6=0.0883883 7=1
Permute                  transpose_568            1 1 210 211 0=2
Reshape                  reshape_404              1 1 211 212 0=2048 1=-1
Gemm                     gemm_10                  1 1 212 213 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_3                    2 1 185 213 214 0=0
Split                    splitncnn_9              1 2 214 215 216
RMSNorm                  rmsn_203                 1 1 216 217 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_10             1 2 217 218 219
Gemm                     gemm_11                  1 1 219 220 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_310                 1 1 220 221
Gemm                     gemm_12                  1 1 218 222 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_4                    2 1 221 222 223 0=2
Gemm                     gemm_13                  1 1 223 224 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_5                    2 1 215 224 225 0=0
Split                    splitncnn_11             1 2 225 226 227
RMSNorm                  rmsn_204                 1 1 227 228 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_12             1 3 228 229 230 231
Gemm                     gemm_14                  1 1 231 232 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_405              1 1 232 233 0=128 1=16 2=-1
RMSNorm                  rmsn_205                 1 1 233 234 0=128 1=1.000000e-06 2=1
Permute                  transpose_569            1 1 234 235 0=2
Gemm                     gemm_15                  1 1 230 236 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_406              1 1 236 237 0=128 1=8 2=-1
RMSNorm                  rmsn_206                 1 1 237 238 0=128 1=1.000000e-06 2=1
Permute                  transpose_570            1 1 238 239 0=2
Gemm                     gemm_16                  1 1 229 240 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_407              1 1 240 241 0=128 1=8 2=-1
Permute                  transpose_571            1 1 241 242 0=2
RotaryEmbed              rope_4                   3 1 235 84 141 243 0=0
RotaryEmbed              rope_5                   3 1 239 83 140 244 0=0
ExpandDims               unsqueeze_677            1 1 244 245 -23303=1,1
Tile                     expand_341               1 1 245 246 -23302=4,1,2,1,1
Reshape                  reshape_408              1 1 246 247 0=128 1=-1 2=16
ExpandDims               unsqueeze_678            1 1 242 248 -23303=1,1
Tile                     expand_342               1 1 248 249 -23302=4,1,2,1,1
Reshape                  reshape_409              1 1 249 250 0=128 1=-1 2=16
SDPA                     sdpa_731                 6 3 243 247 250 29 cache_k2 cache_v2 251 out_cache_k2 out_cache_v2 5=1 6=0.0883883 7=1
Permute                  transpose_572            1 1 251 252 0=2
Reshape                  reshape_410              1 1 252 253 0=2048 1=-1
Gemm                     gemm_17                  1 1 253 254 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_6                    2 1 226 254 255 0=0
Split                    splitncnn_13             1 2 255 256 257
RMSNorm                  rmsn_207                 1 1 257 258 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_14             1 2 258 259 260
Gemm                     gemm_18                  1 1 260 261 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_311                 1 1 261 262
Gemm                     gemm_19                  1 1 259 263 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_7                    2 1 262 263 264 0=2
Gemm                     gemm_20                  1 1 264 265 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_8                    2 1 256 265 266 0=0
Split                    splitncnn_15             1 2 266 267 268
RMSNorm                  rmsn_208                 1 1 268 269 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_16             1 3 269 270 271 272
Gemm                     gemm_21                  1 1 272 273 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_411              1 1 273 274 0=128 1=16 2=-1
RMSNorm                  rmsn_209                 1 1 274 275 0=128 1=1.000000e-06 2=1
Permute                  transpose_573            1 1 275 276 0=2
Gemm                     gemm_22                  1 1 271 277 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_412              1 1 277 278 0=128 1=8 2=-1
RMSNorm                  rmsn_210                 1 1 278 279 0=128 1=1.000000e-06 2=1
Permute                  transpose_574            1 1 279 280 0=2
Gemm                     gemm_23                  1 1 270 281 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_413              1 1 281 282 0=128 1=8 2=-1
Permute                  transpose_575            1 1 282 283 0=2
RotaryEmbed              rope_6                   3 1 276 82 139 284 0=0
RotaryEmbed              rope_7                   3 1 280 81 138 285 0=0
ExpandDims               unsqueeze_679            1 1 285 286 -23303=1,1
Tile                     expand_343               1 1 286 287 -23302=4,1,2,1,1
Reshape                  reshape_414              1 1 287 288 0=128 1=-1 2=16
ExpandDims               unsqueeze_680            1 1 283 289 -23303=1,1
Tile                     expand_344               1 1 289 290 -23302=4,1,2,1,1
Reshape                  reshape_415              1 1 290 291 0=128 1=-1 2=16
SDPA                     sdpa_732                 6 3 284 288 291 28 cache_k3 cache_v3 292 out_cache_k3 out_cache_v3 5=1 6=0.0883883 7=1
Permute                  transpose_576            1 1 292 293 0=2
Reshape                  reshape_416              1 1 293 294 0=2048 1=-1
Gemm                     gemm_24                  1 1 294 295 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_9                    2 1 267 295 296 0=0
Split                    splitncnn_17             1 2 296 297 298
RMSNorm                  rmsn_211                 1 1 298 299 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_18             1 2 299 300 301
Gemm                     gemm_25                  1 1 301 302 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_312                 1 1 302 303
Gemm                     gemm_26                  1 1 300 304 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_10                   2 1 303 304 305 0=2
Gemm                     gemm_27                  1 1 305 306 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_11                   2 1 297 306 307 0=0
Split                    splitncnn_19             1 2 307 308 309
RMSNorm                  rmsn_212                 1 1 309 310 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_20             1 3 310 311 312 313
Gemm                     gemm_28                  1 1 313 314 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_417              1 1 314 315 0=128 1=16 2=-1
RMSNorm                  rmsn_213                 1 1 315 316 0=128 1=1.000000e-06 2=1
Permute                  transpose_577            1 1 316 317 0=2
Gemm                     gemm_29                  1 1 312 318 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_418              1 1 318 319 0=128 1=8 2=-1
RMSNorm                  rmsn_214                 1 1 319 320 0=128 1=1.000000e-06 2=1
Permute                  transpose_578            1 1 320 321 0=2
Gemm                     gemm_30                  1 1 311 322 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_419              1 1 322 323 0=128 1=8 2=-1
Permute                  transpose_579            1 1 323 324 0=2
RotaryEmbed              rope_8                   3 1 317 80 137 325 0=0
RotaryEmbed              rope_9                   3 1 321 79 136 326 0=0
ExpandDims               unsqueeze_681            1 1 326 327 -23303=1,1
Tile                     expand_345               1 1 327 328 -23302=4,1,2,1,1
Reshape                  reshape_420              1 1 328 329 0=128 1=-1 2=16
ExpandDims               unsqueeze_682            1 1 324 330 -23303=1,1
Tile                     expand_346               1 1 330 331 -23302=4,1,2,1,1
Reshape                  reshape_421              1 1 331 332 0=128 1=-1 2=16
SDPA                     sdpa_733                 6 3 325 329 332 27 cache_k4 cache_v4 333 out_cache_k4 out_cache_v4 5=1 6=0.0883883 7=1
Permute                  transpose_580            1 1 333 334 0=2
Reshape                  reshape_422              1 1 334 335 0=2048 1=-1
Gemm                     gemm_31                  1 1 335 336 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_12                   2 1 308 336 337 0=0
Split                    splitncnn_21             1 2 337 338 339
RMSNorm                  rmsn_215                 1 1 339 340 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_22             1 2 340 341 342
Gemm                     gemm_32                  1 1 342 343 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_313                 1 1 343 344
Gemm                     gemm_33                  1 1 341 345 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_13                   2 1 344 345 346 0=2
Gemm                     gemm_34                  1 1 346 347 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_14                   2 1 338 347 348 0=0
Split                    splitncnn_23             1 2 348 349 350
RMSNorm                  rmsn_216                 1 1 350 351 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_24             1 3 351 352 353 354
Gemm                     gemm_35                  1 1 354 355 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_423              1 1 355 356 0=128 1=16 2=-1
RMSNorm                  rmsn_217                 1 1 356 357 0=128 1=1.000000e-06 2=1
Permute                  transpose_581            1 1 357 358 0=2
Gemm                     gemm_36                  1 1 353 359 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_424              1 1 359 360 0=128 1=8 2=-1
RMSNorm                  rmsn_218                 1 1 360 361 0=128 1=1.000000e-06 2=1
Permute                  transpose_582            1 1 361 362 0=2
Gemm                     gemm_37                  1 1 352 363 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_425              1 1 363 364 0=128 1=8 2=-1
Permute                  transpose_583            1 1 364 365 0=2
RotaryEmbed              rope_10                  3 1 358 78 135 366 0=0
RotaryEmbed              rope_11                  3 1 362 77 134 367 0=0
ExpandDims               unsqueeze_683            1 1 367 368 -23303=1,1
Tile                     expand_347               1 1 368 369 -23302=4,1,2,1,1
Reshape                  reshape_426              1 1 369 370 0=128 1=-1 2=16
ExpandDims               unsqueeze_684            1 1 365 371 -23303=1,1
Tile                     expand_348               1 1 371 372 -23302=4,1,2,1,1
Reshape                  reshape_427              1 1 372 373 0=128 1=-1 2=16
SDPA                     sdpa_734                 6 3 366 370 373 26 cache_k5 cache_v5 374 out_cache_k5 out_cache_v5 5=1 6=0.0883883 7=1
Permute                  transpose_584            1 1 374 375 0=2
Reshape                  reshape_428              1 1 375 376 0=2048 1=-1
Gemm                     gemm_38                  1 1 376 377 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_15                   2 1 349 377 378 0=0
Split                    splitncnn_25             1 2 378 379 380
RMSNorm                  rmsn_219                 1 1 380 381 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_26             1 2 381 382 383
Gemm                     gemm_39                  1 1 383 384 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_314                 1 1 384 385
Gemm                     gemm_40                  1 1 382 386 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_16                   2 1 385 386 387 0=2
Gemm                     gemm_41                  1 1 387 388 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_17                   2 1 379 388 389 0=0
Split                    splitncnn_27             1 2 389 390 391
RMSNorm                  rmsn_220                 1 1 391 392 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_28             1 3 392 393 394 395
Gemm                     gemm_42                  1 1 395 396 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_429              1 1 396 397 0=128 1=16 2=-1
RMSNorm                  rmsn_221                 1 1 397 398 0=128 1=1.000000e-06 2=1
Permute                  transpose_585            1 1 398 399 0=2
Gemm                     gemm_43                  1 1 394 400 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_430              1 1 400 401 0=128 1=8 2=-1
RMSNorm                  rmsn_222                 1 1 401 402 0=128 1=1.000000e-06 2=1
Permute                  transpose_586            1 1 402 403 0=2
Gemm                     gemm_44                  1 1 393 404 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_431              1 1 404 405 0=128 1=8 2=-1
Permute                  transpose_587            1 1 405 406 0=2
RotaryEmbed              rope_12                  3 1 399 76 133 407 0=0
RotaryEmbed              rope_13                  3 1 403 75 132 408 0=0
ExpandDims               unsqueeze_685            1 1 408 409 -23303=1,1
Tile                     expand_349               1 1 409 410 -23302=4,1,2,1,1
Reshape                  reshape_432              1 1 410 411 0=128 1=-1 2=16
ExpandDims               unsqueeze_686            1 1 406 412 -23303=1,1
Tile                     expand_350               1 1 412 413 -23302=4,1,2,1,1
Reshape                  reshape_433              1 1 413 414 0=128 1=-1 2=16
SDPA                     sdpa_735                 6 3 407 411 414 25 cache_k6 cache_v6 415 out_cache_k6 out_cache_v6 5=1 6=0.0883883 7=1
Permute                  transpose_588            1 1 415 416 0=2
Reshape                  reshape_434              1 1 416 417 0=2048 1=-1
Gemm                     gemm_45                  1 1 417 418 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_18                   2 1 390 418 419 0=0
Split                    splitncnn_29             1 2 419 420 421
RMSNorm                  rmsn_223                 1 1 421 422 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_30             1 2 422 423 424
Gemm                     gemm_46                  1 1 424 425 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_315                 1 1 425 426
Gemm                     gemm_47                  1 1 423 427 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_19                   2 1 426 427 428 0=2
Gemm                     gemm_48                  1 1 428 429 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_20                   2 1 420 429 430 0=0
Split                    splitncnn_31             1 2 430 431 432
RMSNorm                  rmsn_224                 1 1 432 433 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_32             1 3 433 434 435 436
Gemm                     gemm_49                  1 1 436 437 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_435              1 1 437 438 0=128 1=16 2=-1
RMSNorm                  rmsn_225                 1 1 438 439 0=128 1=1.000000e-06 2=1
Permute                  transpose_589            1 1 439 440 0=2
Gemm                     gemm_50                  1 1 435 441 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_436              1 1 441 442 0=128 1=8 2=-1
RMSNorm                  rmsn_226                 1 1 442 443 0=128 1=1.000000e-06 2=1
Permute                  transpose_590            1 1 443 444 0=2
Gemm                     gemm_51                  1 1 434 445 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_437              1 1 445 446 0=128 1=8 2=-1
Permute                  transpose_591            1 1 446 447 0=2
RotaryEmbed              rope_14                  3 1 440 74 131 448 0=0
RotaryEmbed              rope_15                  3 1 444 73 130 449 0=0
ExpandDims               unsqueeze_687            1 1 449 450 -23303=1,1
Tile                     expand_351               1 1 450 451 -23302=4,1,2,1,1
Reshape                  reshape_438              1 1 451 452 0=128 1=-1 2=16
ExpandDims               unsqueeze_688            1 1 447 453 -23303=1,1
Tile                     expand_352               1 1 453 454 -23302=4,1,2,1,1
Reshape                  reshape_439              1 1 454 455 0=128 1=-1 2=16
SDPA                     sdpa_736                 6 3 448 452 455 24 cache_k7 cache_v7 456 out_cache_k7 out_cache_v7 5=1 6=0.0883883 7=1
Permute                  transpose_592            1 1 456 457 0=2
Reshape                  reshape_440              1 1 457 458 0=2048 1=-1
Gemm                     gemm_52                  1 1 458 459 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_21                   2 1 431 459 460 0=0
Split                    splitncnn_33             1 2 460 461 462
RMSNorm                  rmsn_227                 1 1 462 463 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_34             1 2 463 464 465
Gemm                     gemm_53                  1 1 465 466 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_316                 1 1 466 467
Gemm                     gemm_54                  1 1 464 468 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_22                   2 1 467 468 469 0=2
Gemm                     gemm_55                  1 1 469 470 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_23                   2 1 461 470 471 0=0
Split                    splitncnn_35             1 2 471 472 473
RMSNorm                  rmsn_228                 1 1 473 474 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_36             1 3 474 475 476 477
Gemm                     gemm_56                  1 1 477 478 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_441              1 1 478 479 0=128 1=16 2=-1
RMSNorm                  rmsn_229                 1 1 479 480 0=128 1=1.000000e-06 2=1
Permute                  transpose_593            1 1 480 481 0=2
Gemm                     gemm_57                  1 1 476 482 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_442              1 1 482 483 0=128 1=8 2=-1
RMSNorm                  rmsn_230                 1 1 483 484 0=128 1=1.000000e-06 2=1
Permute                  transpose_594            1 1 484 485 0=2
Gemm                     gemm_58                  1 1 475 486 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_443              1 1 486 487 0=128 1=8 2=-1
Permute                  transpose_595            1 1 487 488 0=2
RotaryEmbed              rope_16                  3 1 481 72 129 489 0=0
RotaryEmbed              rope_17                  3 1 485 71 128 490 0=0
ExpandDims               unsqueeze_689            1 1 490 491 -23303=1,1
Tile                     expand_353               1 1 491 492 -23302=4,1,2,1,1
Reshape                  reshape_444              1 1 492 493 0=128 1=-1 2=16
ExpandDims               unsqueeze_690            1 1 488 494 -23303=1,1
Tile                     expand_354               1 1 494 495 -23302=4,1,2,1,1
Reshape                  reshape_445              1 1 495 496 0=128 1=-1 2=16
SDPA                     sdpa_737                 6 3 489 493 496 23 cache_k8 cache_v8 497 out_cache_k8 out_cache_v8 5=1 6=0.0883883 7=1
Permute                  transpose_596            1 1 497 498 0=2
Reshape                  reshape_446              1 1 498 499 0=2048 1=-1
Gemm                     gemm_59                  1 1 499 500 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_24                   2 1 472 500 501 0=0
Split                    splitncnn_37             1 2 501 502 503
RMSNorm                  rmsn_231                 1 1 503 504 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_38             1 2 504 505 506
Gemm                     gemm_60                  1 1 506 507 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_317                 1 1 507 508
Gemm                     gemm_61                  1 1 505 509 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_25                   2 1 508 509 510 0=2
Gemm                     gemm_62                  1 1 510 511 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_26                   2 1 502 511 512 0=0
Split                    splitncnn_39             1 2 512 513 514
RMSNorm                  rmsn_232                 1 1 514 515 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_40             1 3 515 516 517 518
Gemm                     gemm_63                  1 1 518 519 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_447              1 1 519 520 0=128 1=16 2=-1
RMSNorm                  rmsn_233                 1 1 520 521 0=128 1=1.000000e-06 2=1
Permute                  transpose_597            1 1 521 522 0=2
Gemm                     gemm_64                  1 1 517 523 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_448              1 1 523 524 0=128 1=8 2=-1
RMSNorm                  rmsn_234                 1 1 524 525 0=128 1=1.000000e-06 2=1
Permute                  transpose_598            1 1 525 526 0=2
Gemm                     gemm_65                  1 1 516 527 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_449              1 1 527 528 0=128 1=8 2=-1
Permute                  transpose_599            1 1 528 529 0=2
RotaryEmbed              rope_18                  3 1 522 70 127 530 0=0
RotaryEmbed              rope_19                  3 1 526 69 126 531 0=0
ExpandDims               unsqueeze_691            1 1 531 532 -23303=1,1
Tile                     expand_355               1 1 532 533 -23302=4,1,2,1,1
Reshape                  reshape_450              1 1 533 534 0=128 1=-1 2=16
ExpandDims               unsqueeze_692            1 1 529 535 -23303=1,1
Tile                     expand_356               1 1 535 536 -23302=4,1,2,1,1
Reshape                  reshape_451              1 1 536 537 0=128 1=-1 2=16
SDPA                     sdpa_738                 6 3 530 534 537 22 cache_k9 cache_v9 538 out_cache_k9 out_cache_v9 5=1 6=0.0883883 7=1
Permute                  transpose_600            1 1 538 539 0=2
Reshape                  reshape_452              1 1 539 540 0=2048 1=-1
Gemm                     gemm_66                  1 1 540 541 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_27                   2 1 513 541 542 0=0
Split                    splitncnn_41             1 2 542 543 544
RMSNorm                  rmsn_235                 1 1 544 545 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_42             1 2 545 546 547
Gemm                     gemm_67                  1 1 547 548 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_318                 1 1 548 549
Gemm                     gemm_68                  1 1 546 550 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_28                   2 1 549 550 551 0=2
Gemm                     gemm_69                  1 1 551 552 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_29                   2 1 543 552 553 0=0
Split                    splitncnn_43             1 2 553 554 555
RMSNorm                  rmsn_236                 1 1 555 556 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_44             1 3 556 557 558 559
Gemm                     gemm_70                  1 1 559 560 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_453              1 1 560 561 0=128 1=16 2=-1
RMSNorm                  rmsn_237                 1 1 561 562 0=128 1=1.000000e-06 2=1
Permute                  transpose_601            1 1 562 563 0=2
Gemm                     gemm_71                  1 1 558 564 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_454              1 1 564 565 0=128 1=8 2=-1
RMSNorm                  rmsn_238                 1 1 565 566 0=128 1=1.000000e-06 2=1
Permute                  transpose_602            1 1 566 567 0=2
Gemm                     gemm_72                  1 1 557 568 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_455              1 1 568 569 0=128 1=8 2=-1
Permute                  transpose_603            1 1 569 570 0=2
RotaryEmbed              rope_20                  3 1 563 68 125 571 0=0
RotaryEmbed              rope_21                  3 1 567 67 124 572 0=0
ExpandDims               unsqueeze_693            1 1 572 573 -23303=1,1
Tile                     expand_357               1 1 573 574 -23302=4,1,2,1,1
Reshape                  reshape_456              1 1 574 575 0=128 1=-1 2=16
ExpandDims               unsqueeze_694            1 1 570 576 -23303=1,1
Tile                     expand_358               1 1 576 577 -23302=4,1,2,1,1
Reshape                  reshape_457              1 1 577 578 0=128 1=-1 2=16
SDPA                     sdpa_739                 6 3 571 575 578 21 cache_k10 cache_v10 579 out_cache_k10 out_cache_v10 5=1 6=0.0883883 7=1
Permute                  transpose_604            1 1 579 580 0=2
Reshape                  reshape_458              1 1 580 581 0=2048 1=-1
Gemm                     gemm_73                  1 1 581 582 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_30                   2 1 554 582 583 0=0
Split                    splitncnn_45             1 2 583 584 585
RMSNorm                  rmsn_239                 1 1 585 586 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_46             1 2 586 587 588
Gemm                     gemm_74                  1 1 588 589 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_319                 1 1 589 590
Gemm                     gemm_75                  1 1 587 591 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_31                   2 1 590 591 592 0=2
Gemm                     gemm_76                  1 1 592 593 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_32                   2 1 584 593 594 0=0
Split                    splitncnn_47             1 2 594 595 596
RMSNorm                  rmsn_240                 1 1 596 597 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_48             1 3 597 598 599 600
Gemm                     gemm_77                  1 1 600 601 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_459              1 1 601 602 0=128 1=16 2=-1
RMSNorm                  rmsn_241                 1 1 602 603 0=128 1=1.000000e-06 2=1
Permute                  transpose_605            1 1 603 604 0=2
Gemm                     gemm_78                  1 1 599 605 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_460              1 1 605 606 0=128 1=8 2=-1
RMSNorm                  rmsn_242                 1 1 606 607 0=128 1=1.000000e-06 2=1
Permute                  transpose_606            1 1 607 608 0=2
Gemm                     gemm_79                  1 1 598 609 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_461              1 1 609 610 0=128 1=8 2=-1
Permute                  transpose_607            1 1 610 611 0=2
RotaryEmbed              rope_22                  3 1 604 66 123 612 0=0
RotaryEmbed              rope_23                  3 1 608 65 122 613 0=0
ExpandDims               unsqueeze_695            1 1 613 614 -23303=1,1
Tile                     expand_359               1 1 614 615 -23302=4,1,2,1,1
Reshape                  reshape_462              1 1 615 616 0=128 1=-1 2=16
ExpandDims               unsqueeze_696            1 1 611 617 -23303=1,1
Tile                     expand_360               1 1 617 618 -23302=4,1,2,1,1
Reshape                  reshape_463              1 1 618 619 0=128 1=-1 2=16
SDPA                     sdpa_740                 6 3 612 616 619 20 cache_k11 cache_v11 620 out_cache_k11 out_cache_v11 5=1 6=0.0883883 7=1
Permute                  transpose_608            1 1 620 621 0=2
Reshape                  reshape_464              1 1 621 622 0=2048 1=-1
Gemm                     gemm_80                  1 1 622 623 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_33                   2 1 595 623 624 0=0
Split                    splitncnn_49             1 2 624 625 626
RMSNorm                  rmsn_243                 1 1 626 627 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_50             1 2 627 628 629
Gemm                     gemm_81                  1 1 629 630 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_320                 1 1 630 631
Gemm                     gemm_82                  1 1 628 632 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_34                   2 1 631 632 633 0=2
Gemm                     gemm_83                  1 1 633 634 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_35                   2 1 625 634 635 0=0
Split                    splitncnn_51             1 2 635 636 637
RMSNorm                  rmsn_244                 1 1 637 638 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_52             1 3 638 639 640 641
Gemm                     gemm_84                  1 1 641 642 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_465              1 1 642 643 0=128 1=16 2=-1
RMSNorm                  rmsn_245                 1 1 643 644 0=128 1=1.000000e-06 2=1
Permute                  transpose_609            1 1 644 645 0=2
Gemm                     gemm_85                  1 1 640 646 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_466              1 1 646 647 0=128 1=8 2=-1
RMSNorm                  rmsn_246                 1 1 647 648 0=128 1=1.000000e-06 2=1
Permute                  transpose_610            1 1 648 649 0=2
Gemm                     gemm_86                  1 1 639 650 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_467              1 1 650 651 0=128 1=8 2=-1
Permute                  transpose_611            1 1 651 652 0=2
RotaryEmbed              rope_24                  3 1 645 64 121 653 0=0
RotaryEmbed              rope_25                  3 1 649 63 120 654 0=0
ExpandDims               unsqueeze_697            1 1 654 655 -23303=1,1
Tile                     expand_361               1 1 655 656 -23302=4,1,2,1,1
Reshape                  reshape_468              1 1 656 657 0=128 1=-1 2=16
ExpandDims               unsqueeze_698            1 1 652 658 -23303=1,1
Tile                     expand_362               1 1 658 659 -23302=4,1,2,1,1
Reshape                  reshape_469              1 1 659 660 0=128 1=-1 2=16
SDPA                     sdpa_741                 6 3 653 657 660 19 cache_k12 cache_v12 661 out_cache_k12 out_cache_v12 5=1 6=0.0883883 7=1
Permute                  transpose_612            1 1 661 662 0=2
Reshape                  reshape_470              1 1 662 663 0=2048 1=-1
Gemm                     gemm_87                  1 1 663 664 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_36                   2 1 636 664 665 0=0
Split                    splitncnn_53             1 2 665 666 667
RMSNorm                  rmsn_247                 1 1 667 668 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_54             1 2 668 669 670
Gemm                     gemm_88                  1 1 670 671 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_321                 1 1 671 672
Gemm                     gemm_89                  1 1 669 673 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_37                   2 1 672 673 674 0=2
Gemm                     gemm_90                  1 1 674 675 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_38                   2 1 666 675 676 0=0
Split                    splitncnn_55             1 2 676 677 678
RMSNorm                  rmsn_248                 1 1 678 679 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_56             1 3 679 680 681 682
Gemm                     gemm_91                  1 1 682 683 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_471              1 1 683 684 0=128 1=16 2=-1
RMSNorm                  rmsn_249                 1 1 684 685 0=128 1=1.000000e-06 2=1
Permute                  transpose_613            1 1 685 686 0=2
Gemm                     gemm_92                  1 1 681 687 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_472              1 1 687 688 0=128 1=8 2=-1
RMSNorm                  rmsn_250                 1 1 688 689 0=128 1=1.000000e-06 2=1
Permute                  transpose_614            1 1 689 690 0=2
Gemm                     gemm_93                  1 1 680 691 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_473              1 1 691 692 0=128 1=8 2=-1
Permute                  transpose_615            1 1 692 693 0=2
RotaryEmbed              rope_26                  3 1 686 62 119 694 0=0
RotaryEmbed              rope_27                  3 1 690 61 118 695 0=0
ExpandDims               unsqueeze_699            1 1 695 696 -23303=1,1
Tile                     expand_363               1 1 696 697 -23302=4,1,2,1,1
Reshape                  reshape_474              1 1 697 698 0=128 1=-1 2=16
ExpandDims               unsqueeze_700            1 1 693 699 -23303=1,1
Tile                     expand_364               1 1 699 700 -23302=4,1,2,1,1
Reshape                  reshape_475              1 1 700 701 0=128 1=-1 2=16
SDPA                     sdpa_742                 6 3 694 698 701 18 cache_k13 cache_v13 702 out_cache_k13 out_cache_v13 5=1 6=0.0883883 7=1
Permute                  transpose_616            1 1 702 703 0=2
Reshape                  reshape_476              1 1 703 704 0=2048 1=-1
Gemm                     gemm_94                  1 1 704 705 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_39                   2 1 677 705 706 0=0
Split                    splitncnn_57             1 2 706 707 708
RMSNorm                  rmsn_251                 1 1 708 709 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_58             1 2 709 710 711
Gemm                     gemm_95                  1 1 711 712 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_322                 1 1 712 713
Gemm                     gemm_96                  1 1 710 714 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_40                   2 1 713 714 715 0=2
Gemm                     gemm_97                  1 1 715 716 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_41                   2 1 707 716 717 0=0
Split                    splitncnn_59             1 2 717 718 719
RMSNorm                  rmsn_252                 1 1 719 720 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_60             1 3 720 721 722 723
Gemm                     gemm_98                  1 1 723 724 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_477              1 1 724 725 0=128 1=16 2=-1
RMSNorm                  rmsn_253                 1 1 725 726 0=128 1=1.000000e-06 2=1
Permute                  transpose_617            1 1 726 727 0=2
Gemm                     gemm_99                  1 1 722 728 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_478              1 1 728 729 0=128 1=8 2=-1
RMSNorm                  rmsn_254                 1 1 729 730 0=128 1=1.000000e-06 2=1
Permute                  transpose_618            1 1 730 731 0=2
Gemm                     gemm_100                 1 1 721 732 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_479              1 1 732 733 0=128 1=8 2=-1
Permute                  transpose_619            1 1 733 734 0=2
RotaryEmbed              rope_28                  3 1 727 60 117 735 0=0
RotaryEmbed              rope_29                  3 1 731 59 116 736 0=0
ExpandDims               unsqueeze_701            1 1 736 737 -23303=1,1
Tile                     expand_365               1 1 737 738 -23302=4,1,2,1,1
Reshape                  reshape_480              1 1 738 739 0=128 1=-1 2=16
ExpandDims               unsqueeze_702            1 1 734 740 -23303=1,1
Tile                     expand_366               1 1 740 741 -23302=4,1,2,1,1
Reshape                  reshape_481              1 1 741 742 0=128 1=-1 2=16
SDPA                     sdpa_743                 6 3 735 739 742 17 cache_k14 cache_v14 743 out_cache_k14 out_cache_v14 5=1 6=0.0883883 7=1
Permute                  transpose_620            1 1 743 744 0=2
Reshape                  reshape_482              1 1 744 745 0=2048 1=-1
Gemm                     gemm_101                 1 1 745 746 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_42                   2 1 718 746 747 0=0
Split                    splitncnn_61             1 2 747 748 749
RMSNorm                  rmsn_255                 1 1 749 750 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_62             1 2 750 751 752
Gemm                     gemm_102                 1 1 752 753 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_323                 1 1 753 754
Gemm                     gemm_103                 1 1 751 755 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_43                   2 1 754 755 756 0=2
Gemm                     gemm_104                 1 1 756 757 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_44                   2 1 748 757 758 0=0
Split                    splitncnn_63             1 2 758 759 760
RMSNorm                  rmsn_256                 1 1 760 761 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_64             1 3 761 762 763 764
Gemm                     gemm_105                 1 1 764 765 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_483              1 1 765 766 0=128 1=16 2=-1
RMSNorm                  rmsn_257                 1 1 766 767 0=128 1=1.000000e-06 2=1
Permute                  transpose_621            1 1 767 768 0=2
Gemm                     gemm_106                 1 1 763 769 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_484              1 1 769 770 0=128 1=8 2=-1
RMSNorm                  rmsn_258                 1 1 770 771 0=128 1=1.000000e-06 2=1
Permute                  transpose_622            1 1 771 772 0=2
Gemm                     gemm_107                 1 1 762 773 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_485              1 1 773 774 0=128 1=8 2=-1
Permute                  transpose_623            1 1 774 775 0=2
RotaryEmbed              rope_30                  3 1 768 58 115 776 0=0
RotaryEmbed              rope_31                  3 1 772 57 114 777 0=0
ExpandDims               unsqueeze_703            1 1 777 778 -23303=1,1
Tile                     expand_367               1 1 778 779 -23302=4,1,2,1,1
Reshape                  reshape_486              1 1 779 780 0=128 1=-1 2=16
ExpandDims               unsqueeze_704            1 1 775 781 -23303=1,1
Tile                     expand_368               1 1 781 782 -23302=4,1,2,1,1
Reshape                  reshape_487              1 1 782 783 0=128 1=-1 2=16
SDPA                     sdpa_744                 6 3 776 780 783 16 cache_k15 cache_v15 784 out_cache_k15 out_cache_v15 5=1 6=0.0883883 7=1
Permute                  transpose_624            1 1 784 785 0=2
Reshape                  reshape_488              1 1 785 786 0=2048 1=-1
Gemm                     gemm_108                 1 1 786 787 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=2048
BinaryOp                 add_45                   2 1 759 787 788 0=0
Split                    splitncnn_65             1 2 788 789 790
RMSNorm                  rmsn_259                 1 1 790 791 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_66             1 2 791 792 793
Gemm                     gemm_109                 1 1 793 794 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
Swish                    silu_324                 1 1 794 795
Gemm                     gemm_110                 1 1 792 796 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1024
BinaryOp                 mul_46                   2 1 795 796 797 0=2
Gemm                     gemm_111                 1 1 797 798 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=3072
BinaryOp                 add_47                   2 1 789 798 799 0=0
Split                    splitncnn_67             1 2 799 800 801
RMSNorm                  rmsn_260                 1 1 801 802 0=1024 1=1.000000e-06 2=1
Split                    splitncnn_68             1 3 802 803 804 805
Gemm                     gemm_112                 1 1 805 806 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=1024
Reshape                  reshape_489              1 1 806 807 0=128 1=16 2=-1
RMSNorm                  rmsn_261                 1 1 807 808 0=128 1=1.000000e-06 2=1
Permute                  transpose_625            1 1 808 809 0=2
Gemm                     gemm_113                 1 1 804 810 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_490              1 1 810 811 0=128 1=8 2=-1
RMSNorm                  rmsn_262                 1 1 811 812 0=128 1=1.000000e-06 2=1
Permute                  transpose_626            1 1 812 813 0=2
Gemm                     gemm_114                 1 1 803 814 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1024 9=1024
Reshape                  reshape_491              1 1 814 815 0=128 1=8 2=-1
Permute                  transpose_627            1 1 815 816 0=2
RotaryEmbed              rope_32                  3 1 809 56 113 817 0=0
RotaryEmbed              rope_33                  3 1 813 55 112 818 0=0
ExpandDims               unsqueeze_705            1 1 818 819 -23303=1,1
