7767517
825 1157
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 24 in1 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 48 in2 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 48 in3 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
Input                    kv_cache                 0 48 cache_k0 cache_v0 cache_k1 cache_v1 cache_k2 cache_v2 cache_k3 cache_v3 cache_k4 cache_v4 cache_k5 cache_v5 cache_k6 cache_v6 cache_k7 cache_v7 cache_k8 cache_v8 cache_k9 cache_v9 cache_k10 cache_v10 cache_k11 cache_v11 cache_k12 cache_v12 cache_k13 cache_v13 cache_k14 cache_v14 cache_k15 cache_v15 cache_k16 cache_v16 cache_k17 cache_v17 cache_k18 cache_v18 cache_k19 cache_v19 cache_k20 cache_v20 cache_k21 cache_v21 cache_k22 cache_v22 cache_k23 cache_v23
RMSNorm                  rmsn_168                 1 1 2 126 0=896 1=1.000000e-06 2=1
Split                    splitncnn_4              1 3 126 127 128 129
Gemm                     gemm_0                   1 1 129 130 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_289              1 1 130 131 0=64 1=14 2=-1
Permute                  transpose_433            1 1 131 132 0=2
Gemm                     gemm_1                   1 1 128 133 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_290              1 1 133 134 0=64 1=2 2=-1
Permute                  transpose_434            1 1 134 135 0=2
Gemm                     gemm_2                   1 1 127 136 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_291              1 1 136 137 0=64 1=2 2=-1
Permute                  transpose_435            1 1 137 138 0=2
RotaryEmbed              rope_0                   3 1 132 76 125 139 0=0
RotaryEmbed              rope_1                   3 1 135 75 124 140 0=0
ExpandDims               unsqueeze_529            1 1 140 141 -23303=1,1
Tile                     expand_241               1 1 141 142 -23302=4,1,7,1,1
Reshape                  reshape_292              1 1 142 143 0=64 1=-1 2=14
ExpandDims               unsqueeze_530            1 1 138 144 -23303=1,1
Tile                     expand_242               1 1 144 145 -23302=4,1,7,1,1
Reshape                  reshape_293              1 1 145 146 0=64 1=-1 2=14
SDPA                     sdpa_577                 6 3 139 143 146 27 cache_k0 cache_v0 147 out_cache_k0 out_cache_v0 5=1 6=0.125 7=1
Permute                  transpose_436            1 1 147 148 0=2
Reshape                  reshape_294              1 1 148 149 0=896 1=-1
Gemm                     gemm_3                   1 1 149 150 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_0                    2 1 1 150 151 0=0
Split                    splitncnn_5              1 2 151 152 153
RMSNorm                  rmsn_169                 1 1 153 154 0=896 1=1.000000e-06 2=1
Split                    splitncnn_6              1 2 154 155 156
Gemm                     gemm_4                   1 1 156 157 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_217                 1 1 157 158
Gemm                     gemm_5                   1 1 155 159 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_1                    2 1 158 159 160 0=2
Gemm                     gemm_6                   1 1 160 161 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_2                    2 1 152 161 162 0=0
Split                    splitncnn_7              1 2 162 163 164
RMSNorm                  rmsn_170                 1 1 164 165 0=896 1=1.000000e-06 2=1
Split                    splitncnn_8              1 3 165 166 167 168
Gemm                     gemm_7                   1 1 168 169 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_295              1 1 169 170 0=64 1=14 2=-1
Permute                  transpose_437            1 1 170 171 0=2
Gemm                     gemm_8                   1 1 167 172 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_296              1 1 172 173 0=64 1=2 2=-1
Permute                  transpose_438            1 1 173 174 0=2
Gemm                     gemm_9                   1 1 166 175 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_297              1 1 175 176 0=64 1=2 2=-1
Permute                  transpose_439            1 1 176 177 0=2
RotaryEmbed              rope_2                   3 1 171 74 123 178 0=0
RotaryEmbed              rope_3                   3 1 174 73 122 179 0=0
ExpandDims               unsqueeze_531            1 1 179 180 -23303=1,1
Tile                     expand_243               1 1 180 181 -23302=4,1,7,1,1
Reshape                  reshape_298              1 1 181 182 0=64 1=-1 2=14
ExpandDims               unsqueeze_532            1 1 177 183 -23303=1,1
Tile                     expand_244               1 1 183 184 -23302=4,1,7,1,1
Reshape                  reshape_299              1 1 184 185 0=64 1=-1 2=14
SDPA                     sdpa_578                 6 3 178 182 185 26 cache_k1 cache_v1 186 out_cache_k1 out_cache_v1 5=1 6=0.125 7=1
Permute                  transpose_440            1 1 186 187 0=2
Reshape                  reshape_300              1 1 187 188 0=896 1=-1
Gemm                     gemm_10                  1 1 188 189 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_3                    2 1 163 189 190 0=0
Split                    splitncnn_9              1 2 190 191 192
RMSNorm                  rmsn_171                 1 1 192 193 0=896 1=1.000000e-06 2=1
Split                    splitncnn_10             1 2 193 194 195
Gemm                     gemm_11                  1 1 195 196 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_218                 1 1 196 197
Gemm                     gemm_12                  1 1 194 198 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_4                    2 1 197 198 199 0=2
Gemm                     gemm_13                  1 1 199 200 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_5                    2 1 191 200 201 0=0
Split                    splitncnn_11             1 2 201 202 203
RMSNorm                  rmsn_172                 1 1 203 204 0=896 1=1.000000e-06 2=1
Split                    splitncnn_12             1 3 204 205 206 207
Gemm                     gemm_14                  1 1 207 208 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_301              1 1 208 209 0=64 1=14 2=-1
Permute                  transpose_441            1 1 209 210 0=2
Gemm                     gemm_15                  1 1 206 211 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_302              1 1 211 212 0=64 1=2 2=-1
Permute                  transpose_442            1 1 212 213 0=2
Gemm                     gemm_16                  1 1 205 214 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_303              1 1 214 215 0=64 1=2 2=-1
Permute                  transpose_443            1 1 215 216 0=2
RotaryEmbed              rope_4                   3 1 210 72 121 217 0=0
RotaryEmbed              rope_5                   3 1 213 71 120 218 0=0
ExpandDims               unsqueeze_533            1 1 218 219 -23303=1,1
Tile                     expand_245               1 1 219 220 -23302=4,1,7,1,1
Reshape                  reshape_304              1 1 220 221 0=64 1=-1 2=14
ExpandDims               unsqueeze_534            1 1 216 222 -23303=1,1
Tile                     expand_246               1 1 222 223 -23302=4,1,7,1,1
Reshape                  reshape_305              1 1 223 224 0=64 1=-1 2=14
SDPA                     sdpa_579                 6 3 217 221 224 25 cache_k2 cache_v2 225 out_cache_k2 out_cache_v2 5=1 6=0.125 7=1
Permute                  transpose_444            1 1 225 226 0=2
Reshape                  reshape_306              1 1 226 227 0=896 1=-1
Gemm                     gemm_17                  1 1 227 228 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_6                    2 1 202 228 229 0=0
Split                    splitncnn_13             1 2 229 230 231
RMSNorm                  rmsn_173                 1 1 231 232 0=896 1=1.000000e-06 2=1
Split                    splitncnn_14             1 2 232 233 234
Gemm                     gemm_18                  1 1 234 235 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_219                 1 1 235 236
Gemm                     gemm_19                  1 1 233 237 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_7                    2 1 236 237 238 0=2
Gemm                     gemm_20                  1 1 238 239 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_8                    2 1 230 239 240 0=0
Split                    splitncnn_15             1 2 240 241 242
RMSNorm                  rmsn_174                 1 1 242 243 0=896 1=1.000000e-06 2=1
Split                    splitncnn_16             1 3 243 244 245 246
Gemm                     gemm_21                  1 1 246 247 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_307              1 1 247 248 0=64 1=14 2=-1
Permute                  transpose_445            1 1 248 249 0=2
Gemm                     gemm_22                  1 1 245 250 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_308              1 1 250 251 0=64 1=2 2=-1
Permute                  transpose_446            1 1 251 252 0=2
Gemm                     gemm_23                  1 1 244 253 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_309              1 1 253 254 0=64 1=2 2=-1
Permute                  transpose_447            1 1 254 255 0=2
RotaryEmbed              rope_6                   3 1 249 70 119 256 0=0
RotaryEmbed              rope_7                   3 1 252 69 118 257 0=0
ExpandDims               unsqueeze_535            1 1 257 258 -23303=1,1
Tile                     expand_247               1 1 258 259 -23302=4,1,7,1,1
Reshape                  reshape_310              1 1 259 260 0=64 1=-1 2=14
ExpandDims               unsqueeze_536            1 1 255 261 -23303=1,1
Tile                     expand_248               1 1 261 262 -23302=4,1,7,1,1
Reshape                  reshape_311              1 1 262 263 0=64 1=-1 2=14
SDPA                     sdpa_580                 6 3 256 260 263 24 cache_k3 cache_v3 264 out_cache_k3 out_cache_v3 5=1 6=0.125 7=1
Permute                  transpose_448            1 1 264 265 0=2
Reshape                  reshape_312              1 1 265 266 0=896 1=-1
Gemm                     gemm_24                  1 1 266 267 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_9                    2 1 241 267 268 0=0
Split                    splitncnn_17             1 2 268 269 270
RMSNorm                  rmsn_175                 1 1 270 271 0=896 1=1.000000e-06 2=1
Split                    splitncnn_18             1 2 271 272 273
Gemm                     gemm_25                  1 1 273 274 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_220                 1 1 274 275
Gemm                     gemm_26                  1 1 272 276 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_10                   2 1 275 276 277 0=2
Gemm                     gemm_27                  1 1 277 278 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_11                   2 1 269 278 279 0=0
Split                    splitncnn_19             1 2 279 280 281
RMSNorm                  rmsn_176                 1 1 281 282 0=896 1=1.000000e-06 2=1
Split                    splitncnn_20             1 3 282 283 284 285
Gemm                     gemm_28                  1 1 285 286 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_313              1 1 286 287 0=64 1=14 2=-1
Permute                  transpose_449            1 1 287 288 0=2
Gemm                     gemm_29                  1 1 284 289 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_314              1 1 289 290 0=64 1=2 2=-1
Permute                  transpose_450            1 1 290 291 0=2
Gemm                     gemm_30                  1 1 283 292 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_315              1 1 292 293 0=64 1=2 2=-1
Permute                  transpose_451            1 1 293 294 0=2
RotaryEmbed              rope_8                   3 1 288 68 117 295 0=0
RotaryEmbed              rope_9                   3 1 291 67 116 296 0=0
ExpandDims               unsqueeze_537            1 1 296 297 -23303=1,1
Tile                     expand_249               1 1 297 298 -23302=4,1,7,1,1
Reshape                  reshape_316              1 1 298 299 0=64 1=-1 2=14
ExpandDims               unsqueeze_538            1 1 294 300 -23303=1,1
Tile                     expand_250               1 1 300 301 -23302=4,1,7,1,1
Reshape                  reshape_317              1 1 301 302 0=64 1=-1 2=14
SDPA                     sdpa_581                 6 3 295 299 302 23 cache_k4 cache_v4 303 out_cache_k4 out_cache_v4 5=1 6=0.125 7=1
Permute                  transpose_452            1 1 303 304 0=2
Reshape                  reshape_318              1 1 304 305 0=896 1=-1
Gemm                     gemm_31                  1 1 305 306 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_12                   2 1 280 306 307 0=0
Split                    splitncnn_21             1 2 307 308 309
RMSNorm                  rmsn_177                 1 1 309 310 0=896 1=1.000000e-06 2=1
Split                    splitncnn_22             1 2 310 311 312
Gemm                     gemm_32                  1 1 312 313 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_221                 1 1 313 314
Gemm                     gemm_33                  1 1 311 315 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_13                   2 1 314 315 316 0=2
Gemm                     gemm_34                  1 1 316 317 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_14                   2 1 308 317 318 0=0
Split                    splitncnn_23             1 2 318 319 320
RMSNorm                  rmsn_178                 1 1 320 321 0=896 1=1.000000e-06 2=1
Split                    splitncnn_24             1 3 321 322 323 324
Gemm                     gemm_35                  1 1 324 325 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_319              1 1 325 326 0=64 1=14 2=-1
Permute                  transpose_453            1 1 326 327 0=2
Gemm                     gemm_36                  1 1 323 328 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_320              1 1 328 329 0=64 1=2 2=-1
Permute                  transpose_454            1 1 329 330 0=2
Gemm                     gemm_37                  1 1 322 331 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_321              1 1 331 332 0=64 1=2 2=-1
Permute                  transpose_455            1 1 332 333 0=2
RotaryEmbed              rope_10                  3 1 327 66 115 334 0=0
RotaryEmbed              rope_11                  3 1 330 65 114 335 0=0
ExpandDims               unsqueeze_539            1 1 335 336 -23303=1,1
Tile                     expand_251               1 1 336 337 -23302=4,1,7,1,1
Reshape                  reshape_322              1 1 337 338 0=64 1=-1 2=14
ExpandDims               unsqueeze_540            1 1 333 339 -23303=1,1
Tile                     expand_252               1 1 339 340 -23302=4,1,7,1,1
Reshape                  reshape_323              1 1 340 341 0=64 1=-1 2=14
SDPA                     sdpa_582                 6 3 334 338 341 22 cache_k5 cache_v5 342 out_cache_k5 out_cache_v5 5=1 6=0.125 7=1
Permute                  transpose_456            1 1 342 343 0=2
Reshape                  reshape_324              1 1 343 344 0=896 1=-1
Gemm                     gemm_38                  1 1 344 345 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_15                   2 1 319 345 346 0=0
Split                    splitncnn_25             1 2 346 347 348
RMSNorm                  rmsn_179                 1 1 348 349 0=896 1=1.000000e-06 2=1
Split                    splitncnn_26             1 2 349 350 351
Gemm                     gemm_39                  1 1 351 352 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_222                 1 1 352 353
Gemm                     gemm_40                  1 1 350 354 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_16                   2 1 353 354 355 0=2
Gemm                     gemm_41                  1 1 355 356 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_17                   2 1 347 356 357 0=0
Split                    splitncnn_27             1 2 357 358 359
RMSNorm                  rmsn_180                 1 1 359 360 0=896 1=1.000000e-06 2=1
Split                    splitncnn_28             1 3 360 361 362 363
Gemm                     gemm_42                  1 1 363 364 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_325              1 1 364 365 0=64 1=14 2=-1
Permute                  transpose_457            1 1 365 366 0=2
Gemm                     gemm_43                  1 1 362 367 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_326              1 1 367 368 0=64 1=2 2=-1
Permute                  transpose_458            1 1 368 369 0=2
Gemm                     gemm_44                  1 1 361 370 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_327              1 1 370 371 0=64 1=2 2=-1
Permute                  transpose_459            1 1 371 372 0=2
RotaryEmbed              rope_12                  3 1 366 64 113 373 0=0
RotaryEmbed              rope_13                  3 1 369 63 112 374 0=0
ExpandDims               unsqueeze_541            1 1 374 375 -23303=1,1
Tile                     expand_253               1 1 375 376 -23302=4,1,7,1,1
Reshape                  reshape_328              1 1 376 377 0=64 1=-1 2=14
ExpandDims               unsqueeze_542            1 1 372 378 -23303=1,1
Tile                     expand_254               1 1 378 379 -23302=4,1,7,1,1
Reshape                  reshape_329              1 1 379 380 0=64 1=-1 2=14
SDPA                     sdpa_583                 6 3 373 377 380 21 cache_k6 cache_v6 381 out_cache_k6 out_cache_v6 5=1 6=0.125 7=1
Permute                  transpose_460            1 1 381 382 0=2
Reshape                  reshape_330              1 1 382 383 0=896 1=-1
Gemm                     gemm_45                  1 1 383 384 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_18                   2 1 358 384 385 0=0
Split                    splitncnn_29             1 2 385 386 387
RMSNorm                  rmsn_181                 1 1 387 388 0=896 1=1.000000e-06 2=1
Split                    splitncnn_30             1 2 388 389 390
Gemm                     gemm_46                  1 1 390 391 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_223                 1 1 391 392
Gemm                     gemm_47                  1 1 389 393 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_19                   2 1 392 393 394 0=2
Gemm                     gemm_48                  1 1 394 395 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_20                   2 1 386 395 396 0=0
Split                    splitncnn_31             1 2 396 397 398
RMSNorm                  rmsn_182                 1 1 398 399 0=896 1=1.000000e-06 2=1
Split                    splitncnn_32             1 3 399 400 401 402
Gemm                     gemm_49                  1 1 402 403 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_331              1 1 403 404 0=64 1=14 2=-1
Permute                  transpose_461            1 1 404 405 0=2
Gemm                     gemm_50                  1 1 401 406 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_332              1 1 406 407 0=64 1=2 2=-1
Permute                  transpose_462            1 1 407 408 0=2
Gemm                     gemm_51                  1 1 400 409 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_333              1 1 409 410 0=64 1=2 2=-1
Permute                  transpose_463            1 1 410 411 0=2
RotaryEmbed              rope_14                  3 1 405 62 111 412 0=0
RotaryEmbed              rope_15                  3 1 408 61 110 413 0=0
ExpandDims               unsqueeze_543            1 1 413 414 -23303=1,1
Tile                     expand_255               1 1 414 415 -23302=4,1,7,1,1
Reshape                  reshape_334              1 1 415 416 0=64 1=-1 2=14
ExpandDims               unsqueeze_544            1 1 411 417 -23303=1,1
Tile                     expand_256               1 1 417 418 -23302=4,1,7,1,1
Reshape                  reshape_335              1 1 418 419 0=64 1=-1 2=14
SDPA                     sdpa_584                 6 3 412 416 419 20 cache_k7 cache_v7 420 out_cache_k7 out_cache_v7 5=1 6=0.125 7=1
Permute                  transpose_464            1 1 420 421 0=2
Reshape                  reshape_336              1 1 421 422 0=896 1=-1
Gemm                     gemm_52                  1 1 422 423 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_21                   2 1 397 423 424 0=0
Split                    splitncnn_33             1 2 424 425 426
RMSNorm                  rmsn_183                 1 1 426 427 0=896 1=1.000000e-06 2=1
Split                    splitncnn_34             1 2 427 428 429
Gemm                     gemm_53                  1 1 429 430 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_224                 1 1 430 431
Gemm                     gemm_54                  1 1 428 432 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_22                   2 1 431 432 433 0=2
Gemm                     gemm_55                  1 1 433 434 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_23                   2 1 425 434 435 0=0
Split                    splitncnn_35             1 2 435 436 437
RMSNorm                  rmsn_184                 1 1 437 438 0=896 1=1.000000e-06 2=1
Split                    splitncnn_36             1 3 438 439 440 441
Gemm                     gemm_56                  1 1 441 442 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_337              1 1 442 443 0=64 1=14 2=-1
Permute                  transpose_465            1 1 443 444 0=2
Gemm                     gemm_57                  1 1 440 445 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_338              1 1 445 446 0=64 1=2 2=-1
Permute                  transpose_466            1 1 446 447 0=2
Gemm                     gemm_58                  1 1 439 448 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_339              1 1 448 449 0=64 1=2 2=-1
Permute                  transpose_467            1 1 449 450 0=2
RotaryEmbed              rope_16                  3 1 444 60 109 451 0=0
RotaryEmbed              rope_17                  3 1 447 59 108 452 0=0
ExpandDims               unsqueeze_545            1 1 452 453 -23303=1,1
Tile                     expand_257               1 1 453 454 -23302=4,1,7,1,1
Reshape                  reshape_340              1 1 454 455 0=64 1=-1 2=14
ExpandDims               unsqueeze_546            1 1 450 456 -23303=1,1
Tile                     expand_258               1 1 456 457 -23302=4,1,7,1,1
Reshape                  reshape_341              1 1 457 458 0=64 1=-1 2=14
SDPA                     sdpa_585                 6 3 451 455 458 19 cache_k8 cache_v8 459 out_cache_k8 out_cache_v8 5=1 6=0.125 7=1
Permute                  transpose_468            1 1 459 460 0=2
Reshape                  reshape_342              1 1 460 461 0=896 1=-1
Gemm                     gemm_59                  1 1 461 462 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_24                   2 1 436 462 463 0=0
Split                    splitncnn_37             1 2 463 464 465
RMSNorm                  rmsn_185                 1 1 465 466 0=896 1=1.000000e-06 2=1
Split                    splitncnn_38             1 2 466 467 468
Gemm                     gemm_60                  1 1 468 469 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_225                 1 1 469 470
Gemm                     gemm_61                  1 1 467 471 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_25                   2 1 470 471 472 0=2
Gemm                     gemm_62                  1 1 472 473 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_26                   2 1 464 473 474 0=0
Split                    splitncnn_39             1 2 474 475 476
RMSNorm                  rmsn_186                 1 1 476 477 0=896 1=1.000000e-06 2=1
Split                    splitncnn_40             1 3 477 478 479 480
Gemm                     gemm_63                  1 1 480 481 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_343              1 1 481 482 0=64 1=14 2=-1
Permute                  transpose_469            1 1 482 483 0=2
Gemm                     gemm_64                  1 1 479 484 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_344              1 1 484 485 0=64 1=2 2=-1
Permute                  transpose_470            1 1 485 486 0=2
Gemm                     gemm_65                  1 1 478 487 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_345              1 1 487 488 0=64 1=2 2=-1
Permute                  transpose_471            1 1 488 489 0=2
RotaryEmbed              rope_18                  3 1 483 58 107 490 0=0
RotaryEmbed              rope_19                  3 1 486 57 106 491 0=0
ExpandDims               unsqueeze_547            1 1 491 492 -23303=1,1
Tile                     expand_259               1 1 492 493 -23302=4,1,7,1,1
Reshape                  reshape_346              1 1 493 494 0=64 1=-1 2=14
ExpandDims               unsqueeze_548            1 1 489 495 -23303=1,1
Tile                     expand_260               1 1 495 496 -23302=4,1,7,1,1
Reshape                  reshape_347              1 1 496 497 0=64 1=-1 2=14
SDPA                     sdpa_586                 6 3 490 494 497 18 cache_k9 cache_v9 498 out_cache_k9 out_cache_v9 5=1 6=0.125 7=1
Permute                  transpose_472            1 1 498 499 0=2
Reshape                  reshape_348              1 1 499 500 0=896 1=-1
Gemm                     gemm_66                  1 1 500 501 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_27                   2 1 475 501 502 0=0
Split                    splitncnn_41             1 2 502 503 504
RMSNorm                  rmsn_187                 1 1 504 505 0=896 1=1.000000e-06 2=1
Split                    splitncnn_42             1 2 505 506 507
Gemm                     gemm_67                  1 1 507 508 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_226                 1 1 508 509
Gemm                     gemm_68                  1 1 506 510 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_28                   2 1 509 510 511 0=2
Gemm                     gemm_69                  1 1 511 512 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_29                   2 1 503 512 513 0=0
Split                    splitncnn_43             1 2 513 514 515
RMSNorm                  rmsn_188                 1 1 515 516 0=896 1=1.000000e-06 2=1
Split                    splitncnn_44             1 3 516 517 518 519
Gemm                     gemm_70                  1 1 519 520 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_349              1 1 520 521 0=64 1=14 2=-1
Permute                  transpose_473            1 1 521 522 0=2
Gemm                     gemm_71                  1 1 518 523 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_350              1 1 523 524 0=64 1=2 2=-1
Permute                  transpose_474            1 1 524 525 0=2
Gemm                     gemm_72                  1 1 517 526 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_351              1 1 526 527 0=64 1=2 2=-1
Permute                  transpose_475            1 1 527 528 0=2
RotaryEmbed              rope_20                  3 1 522 56 105 529 0=0
RotaryEmbed              rope_21                  3 1 525 55 104 530 0=0
ExpandDims               unsqueeze_549            1 1 530 531 -23303=1,1
Tile                     expand_261               1 1 531 532 -23302=4,1,7,1,1
Reshape                  reshape_352              1 1 532 533 0=64 1=-1 2=14
ExpandDims               unsqueeze_550            1 1 528 534 -23303=1,1
Tile                     expand_262               1 1 534 535 -23302=4,1,7,1,1
Reshape                  reshape_353              1 1 535 536 0=64 1=-1 2=14
SDPA                     sdpa_587                 6 3 529 533 536 17 cache_k10 cache_v10 537 out_cache_k10 out_cache_v10 5=1 6=0.125 7=1
Permute                  transpose_476            1 1 537 538 0=2
Reshape                  reshape_354              1 1 538 539 0=896 1=-1
Gemm                     gemm_73                  1 1 539 540 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_30                   2 1 514 540 541 0=0
Split                    splitncnn_45             1 2 541 542 543
RMSNorm                  rmsn_189                 1 1 543 544 0=896 1=1.000000e-06 2=1
Split                    splitncnn_46             1 2 544 545 546
Gemm                     gemm_74                  1 1 546 547 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_227                 1 1 547 548
Gemm                     gemm_75                  1 1 545 549 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_31                   2 1 548 549 550 0=2
Gemm                     gemm_76                  1 1 550 551 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_32                   2 1 542 551 552 0=0
Split                    splitncnn_47             1 2 552 553 554
RMSNorm                  rmsn_190                 1 1 554 555 0=896 1=1.000000e-06 2=1
Split                    splitncnn_48             1 3 555 556 557 558
Gemm                     gemm_77                  1 1 558 559 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_355              1 1 559 560 0=64 1=14 2=-1
Permute                  transpose_477            1 1 560 561 0=2
Gemm                     gemm_78                  1 1 557 562 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_356              1 1 562 563 0=64 1=2 2=-1
Permute                  transpose_478            1 1 563 564 0=2
Gemm                     gemm_79                  1 1 556 565 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_357              1 1 565 566 0=64 1=2 2=-1
Permute                  transpose_479            1 1 566 567 0=2
RotaryEmbed              rope_22                  3 1 561 54 103 568 0=0
RotaryEmbed              rope_23                  3 1 564 53 102 569 0=0
ExpandDims               unsqueeze_551            1 1 569 570 -23303=1,1
Tile                     expand_263               1 1 570 571 -23302=4,1,7,1,1
Reshape                  reshape_358              1 1 571 572 0=64 1=-1 2=14
ExpandDims               unsqueeze_552            1 1 567 573 -23303=1,1
Tile                     expand_264               1 1 573 574 -23302=4,1,7,1,1
Reshape                  reshape_359              1 1 574 575 0=64 1=-1 2=14
SDPA                     sdpa_588                 6 3 568 572 575 16 cache_k11 cache_v11 576 out_cache_k11 out_cache_v11 5=1 6=0.125 7=1
Permute                  transpose_480            1 1 576 577 0=2
Reshape                  reshape_360              1 1 577 578 0=896 1=-1
Gemm                     gemm_80                  1 1 578 579 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_33                   2 1 553 579 580 0=0
Split                    splitncnn_49             1 2 580 581 582
RMSNorm                  rmsn_191                 1 1 582 583 0=896 1=1.000000e-06 2=1
Split                    splitncnn_50             1 2 583 584 585
Gemm                     gemm_81                  1 1 585 586 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_228                 1 1 586 587
Gemm                     gemm_82                  1 1 584 588 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_34                   2 1 587 588 589 0=2
Gemm                     gemm_83                  1 1 589 590 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_35                   2 1 581 590 591 0=0
Split                    splitncnn_51             1 2 591 592 593
RMSNorm                  rmsn_192                 1 1 593 594 0=896 1=1.000000e-06 2=1
Split                    splitncnn_52             1 3 594 595 596 597
Gemm                     gemm_84                  1 1 597 598 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_361              1 1 598 599 0=64 1=14 2=-1
Permute                  transpose_481            1 1 599 600 0=2
Gemm                     gemm_85                  1 1 596 601 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_362              1 1 601 602 0=64 1=2 2=-1
Permute                  transpose_482            1 1 602 603 0=2
Gemm                     gemm_86                  1 1 595 604 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_363              1 1 604 605 0=64 1=2 2=-1
Permute                  transpose_483            1 1 605 606 0=2
RotaryEmbed              rope_24                  3 1 600 52 101 607 0=0
RotaryEmbed              rope_25                  3 1 603 51 100 608 0=0
ExpandDims               unsqueeze_553            1 1 608 609 -23303=1,1
Tile                     expand_265               1 1 609 610 -23302=4,1,7,1,1
Reshape                  reshape_364              1 1 610 611 0=64 1=-1 2=14
ExpandDims               unsqueeze_554            1 1 606 612 -23303=1,1
Tile                     expand_266               1 1 612 613 -23302=4,1,7,1,1
Reshape                  reshape_365              1 1 613 614 0=64 1=-1 2=14
SDPA                     sdpa_589                 6 3 607 611 614 15 cache_k12 cache_v12 615 out_cache_k12 out_cache_v12 5=1 6=0.125 7=1
Permute                  transpose_484            1 1 615 616 0=2
Reshape                  reshape_366              1 1 616 617 0=896 1=-1
Gemm                     gemm_87                  1 1 617 618 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_36                   2 1 592 618 619 0=0
Split                    splitncnn_53             1 2 619 620 621
RMSNorm                  rmsn_193                 1 1 621 622 0=896 1=1.000000e-06 2=1
Split                    splitncnn_54             1 2 622 623 624
Gemm                     gemm_88                  1 1 624 625 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_229                 1 1 625 626
Gemm                     gemm_89                  1 1 623 627 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_37                   2 1 626 627 628 0=2
Gemm                     gemm_90                  1 1 628 629 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_38                   2 1 620 629 630 0=0
Split                    splitncnn_55             1 2 630 631 632
RMSNorm                  rmsn_194                 1 1 632 633 0=896 1=1.000000e-06 2=1
Split                    splitncnn_56             1 3 633 634 635 636
Gemm                     gemm_91                  1 1 636 637 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_367              1 1 637 638 0=64 1=14 2=-1
Permute                  transpose_485            1 1 638 639 0=2
Gemm                     gemm_92                  1 1 635 640 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_368              1 1 640 641 0=64 1=2 2=-1
Permute                  transpose_486            1 1 641 642 0=2
Gemm                     gemm_93                  1 1 634 643 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_369              1 1 643 644 0=64 1=2 2=-1
Permute                  transpose_487            1 1 644 645 0=2
RotaryEmbed              rope_26                  3 1 639 50 99 646 0=0
RotaryEmbed              rope_27                  3 1 642 49 98 647 0=0
ExpandDims               unsqueeze_555            1 1 647 648 -23303=1,1
Tile                     expand_267               1 1 648 649 -23302=4,1,7,1,1
Reshape                  reshape_370              1 1 649 650 0=64 1=-1 2=14
ExpandDims               unsqueeze_556            1 1 645 651 -23303=1,1
Tile                     expand_268               1 1 651 652 -23302=4,1,7,1,1
Reshape                  reshape_371              1 1 652 653 0=64 1=-1 2=14
SDPA                     sdpa_590                 6 3 646 650 653 14 cache_k13 cache_v13 654 out_cache_k13 out_cache_v13 5=1 6=0.125 7=1
Permute                  transpose_488            1 1 654 655 0=2
Reshape                  reshape_372              1 1 655 656 0=896 1=-1
Gemm                     gemm_94                  1 1 656 657 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_39                   2 1 631 657 658 0=0
Split                    splitncnn_57             1 2 658 659 660
RMSNorm                  rmsn_195                 1 1 660 661 0=896 1=1.000000e-06 2=1
Split                    splitncnn_58             1 2 661 662 663
Gemm                     gemm_95                  1 1 663 664 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_230                 1 1 664 665
Gemm                     gemm_96                  1 1 662 666 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_40                   2 1 665 666 667 0=2
Gemm                     gemm_97                  1 1 667 668 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_41                   2 1 659 668 669 0=0
Split                    splitncnn_59             1 2 669 670 671
RMSNorm                  rmsn_196                 1 1 671 672 0=896 1=1.000000e-06 2=1
Split                    splitncnn_60             1 3 672 673 674 675
Gemm                     gemm_98                  1 1 675 676 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_373              1 1 676 677 0=64 1=14 2=-1
Permute                  transpose_489            1 1 677 678 0=2
Gemm                     gemm_99                  1 1 674 679 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_374              1 1 679 680 0=64 1=2 2=-1
Permute                  transpose_490            1 1 680 681 0=2
Gemm                     gemm_100                 1 1 673 682 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_375              1 1 682 683 0=64 1=2 2=-1
Permute                  transpose_491            1 1 683 684 0=2
RotaryEmbed              rope_28                  3 1 678 48 97 685 0=0
RotaryEmbed              rope_29                  3 1 681 47 96 686 0=0
ExpandDims               unsqueeze_557            1 1 686 687 -23303=1,1
Tile                     expand_269               1 1 687 688 -23302=4,1,7,1,1
Reshape                  reshape_376              1 1 688 689 0=64 1=-1 2=14
ExpandDims               unsqueeze_558            1 1 684 690 -23303=1,1
Tile                     expand_270               1 1 690 691 -23302=4,1,7,1,1
Reshape                  reshape_377              1 1 691 692 0=64 1=-1 2=14
SDPA                     sdpa_591                 6 3 685 689 692 13 cache_k14 cache_v14 693 out_cache_k14 out_cache_v14 5=1 6=0.125 7=1
Permute                  transpose_492            1 1 693 694 0=2
Reshape                  reshape_378              1 1 694 695 0=896 1=-1
Gemm                     gemm_101                 1 1 695 696 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_42                   2 1 670 696 697 0=0
Split                    splitncnn_61             1 2 697 698 699
RMSNorm                  rmsn_197                 1 1 699 700 0=896 1=1.000000e-06 2=1
Split                    splitncnn_62             1 2 700 701 702
Gemm                     gemm_102                 1 1 702 703 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_231                 1 1 703 704
Gemm                     gemm_103                 1 1 701 705 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_43                   2 1 704 705 706 0=2
Gemm                     gemm_104                 1 1 706 707 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_44                   2 1 698 707 708 0=0
Split                    splitncnn_63             1 2 708 709 710
RMSNorm                  rmsn_198                 1 1 710 711 0=896 1=1.000000e-06 2=1
Split                    splitncnn_64             1 3 711 712 713 714
Gemm                     gemm_105                 1 1 714 715 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_379              1 1 715 716 0=64 1=14 2=-1
Permute                  transpose_493            1 1 716 717 0=2
Gemm                     gemm_106                 1 1 713 718 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_380              1 1 718 719 0=64 1=2 2=-1
Permute                  transpose_494            1 1 719 720 0=2
Gemm                     gemm_107                 1 1 712 721 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_381              1 1 721 722 0=64 1=2 2=-1
Permute                  transpose_495            1 1 722 723 0=2
RotaryEmbed              rope_30                  3 1 717 46 95 724 0=0
RotaryEmbed              rope_31                  3 1 720 45 94 725 0=0
ExpandDims               unsqueeze_559            1 1 725 726 -23303=1,1
Tile                     expand_271               1 1 726 727 -23302=4,1,7,1,1
Reshape                  reshape_382              1 1 727 728 0=64 1=-1 2=14
ExpandDims               unsqueeze_560            1 1 723 729 -23303=1,1
Tile                     expand_272               1 1 729 730 -23302=4,1,7,1,1
Reshape                  reshape_383              1 1 730 731 0=64 1=-1 2=14
SDPA                     sdpa_592                 6 3 724 728 731 12 cache_k15 cache_v15 732 out_cache_k15 out_cache_v15 5=1 6=0.125 7=1
Permute                  transpose_496            1 1 732 733 0=2
Reshape                  reshape_384              1 1 733 734 0=896 1=-1
Gemm                     gemm_108                 1 1 734 735 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_45                   2 1 709 735 736 0=0
Split                    splitncnn_65             1 2 736 737 738
RMSNorm                  rmsn_199                 1 1 738 739 0=896 1=1.000000e-06 2=1
Split                    splitncnn_66             1 2 739 740 741
Gemm                     gemm_109                 1 1 741 742 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_232                 1 1 742 743
Gemm                     gemm_110                 1 1 740 744 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_46                   2 1 743 744 745 0=2
Gemm                     gemm_111                 1 1 745 746 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_47                   2 1 737 746 747 0=0
Split                    splitncnn_67             1 2 747 748 749
RMSNorm                  rmsn_200                 1 1 749 750 0=896 1=1.000000e-06 2=1
Split                    splitncnn_68             1 3 750 751 752 753
Gemm                     gemm_112                 1 1 753 754 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_385              1 1 754 755 0=64 1=14 2=-1
Permute                  transpose_497            1 1 755 756 0=2
Gemm                     gemm_113                 1 1 752 757 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_386              1 1 757 758 0=64 1=2 2=-1
Permute                  transpose_498            1 1 758 759 0=2
Gemm                     gemm_114                 1 1 751 760 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_387              1 1 760 761 0=64 1=2 2=-1
Permute                  transpose_499            1 1 761 762 0=2
RotaryEmbed              rope_32                  3 1 756 44 93 763 0=0
RotaryEmbed              rope_33                  3 1 759 43 92 764 0=0
ExpandDims               unsqueeze_561            1 1 764 765 -23303=1,1
Tile                     expand_273               1 1 765 766 -23302=4,1,7,1,1
Reshape                  reshape_388              1 1 766 767 0=64 1=-1 2=14
ExpandDims               unsqueeze_562            1 1 762 768 -23303=1,1
Tile                     expand_274               1 1 768 769 -23302=4,1,7,1,1
Reshape                  reshape_389              1 1 769 770 0=64 1=-1 2=14
SDPA                     sdpa_593                 6 3 763 767 770 11 cache_k16 cache_v16 771 out_cache_k16 out_cache_v16 5=1 6=0.125 7=1
Permute                  transpose_500            1 1 771 772 0=2
Reshape                  reshape_390              1 1 772 773 0=896 1=-1
Gemm                     gemm_115                 1 1 773 774 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
BinaryOp                 add_48                   2 1 748 774 775 0=0
Split                    splitncnn_69             1 2 775 776 777
RMSNorm                  rmsn_201                 1 1 777 778 0=896 1=1.000000e-06 2=1
Split                    splitncnn_70             1 2 778 779 780
Gemm                     gemm_116                 1 1 780 781 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
Swish                    silu_233                 1 1 781 782
Gemm                     gemm_117                 1 1 779 783 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4864 9=896
BinaryOp                 mul_49                   2 1 782 783 784 0=2
Gemm                     gemm_118                 1 1 784 785 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=4864
BinaryOp                 add_50                   2 1 776 785 786 0=0
Split                    splitncnn_71             1 2 786 787 788
RMSNorm                  rmsn_202                 1 1 788 789 0=896 1=1.000000e-06 2=1
Split                    splitncnn_72             1 3 789 790 791 792
Gemm                     gemm_119                 1 1 792 793 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
Reshape                  reshape_391              1 1 793 794 0=64 1=14 2=-1
Permute                  transpose_501            1 1 794 795 0=2
Gemm                     gemm_120                 1 1 791 796 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_392              1 1 796 797 0=64 1=2 2=-1
Permute                  transpose_502            1 1 797 798 0=2
Gemm                     gemm_121                 1 1 790 799 10=4 2=0 3=1 4=0 5=1 6=1 7=0 8=128 9=896
Reshape                  reshape_393              1 1 799 800 0=64 1=2 2=-1
Permute                  transpose_503            1 1 800 801 0=2
RotaryEmbed              rope_34                  3 1 795 42 91 802 0=0
RotaryEmbed              rope_35                  3 1 798 41 90 803 0=0
ExpandDims               unsqueeze_563            1 1 803 804 -23303=1,1
Tile                     expand_275               1 1 804 805 -23302=4,1,7,1,1
Reshape                  reshape_394              1 1 805 806 0=64 1=-1 2=14
ExpandDims               unsqueeze_564            1 1 801 807 -23303=1,1
Tile                     expand_276               1 1 807 808 -23302=4,1,7,1,1
Reshape                  reshape_395              1 1 808 809 0=64 1=-1 2=14
SDPA                     sdpa_594                 6 3 802 806 809 10 cache_k17 cache_v17 810 out_cache_k17 out_cache_v17 5=1 6=0.125 7=1
Permute                  transpose_504            1 1 810 811 0=2
Reshape                  reshape_396              1 1 811 812 0=896 1=-1
Gemm                     gemm_122                 1 1 812 813 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=896 9=896
