7767517
1129 1637
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Input                    in1                      0 1 in1
Split                    splitncnn_1              1 32 in1 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35
Input                    in2                      0 1 in2
Split                    splitncnn_2              1 64 in2 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100
Input                    in3                      0 1 in3
Split                    splitncnn_3              1 64 in3 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165
Input                    kv_cache                 0 64 cache_k0 cache_v0 cache_k1 cache_v1 cache_k2 cache_v2 cache_k3 cache_v3 cache_k4 cache_v4 cache_k5 cache_v5 cache_k6 cache_v6 cache_k7 cache_v7 cache_k8 cache_v8 cache_k9 cache_v9 cache_k10 cache_v10 cache_k11 cache_v11 cache_k12 cache_v12 cache_k13 cache_v13 cache_k14 cache_v14 cache_k15 cache_v15 cache_k16 cache_v16 cache_k17 cache_v17 cache_k18 cache_v18 cache_k19 cache_v19 cache_k20 cache_v20 cache_k21 cache_v21 cache_k22 cache_v22 cache_k23 cache_v23 cache_k24 cache_v24 cache_k25 cache_v25 cache_k26 cache_v26 cache_k27 cache_v27 cache_k28 cache_v28 cache_k29 cache_v29 cache_k30 cache_v30 cache_k31 cache_v31
RMSNorm                  rmsn_256                 1 1 2 166 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_4              1 2 166 167 168
Gemm                     gemm_0                   1 1 168 169 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_257                 1 1 169 170 0=1536 1=0.0 2=1
Gemm                     gemm_1                   1 1 170 171 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_449              1 1 171 172 0=192 1=16 2=-1
Permute                  transpose_545            1 1 172 173 0=2
Slice                    split_0                  1 2 173 174 175 -23300=2,128,64 1=2
Gemm                     gemm_2                   1 1 167 176 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_1                  1 2 176 177 178 -23300=2,512,64 1=1
RMSNorm                  rmsn_258                 1 1 177 179 0=512 1=0.0 2=1
Gemm                     gemm_3                   1 1 179 180 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_450              1 1 180 181 0=256 1=16 2=-1
Permute                  transpose_546            1 1 181 182 0=2
Slice                    split_2                  1 2 182 183 184 -23300=2,128,128 1=2
RotaryEmbed              rope_0                   3 1 175 100 165 185 0=1
RotaryEmbed              rope_1                   3 1 178 99 164 186 0=1
Tile                     expand_417               1 1 186 187 -23302=3,16,1,1
Concat                   cat_0                    2 1 174 185 188 0=2
Concat                   cat_1                    2 1 183 187 189 0=2
SDPA                     sdpa_641                 6 3 188 189 184 35 cache_k0 cache_v0 190 out_cache_k0 out_cache_v0 5=1 6=0.0721688 7=1
Permute                  transpose_547            1 1 190 191 0=2
Reshape                  reshape_451              1 1 191 192 0=2048 1=-1
Gemm                     gemm_4                   1 1 192 193 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_0                    2 1 1 193 194 0=0
Split                    splitncnn_5              1 2 194 195 196
RMSNorm                  rmsn_259                 1 1 196 197 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_6              1 2 197 198 199
Gemm                     gemm_5                   1 1 199 200 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_385                 1 1 200 201
Gemm                     gemm_6                   1 1 198 202 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_1                    2 1 201 202 203 0=2
Gemm                     gemm_7                   1 1 203 204 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_2                    2 1 195 204 205 0=0
Split                    splitncnn_7              1 2 205 206 207
RMSNorm                  rmsn_260                 1 1 207 208 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_8              1 2 208 209 210
Gemm                     gemm_8                   1 1 210 211 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_261                 1 1 211 212 0=1536 1=0.0 2=1
Gemm                     gemm_9                   1 1 212 213 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_452              1 1 213 214 0=192 1=16 2=-1
Permute                  transpose_548            1 1 214 215 0=2
Slice                    split_3                  1 2 215 216 217 -23300=2,128,64 1=2
Gemm                     gemm_10                  1 1 209 218 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_4                  1 2 218 219 220 -23300=2,512,64 1=1
RMSNorm                  rmsn_262                 1 1 219 221 0=512 1=0.0 2=1
Gemm                     gemm_11                  1 1 221 222 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_453              1 1 222 223 0=256 1=16 2=-1
Permute                  transpose_549            1 1 223 224 0=2
Slice                    split_5                  1 2 224 225 226 -23300=2,128,128 1=2
RotaryEmbed              rope_2                   3 1 217 98 163 227 0=1
RotaryEmbed              rope_3                   3 1 220 97 162 228 0=1
Tile                     expand_418               1 1 228 229 -23302=3,16,1,1
Concat                   cat_2                    2 1 216 227 230 0=2
Concat                   cat_3                    2 1 225 229 231 0=2
SDPA                     sdpa_642                 6 3 230 231 226 34 cache_k1 cache_v1 232 out_cache_k1 out_cache_v1 5=1 6=0.0721688 7=1
Permute                  transpose_550            1 1 232 233 0=2
Reshape                  reshape_454              1 1 233 234 0=2048 1=-1
Gemm                     gemm_12                  1 1 234 235 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_3                    2 1 206 235 236 0=0
Split                    splitncnn_9              1 2 236 237 238
RMSNorm                  rmsn_263                 1 1 238 239 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_10             1 2 239 240 241
Gemm                     gemm_13                  1 1 241 242 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_386                 1 1 242 243
Gemm                     gemm_14                  1 1 240 244 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_4                    2 1 243 244 245 0=2
Gemm                     gemm_15                  1 1 245 246 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_5                    2 1 237 246 247 0=0
Split                    splitncnn_11             1 2 247 248 249
RMSNorm                  rmsn_264                 1 1 249 250 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_12             1 2 250 251 252
Gemm                     gemm_16                  1 1 252 253 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_265                 1 1 253 254 0=1536 1=0.0 2=1
Gemm                     gemm_17                  1 1 254 255 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_455              1 1 255 256 0=192 1=16 2=-1
Permute                  transpose_551            1 1 256 257 0=2
Slice                    split_6                  1 2 257 258 259 -23300=2,128,64 1=2
Gemm                     gemm_18                  1 1 251 260 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_7                  1 2 260 261 262 -23300=2,512,64 1=1
RMSNorm                  rmsn_266                 1 1 261 263 0=512 1=0.0 2=1
Gemm                     gemm_19                  1 1 263 264 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_456              1 1 264 265 0=256 1=16 2=-1
Permute                  transpose_552            1 1 265 266 0=2
Slice                    split_8                  1 2 266 267 268 -23300=2,128,128 1=2
RotaryEmbed              rope_4                   3 1 259 96 161 269 0=1
RotaryEmbed              rope_5                   3 1 262 95 160 270 0=1
Tile                     expand_419               1 1 270 271 -23302=3,16,1,1
Concat                   cat_4                    2 1 258 269 272 0=2
Concat                   cat_5                    2 1 267 271 273 0=2
SDPA                     sdpa_643                 6 3 272 273 268 33 cache_k2 cache_v2 274 out_cache_k2 out_cache_v2 5=1 6=0.0721688 7=1
Permute                  transpose_553            1 1 274 275 0=2
Reshape                  reshape_457              1 1 275 276 0=2048 1=-1
Gemm                     gemm_20                  1 1 276 277 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_6                    2 1 248 277 278 0=0
Split                    splitncnn_13             1 2 278 279 280
RMSNorm                  rmsn_267                 1 1 280 281 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_14             1 2 281 282 283
Gemm                     gemm_21                  1 1 283 284 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_387                 1 1 284 285
Gemm                     gemm_22                  1 1 282 286 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_7                    2 1 285 286 287 0=2
Gemm                     gemm_23                  1 1 287 288 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_8                    2 1 279 288 289 0=0
Split                    splitncnn_15             1 2 289 290 291
RMSNorm                  rmsn_268                 1 1 291 292 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_16             1 2 292 293 294
Gemm                     gemm_24                  1 1 294 295 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_269                 1 1 295 296 0=1536 1=0.0 2=1
Gemm                     gemm_25                  1 1 296 297 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_458              1 1 297 298 0=192 1=16 2=-1
Permute                  transpose_554            1 1 298 299 0=2
Slice                    split_9                  1 2 299 300 301 -23300=2,128,64 1=2
Gemm                     gemm_26                  1 1 293 302 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_10                 1 2 302 303 304 -23300=2,512,64 1=1
RMSNorm                  rmsn_270                 1 1 303 305 0=512 1=0.0 2=1
Gemm                     gemm_27                  1 1 305 306 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_459              1 1 306 307 0=256 1=16 2=-1
Permute                  transpose_555            1 1 307 308 0=2
Slice                    split_11                 1 2 308 309 310 -23300=2,128,128 1=2
RotaryEmbed              rope_6                   3 1 301 94 159 311 0=1
RotaryEmbed              rope_7                   3 1 304 93 158 312 0=1
Tile                     expand_420               1 1 312 313 -23302=3,16,1,1
Concat                   cat_6                    2 1 300 311 314 0=2
Concat                   cat_7                    2 1 309 313 315 0=2
SDPA                     sdpa_644                 6 3 314 315 310 32 cache_k3 cache_v3 316 out_cache_k3 out_cache_v3 5=1 6=0.0721688 7=1
Permute                  transpose_556            1 1 316 317 0=2
Reshape                  reshape_460              1 1 317 318 0=2048 1=-1
Gemm                     gemm_28                  1 1 318 319 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_9                    2 1 290 319 320 0=0
Split                    splitncnn_17             1 2 320 321 322
RMSNorm                  rmsn_271                 1 1 322 323 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_18             1 2 323 324 325
Gemm                     gemm_29                  1 1 325 326 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_388                 1 1 326 327
Gemm                     gemm_30                  1 1 324 328 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_10                   2 1 327 328 329 0=2
Gemm                     gemm_31                  1 1 329 330 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_11                   2 1 321 330 331 0=0
Split                    splitncnn_19             1 2 331 332 333
RMSNorm                  rmsn_272                 1 1 333 334 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_20             1 2 334 335 336
Gemm                     gemm_32                  1 1 336 337 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_273                 1 1 337 338 0=1536 1=0.0 2=1
Gemm                     gemm_33                  1 1 338 339 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_461              1 1 339 340 0=192 1=16 2=-1
Permute                  transpose_557            1 1 340 341 0=2
Slice                    split_12                 1 2 341 342 343 -23300=2,128,64 1=2
Gemm                     gemm_34                  1 1 335 344 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_13                 1 2 344 345 346 -23300=2,512,64 1=1
RMSNorm                  rmsn_274                 1 1 345 347 0=512 1=0.0 2=1
Gemm                     gemm_35                  1 1 347 348 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_462              1 1 348 349 0=256 1=16 2=-1
Permute                  transpose_558            1 1 349 350 0=2
Slice                    split_14                 1 2 350 351 352 -23300=2,128,128 1=2
RotaryEmbed              rope_8                   3 1 343 92 157 353 0=1
RotaryEmbed              rope_9                   3 1 346 91 156 354 0=1
Tile                     expand_421               1 1 354 355 -23302=3,16,1,1
Concat                   cat_8                    2 1 342 353 356 0=2
Concat                   cat_9                    2 1 351 355 357 0=2
SDPA                     sdpa_645                 6 3 356 357 352 31 cache_k4 cache_v4 358 out_cache_k4 out_cache_v4 5=1 6=0.0721688 7=1
Permute                  transpose_559            1 1 358 359 0=2
Reshape                  reshape_463              1 1 359 360 0=2048 1=-1
Gemm                     gemm_36                  1 1 360 361 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_12                   2 1 332 361 362 0=0
Split                    splitncnn_21             1 2 362 363 364
RMSNorm                  rmsn_275                 1 1 364 365 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_22             1 2 365 366 367
Gemm                     gemm_37                  1 1 367 368 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_389                 1 1 368 369
Gemm                     gemm_38                  1 1 366 370 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_13                   2 1 369 370 371 0=2
Gemm                     gemm_39                  1 1 371 372 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_14                   2 1 363 372 373 0=0
Split                    splitncnn_23             1 2 373 374 375
RMSNorm                  rmsn_276                 1 1 375 376 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_24             1 2 376 377 378
Gemm                     gemm_40                  1 1 378 379 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_277                 1 1 379 380 0=1536 1=0.0 2=1
Gemm                     gemm_41                  1 1 380 381 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_464              1 1 381 382 0=192 1=16 2=-1
Permute                  transpose_560            1 1 382 383 0=2
Slice                    split_15                 1 2 383 384 385 -23300=2,128,64 1=2
Gemm                     gemm_42                  1 1 377 386 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_16                 1 2 386 387 388 -23300=2,512,64 1=1
RMSNorm                  rmsn_278                 1 1 387 389 0=512 1=0.0 2=1
Gemm                     gemm_43                  1 1 389 390 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_465              1 1 390 391 0=256 1=16 2=-1
Permute                  transpose_561            1 1 391 392 0=2
Slice                    split_17                 1 2 392 393 394 -23300=2,128,128 1=2
RotaryEmbed              rope_10                  3 1 385 90 155 395 0=1
RotaryEmbed              rope_11                  3 1 388 89 154 396 0=1
Tile                     expand_422               1 1 396 397 -23302=3,16,1,1
Concat                   cat_10                   2 1 384 395 398 0=2
Concat                   cat_11                   2 1 393 397 399 0=2
SDPA                     sdpa_646                 6 3 398 399 394 30 cache_k5 cache_v5 400 out_cache_k5 out_cache_v5 5=1 6=0.0721688 7=1
Permute                  transpose_562            1 1 400 401 0=2
Reshape                  reshape_466              1 1 401 402 0=2048 1=-1
Gemm                     gemm_44                  1 1 402 403 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_15                   2 1 374 403 404 0=0
Split                    splitncnn_25             1 2 404 405 406
RMSNorm                  rmsn_279                 1 1 406 407 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_26             1 2 407 408 409
Gemm                     gemm_45                  1 1 409 410 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_390                 1 1 410 411
Gemm                     gemm_46                  1 1 408 412 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_16                   2 1 411 412 413 0=2
Gemm                     gemm_47                  1 1 413 414 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_17                   2 1 405 414 415 0=0
Split                    splitncnn_27             1 2 415 416 417
RMSNorm                  rmsn_280                 1 1 417 418 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_28             1 2 418 419 420
Gemm                     gemm_48                  1 1 420 421 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_281                 1 1 421 422 0=1536 1=0.0 2=1
Gemm                     gemm_49                  1 1 422 423 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_467              1 1 423 424 0=192 1=16 2=-1
Permute                  transpose_563            1 1 424 425 0=2
Slice                    split_18                 1 2 425 426 427 -23300=2,128,64 1=2
Gemm                     gemm_50                  1 1 419 428 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_19                 1 2 428 429 430 -23300=2,512,64 1=1
RMSNorm                  rmsn_282                 1 1 429 431 0=512 1=0.0 2=1
Gemm                     gemm_51                  1 1 431 432 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_468              1 1 432 433 0=256 1=16 2=-1
Permute                  transpose_564            1 1 433 434 0=2
Slice                    split_20                 1 2 434 435 436 -23300=2,128,128 1=2
RotaryEmbed              rope_12                  3 1 427 88 153 437 0=1
RotaryEmbed              rope_13                  3 1 430 87 152 438 0=1
Tile                     expand_423               1 1 438 439 -23302=3,16,1,1
Concat                   cat_12                   2 1 426 437 440 0=2
Concat                   cat_13                   2 1 435 439 441 0=2
SDPA                     sdpa_647                 6 3 440 441 436 29 cache_k6 cache_v6 442 out_cache_k6 out_cache_v6 5=1 6=0.0721688 7=1
Permute                  transpose_565            1 1 442 443 0=2
Reshape                  reshape_469              1 1 443 444 0=2048 1=-1
Gemm                     gemm_52                  1 1 444 445 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_18                   2 1 416 445 446 0=0
Split                    splitncnn_29             1 2 446 447 448
RMSNorm                  rmsn_283                 1 1 448 449 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_30             1 2 449 450 451
Gemm                     gemm_53                  1 1 451 452 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_391                 1 1 452 453
Gemm                     gemm_54                  1 1 450 454 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_19                   2 1 453 454 455 0=2
Gemm                     gemm_55                  1 1 455 456 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_20                   2 1 447 456 457 0=0
Split                    splitncnn_31             1 2 457 458 459
RMSNorm                  rmsn_284                 1 1 459 460 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_32             1 2 460 461 462
Gemm                     gemm_56                  1 1 462 463 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_285                 1 1 463 464 0=1536 1=0.0 2=1
Gemm                     gemm_57                  1 1 464 465 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_470              1 1 465 466 0=192 1=16 2=-1
Permute                  transpose_566            1 1 466 467 0=2
Slice                    split_21                 1 2 467 468 469 -23300=2,128,64 1=2
Gemm                     gemm_58                  1 1 461 470 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_22                 1 2 470 471 472 -23300=2,512,64 1=1
RMSNorm                  rmsn_286                 1 1 471 473 0=512 1=0.0 2=1
Gemm                     gemm_59                  1 1 473 474 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_471              1 1 474 475 0=256 1=16 2=-1
Permute                  transpose_567            1 1 475 476 0=2
Slice                    split_23                 1 2 476 477 478 -23300=2,128,128 1=2
RotaryEmbed              rope_14                  3 1 469 86 151 479 0=1
RotaryEmbed              rope_15                  3 1 472 85 150 480 0=1
Tile                     expand_424               1 1 480 481 -23302=3,16,1,1
Concat                   cat_14                   2 1 468 479 482 0=2
Concat                   cat_15                   2 1 477 481 483 0=2
SDPA                     sdpa_648                 6 3 482 483 478 28 cache_k7 cache_v7 484 out_cache_k7 out_cache_v7 5=1 6=0.0721688 7=1
Permute                  transpose_568            1 1 484 485 0=2
Reshape                  reshape_472              1 1 485 486 0=2048 1=-1
Gemm                     gemm_60                  1 1 486 487 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_21                   2 1 458 487 488 0=0
Split                    splitncnn_33             1 2 488 489 490
RMSNorm                  rmsn_287                 1 1 490 491 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_34             1 2 491 492 493
Gemm                     gemm_61                  1 1 493 494 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_392                 1 1 494 495
Gemm                     gemm_62                  1 1 492 496 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_22                   2 1 495 496 497 0=2
Gemm                     gemm_63                  1 1 497 498 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_23                   2 1 489 498 499 0=0
Split                    splitncnn_35             1 2 499 500 501
RMSNorm                  rmsn_288                 1 1 501 502 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_36             1 2 502 503 504
Gemm                     gemm_64                  1 1 504 505 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_289                 1 1 505 506 0=1536 1=0.0 2=1
Gemm                     gemm_65                  1 1 506 507 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_473              1 1 507 508 0=192 1=16 2=-1
Permute                  transpose_569            1 1 508 509 0=2
Slice                    split_24                 1 2 509 510 511 -23300=2,128,64 1=2
Gemm                     gemm_66                  1 1 503 512 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_25                 1 2 512 513 514 -23300=2,512,64 1=1
RMSNorm                  rmsn_290                 1 1 513 515 0=512 1=0.0 2=1
Gemm                     gemm_67                  1 1 515 516 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_474              1 1 516 517 0=256 1=16 2=-1
Permute                  transpose_570            1 1 517 518 0=2
Slice                    split_26                 1 2 518 519 520 -23300=2,128,128 1=2
RotaryEmbed              rope_16                  3 1 511 84 149 521 0=1
RotaryEmbed              rope_17                  3 1 514 83 148 522 0=1
Tile                     expand_425               1 1 522 523 -23302=3,16,1,1
Concat                   cat_16                   2 1 510 521 524 0=2
Concat                   cat_17                   2 1 519 523 525 0=2
SDPA                     sdpa_649                 6 3 524 525 520 27 cache_k8 cache_v8 526 out_cache_k8 out_cache_v8 5=1 6=0.0721688 7=1
Permute                  transpose_571            1 1 526 527 0=2
Reshape                  reshape_475              1 1 527 528 0=2048 1=-1
Gemm                     gemm_68                  1 1 528 529 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_24                   2 1 500 529 530 0=0
Split                    splitncnn_37             1 2 530 531 532
RMSNorm                  rmsn_291                 1 1 532 533 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_38             1 2 533 534 535
Gemm                     gemm_69                  1 1 535 536 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_393                 1 1 536 537
Gemm                     gemm_70                  1 1 534 538 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_25                   2 1 537 538 539 0=2
Gemm                     gemm_71                  1 1 539 540 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_26                   2 1 531 540 541 0=0
Split                    splitncnn_39             1 2 541 542 543
RMSNorm                  rmsn_292                 1 1 543 544 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_40             1 2 544 545 546
Gemm                     gemm_72                  1 1 546 547 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_293                 1 1 547 548 0=1536 1=0.0 2=1
Gemm                     gemm_73                  1 1 548 549 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_476              1 1 549 550 0=192 1=16 2=-1
Permute                  transpose_572            1 1 550 551 0=2
Slice                    split_27                 1 2 551 552 553 -23300=2,128,64 1=2
Gemm                     gemm_74                  1 1 545 554 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_28                 1 2 554 555 556 -23300=2,512,64 1=1
RMSNorm                  rmsn_294                 1 1 555 557 0=512 1=0.0 2=1
Gemm                     gemm_75                  1 1 557 558 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_477              1 1 558 559 0=256 1=16 2=-1
Permute                  transpose_573            1 1 559 560 0=2
Slice                    split_29                 1 2 560 561 562 -23300=2,128,128 1=2
RotaryEmbed              rope_18                  3 1 553 82 147 563 0=1
RotaryEmbed              rope_19                  3 1 556 81 146 564 0=1
Tile                     expand_426               1 1 564 565 -23302=3,16,1,1
Concat                   cat_18                   2 1 552 563 566 0=2
Concat                   cat_19                   2 1 561 565 567 0=2
SDPA                     sdpa_650                 6 3 566 567 562 26 cache_k9 cache_v9 568 out_cache_k9 out_cache_v9 5=1 6=0.0721688 7=1
Permute                  transpose_574            1 1 568 569 0=2
Reshape                  reshape_478              1 1 569 570 0=2048 1=-1
Gemm                     gemm_76                  1 1 570 571 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_27                   2 1 542 571 572 0=0
Split                    splitncnn_41             1 2 572 573 574
RMSNorm                  rmsn_295                 1 1 574 575 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_42             1 2 575 576 577
Gemm                     gemm_77                  1 1 577 578 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_394                 1 1 578 579
Gemm                     gemm_78                  1 1 576 580 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_28                   2 1 579 580 581 0=2
Gemm                     gemm_79                  1 1 581 582 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_29                   2 1 573 582 583 0=0
Split                    splitncnn_43             1 2 583 584 585
RMSNorm                  rmsn_296                 1 1 585 586 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_44             1 2 586 587 588
Gemm                     gemm_80                  1 1 588 589 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_297                 1 1 589 590 0=1536 1=0.0 2=1
Gemm                     gemm_81                  1 1 590 591 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_479              1 1 591 592 0=192 1=16 2=-1
Permute                  transpose_575            1 1 592 593 0=2
Slice                    split_30                 1 2 593 594 595 -23300=2,128,64 1=2
Gemm                     gemm_82                  1 1 587 596 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_31                 1 2 596 597 598 -23300=2,512,64 1=1
RMSNorm                  rmsn_298                 1 1 597 599 0=512 1=0.0 2=1
Gemm                     gemm_83                  1 1 599 600 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_480              1 1 600 601 0=256 1=16 2=-1
Permute                  transpose_576            1 1 601 602 0=2
Slice                    split_32                 1 2 602 603 604 -23300=2,128,128 1=2
RotaryEmbed              rope_20                  3 1 595 80 145 605 0=1
RotaryEmbed              rope_21                  3 1 598 79 144 606 0=1
Tile                     expand_427               1 1 606 607 -23302=3,16,1,1
Concat                   cat_20                   2 1 594 605 608 0=2
Concat                   cat_21                   2 1 603 607 609 0=2
SDPA                     sdpa_651                 6 3 608 609 604 25 cache_k10 cache_v10 610 out_cache_k10 out_cache_v10 5=1 6=0.0721688 7=1
Permute                  transpose_577            1 1 610 611 0=2
Reshape                  reshape_481              1 1 611 612 0=2048 1=-1
Gemm                     gemm_84                  1 1 612 613 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_30                   2 1 584 613 614 0=0
Split                    splitncnn_45             1 2 614 615 616
RMSNorm                  rmsn_299                 1 1 616 617 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_46             1 2 617 618 619
Gemm                     gemm_85                  1 1 619 620 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_395                 1 1 620 621
Gemm                     gemm_86                  1 1 618 622 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_31                   2 1 621 622 623 0=2
Gemm                     gemm_87                  1 1 623 624 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_32                   2 1 615 624 625 0=0
Split                    splitncnn_47             1 2 625 626 627
RMSNorm                  rmsn_300                 1 1 627 628 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_48             1 2 628 629 630
Gemm                     gemm_88                  1 1 630 631 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_301                 1 1 631 632 0=1536 1=0.0 2=1
Gemm                     gemm_89                  1 1 632 633 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_482              1 1 633 634 0=192 1=16 2=-1
Permute                  transpose_578            1 1 634 635 0=2
Slice                    split_33                 1 2 635 636 637 -23300=2,128,64 1=2
Gemm                     gemm_90                  1 1 629 638 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_34                 1 2 638 639 640 -23300=2,512,64 1=1
RMSNorm                  rmsn_302                 1 1 639 641 0=512 1=0.0 2=1
Gemm                     gemm_91                  1 1 641 642 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_483              1 1 642 643 0=256 1=16 2=-1
Permute                  transpose_579            1 1 643 644 0=2
Slice                    split_35                 1 2 644 645 646 -23300=2,128,128 1=2
RotaryEmbed              rope_22                  3 1 637 78 143 647 0=1
RotaryEmbed              rope_23                  3 1 640 77 142 648 0=1
Tile                     expand_428               1 1 648 649 -23302=3,16,1,1
Concat                   cat_22                   2 1 636 647 650 0=2
Concat                   cat_23                   2 1 645 649 651 0=2
SDPA                     sdpa_652                 6 3 650 651 646 24 cache_k11 cache_v11 652 out_cache_k11 out_cache_v11 5=1 6=0.0721688 7=1
Permute                  transpose_580            1 1 652 653 0=2
Reshape                  reshape_484              1 1 653 654 0=2048 1=-1
Gemm                     gemm_92                  1 1 654 655 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_33                   2 1 626 655 656 0=0
Split                    splitncnn_49             1 2 656 657 658
RMSNorm                  rmsn_303                 1 1 658 659 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_50             1 2 659 660 661
Gemm                     gemm_93                  1 1 661 662 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_396                 1 1 662 663
Gemm                     gemm_94                  1 1 660 664 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_34                   2 1 663 664 665 0=2
Gemm                     gemm_95                  1 1 665 666 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_35                   2 1 657 666 667 0=0
Split                    splitncnn_51             1 2 667 668 669
RMSNorm                  rmsn_304                 1 1 669 670 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_52             1 2 670 671 672
Gemm                     gemm_96                  1 1 672 673 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_305                 1 1 673 674 0=1536 1=0.0 2=1
Gemm                     gemm_97                  1 1 674 675 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_485              1 1 675 676 0=192 1=16 2=-1
Permute                  transpose_581            1 1 676 677 0=2
Slice                    split_36                 1 2 677 678 679 -23300=2,128,64 1=2
Gemm                     gemm_98                  1 1 671 680 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_37                 1 2 680 681 682 -23300=2,512,64 1=1
RMSNorm                  rmsn_306                 1 1 681 683 0=512 1=0.0 2=1
Gemm                     gemm_99                  1 1 683 684 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_486              1 1 684 685 0=256 1=16 2=-1
Permute                  transpose_582            1 1 685 686 0=2
Slice                    split_38                 1 2 686 687 688 -23300=2,128,128 1=2
RotaryEmbed              rope_24                  3 1 679 76 141 689 0=1
RotaryEmbed              rope_25                  3 1 682 75 140 690 0=1
Tile                     expand_429               1 1 690 691 -23302=3,16,1,1
Concat                   cat_24                   2 1 678 689 692 0=2
Concat                   cat_25                   2 1 687 691 693 0=2
SDPA                     sdpa_653                 6 3 692 693 688 23 cache_k12 cache_v12 694 out_cache_k12 out_cache_v12 5=1 6=0.0721688 7=1
Permute                  transpose_583            1 1 694 695 0=2
Reshape                  reshape_487              1 1 695 696 0=2048 1=-1
Gemm                     gemm_100                 1 1 696 697 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_36                   2 1 668 697 698 0=0
Split                    splitncnn_53             1 2 698 699 700
RMSNorm                  rmsn_307                 1 1 700 701 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_54             1 2 701 702 703
Gemm                     gemm_101                 1 1 703 704 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_397                 1 1 704 705
Gemm                     gemm_102                 1 1 702 706 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_37                   2 1 705 706 707 0=2
Gemm                     gemm_103                 1 1 707 708 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_38                   2 1 699 708 709 0=0
Split                    splitncnn_55             1 2 709 710 711
RMSNorm                  rmsn_308                 1 1 711 712 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_56             1 2 712 713 714
Gemm                     gemm_104                 1 1 714 715 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_309                 1 1 715 716 0=1536 1=0.0 2=1
Gemm                     gemm_105                 1 1 716 717 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_488              1 1 717 718 0=192 1=16 2=-1
Permute                  transpose_584            1 1 718 719 0=2
Slice                    split_39                 1 2 719 720 721 -23300=2,128,64 1=2
Gemm                     gemm_106                 1 1 713 722 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_40                 1 2 722 723 724 -23300=2,512,64 1=1
RMSNorm                  rmsn_310                 1 1 723 725 0=512 1=0.0 2=1
Gemm                     gemm_107                 1 1 725 726 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_489              1 1 726 727 0=256 1=16 2=-1
Permute                  transpose_585            1 1 727 728 0=2
Slice                    split_41                 1 2 728 729 730 -23300=2,128,128 1=2
RotaryEmbed              rope_26                  3 1 721 74 139 731 0=1
RotaryEmbed              rope_27                  3 1 724 73 138 732 0=1
Tile                     expand_430               1 1 732 733 -23302=3,16,1,1
Concat                   cat_26                   2 1 720 731 734 0=2
Concat                   cat_27                   2 1 729 733 735 0=2
SDPA                     sdpa_654                 6 3 734 735 730 22 cache_k13 cache_v13 736 out_cache_k13 out_cache_v13 5=1 6=0.0721688 7=1
Permute                  transpose_586            1 1 736 737 0=2
Reshape                  reshape_490              1 1 737 738 0=2048 1=-1
Gemm                     gemm_108                 1 1 738 739 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_39                   2 1 710 739 740 0=0
Split                    splitncnn_57             1 2 740 741 742
RMSNorm                  rmsn_311                 1 1 742 743 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_58             1 2 743 744 745
Gemm                     gemm_109                 1 1 745 746 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_398                 1 1 746 747
Gemm                     gemm_110                 1 1 744 748 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_40                   2 1 747 748 749 0=2
Gemm                     gemm_111                 1 1 749 750 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_41                   2 1 741 750 751 0=0
Split                    splitncnn_59             1 2 751 752 753
RMSNorm                  rmsn_312                 1 1 753 754 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_60             1 2 754 755 756
Gemm                     gemm_112                 1 1 756 757 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_313                 1 1 757 758 0=1536 1=0.0 2=1
Gemm                     gemm_113                 1 1 758 759 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_491              1 1 759 760 0=192 1=16 2=-1
Permute                  transpose_587            1 1 760 761 0=2
Slice                    split_42                 1 2 761 762 763 -23300=2,128,64 1=2
Gemm                     gemm_114                 1 1 755 764 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_43                 1 2 764 765 766 -23300=2,512,64 1=1
RMSNorm                  rmsn_314                 1 1 765 767 0=512 1=0.0 2=1
Gemm                     gemm_115                 1 1 767 768 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_492              1 1 768 769 0=256 1=16 2=-1
Permute                  transpose_588            1 1 769 770 0=2
Slice                    split_44                 1 2 770 771 772 -23300=2,128,128 1=2
RotaryEmbed              rope_28                  3 1 763 72 137 773 0=1
RotaryEmbed              rope_29                  3 1 766 71 136 774 0=1
Tile                     expand_431               1 1 774 775 -23302=3,16,1,1
Concat                   cat_28                   2 1 762 773 776 0=2
Concat                   cat_29                   2 1 771 775 777 0=2
SDPA                     sdpa_655                 6 3 776 777 772 21 cache_k14 cache_v14 778 out_cache_k14 out_cache_v14 5=1 6=0.0721688 7=1
Permute                  transpose_589            1 1 778 779 0=2
Reshape                  reshape_493              1 1 779 780 0=2048 1=-1
Gemm                     gemm_116                 1 1 780 781 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_42                   2 1 752 781 782 0=0
Split                    splitncnn_61             1 2 782 783 784
RMSNorm                  rmsn_315                 1 1 784 785 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_62             1 2 785 786 787
Gemm                     gemm_117                 1 1 787 788 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_399                 1 1 788 789
Gemm                     gemm_118                 1 1 786 790 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_43                   2 1 789 790 791 0=2
Gemm                     gemm_119                 1 1 791 792 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_44                   2 1 783 792 793 0=0
Split                    splitncnn_63             1 2 793 794 795
RMSNorm                  rmsn_316                 1 1 795 796 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_64             1 2 796 797 798
Gemm                     gemm_120                 1 1 798 799 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_317                 1 1 799 800 0=1536 1=0.0 2=1
Gemm                     gemm_121                 1 1 800 801 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_494              1 1 801 802 0=192 1=16 2=-1
Permute                  transpose_590            1 1 802 803 0=2
Slice                    split_45                 1 2 803 804 805 -23300=2,128,64 1=2
Gemm                     gemm_122                 1 1 797 806 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_46                 1 2 806 807 808 -23300=2,512,64 1=1
RMSNorm                  rmsn_318                 1 1 807 809 0=512 1=0.0 2=1
Gemm                     gemm_123                 1 1 809 810 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_495              1 1 810 811 0=256 1=16 2=-1
Permute                  transpose_591            1 1 811 812 0=2
Slice                    split_47                 1 2 812 813 814 -23300=2,128,128 1=2
RotaryEmbed              rope_30                  3 1 805 70 135 815 0=1
RotaryEmbed              rope_31                  3 1 808 69 134 816 0=1
Tile                     expand_432               1 1 816 817 -23302=3,16,1,1
Concat                   cat_30                   2 1 804 815 818 0=2
Concat                   cat_31                   2 1 813 817 819 0=2
SDPA                     sdpa_656                 6 3 818 819 814 20 cache_k15 cache_v15 820 out_cache_k15 out_cache_v15 5=1 6=0.0721688 7=1
Permute                  transpose_592            1 1 820 821 0=2
Reshape                  reshape_496              1 1 821 822 0=2048 1=-1
Gemm                     gemm_124                 1 1 822 823 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=2048
BinaryOp                 add_45                   2 1 794 823 824 0=0
Split                    splitncnn_65             1 2 824 825 826
RMSNorm                  rmsn_319                 1 1 826 827 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_66             1 2 827 828 829
Gemm                     gemm_125                 1 1 829 830 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
Swish                    silu_400                 1 1 830 831
Gemm                     gemm_126                 1 1 828 832 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=6144 9=2048
BinaryOp                 mul_46                   2 1 831 832 833 0=2
Gemm                     gemm_127                 1 1 833 834 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=2048 9=6144
BinaryOp                 add_47                   2 1 825 834 835 0=0
Split                    splitncnn_67             1 2 835 836 837
RMSNorm                  rmsn_320                 1 1 837 838 0=2048 1=1.000000e-06 2=1
Split                    splitncnn_68             1 2 838 839 840
Gemm                     gemm_128                 1 1 840 841 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=1536 9=2048
RMSNorm                  rmsn_321                 1 1 841 842 0=1536 1=0.0 2=1
Gemm                     gemm_129                 1 1 842 843 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=3072 9=1536
Reshape                  reshape_497              1 1 843 844 0=192 1=16 2=-1
Permute                  transpose_593            1 1 844 845 0=2
Slice                    split_48                 1 2 845 846 847 -23300=2,128,64 1=2
Gemm                     gemm_130                 1 1 839 848 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=576 9=2048
Slice                    split_49                 1 2 848 849 850 -23300=2,512,64 1=1
RMSNorm                  rmsn_322                 1 1 849 851 0=512 1=0.0 2=1
Gemm                     gemm_131                 1 1 851 852 10=-1 2=0 3=1 4=0 5=1 6=1 7=0 8=4096 9=512
Reshape                  reshape_498              1 1 852 853 0=256 1=16 2=-1
Permute                  transpose_594            1 1 853 854 0=2
Slice                    split_50                 1 2 854 855 856 -23300=2,128,128 1=2
RotaryEmbed              rope_32                  3 1 847 68 133 857 0=1
RotaryEmbed              rope_33                  3 1 850 67 132 858 0=1
Tile                     expand_433               1 1 858 859 -23302=3,16,1,1
Concat                   cat_32                   2 1 846 857 860 0=2
Concat                   cat_33                   2 1 855 859 861 0=2
SDPA                     sdpa_657                 6 3 860 861 856 19 cache_k16 cache_v16 862 out_cache_k16 out_cache_v16 5=1 6=0.0721688 7=1
