7767517
6 5
pnnx.Input               pnnx_input_0             0 1 x.1 #x.1=(1,3,10,20,30)f32
nn.Conv3d                conv3d                   1 1 x.1 13 bias=True dilation=(1,1,1) groups=1 in_channels=3 kernel_size=(2,2,2) out_channels=6 padding=(0,0,0) padding_mode=zeros stride=(2,2,2) @bias=(6)f32 @weight=(6,3,2,2,2)f32 #x.1=(1,3,10,20,30)f32 #13=(1,6,5,10,15)f32
nn.Conv3d                conv3d_depth_wise        1 1 13 14 bias=True dilation=(1,1,1) groups=6 in_channels=6 kernel_size=(3,3,3) out_channels=6 padding=(1,1,1) padding_mode=zeros stride=(1,1,1) @bias=(6)f32 @weight=(6,1,3,3,3)f32 #13=(1,6,5,10,15)f32 #14=(1,6,5,10,15)f32
nn.ConvTranspose3d       deconv3d                 1 1 14 18 bias=True dilation=(1,1,1) groups=1 in_channels=6 kernel_size=(3,3,3) out_channels=6 output_padding=(0,0,0) padding=(1,1,1) stride=(1,1,1) @bias=(6)f32 @weight=(6,6,3,3,3)f32 #14=(1,6,5,10,15)f32 #18=(1,6,5,10,15)f32
nn.ConvTranspose3d       deconv3d_depth_wise      1 1 18 19 bias=True dilation=(1,1,1) groups=6 in_channels=6 kernel_size=(3,3,3) out_channels=6 output_padding=(0,0,0) padding=(1,1,1) stride=(1,1,1) @bias=(6)f32 @weight=(6,1,3,3,3)f32 #18=(1,6,5,10,15)f32 #19=(1,6,5,10,15)f32
pnnx.Output              pnnx_output_0            1 0 19 #19=(1,6,5,10,15)f32
