7767517
10 9
pnnx.Input               pnnx_input_0             0 1 0 #0=(1,3,64,64)f32
pnnx.Input               pnnx_input_1             0 1 1 #1=(1,1,100)f32
nn.Conv2d                conv1                    1 1 0 2 bias=True dilation=(1,1) groups=1 in_channels=3 kernel_size=(3,3) out_channels=16 padding=(1,1) padding_mode=zeros stride=(1,1) @bias=(16)f32 @weight=(16,3,3,3)f32 #0=(1,3,64,64)f32 #2=(1,16,64,64)f32
Tensor.view              Tensor.view_2            1 1 2 3 shape=(1,65536) $input=2 #2=(1,16,64,64)f32 #3=(1,65536)f32
nn.Linear                fc1                      1 1 3 4 bias=True in_features=65536 out_features=128 @bias=(128)f32 @weight=(128,65536)f32 #3=(1,65536)f32 #4=(1,128)f32
nn.Linear                fc2                      1 1 1 5 bias=True in_features=100 out_features=128 @bias=(128)f32 @weight=(128,100)f32 #1=(1,1,100)f32 #5=(1,1,128)f32
Tensor.view              Tensor.view_3            1 1 5 6 shape=(1,128) $input=5 #5=(1,1,128)f32 #6=(1,128)f32
torch.cat                torch.cat_4              2 1 4 6 7 dim=1 #4=(1,128)f32 #6=(1,128)f32 #7=(1,256)f32
nn.Linear                fc3                      1 1 7 8 bias=True in_features=256 out_features=10 @bias=(10)f32 @weight=(10,256)f32 #7=(1,256)f32 #8=(1,10)f32
pnnx.Output              pnnx_output_0            1 0 8 #8=(1,10)f32
