7767517
5 5
Input                    in0                      0 1 in0
Convolution3D            conv3d_0                 1 1 in0 1 0=6 1=2 11=2 12=1 13=2 14=0 2=1 21=2 22=1 23=2 24=0 3=2 4=0 5=1 6=144
ConvolutionDepthWise3D   convdw3d_2               1 1 1 2 0=6 1=3 11=3 12=1 13=1 14=1 2=1 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=162 7=6
Deconvolution3D          deconv3d_1               1 1 2 3 0=6 1=3 11=3 12=1 13=1 14=1 18=0 19=0 2=1 20=0 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=972
DeconvolutionDepthWise3D deconvdw3d_3             1 1 3 out0 0=6 1=3 11=3 12=1 13=1 14=1 18=0 19=0 2=1 20=0 21=3 22=1 23=1 24=1 3=1 4=1 5=1 6=162 7=6
