7767517
50 58
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=64 1=7 11=7 12=1 13=2 14=3 2=1 3=2 4=3 5=1 6=9408 9=1
Pooling                  maxpool2d_22             1 1 1 2 0=0 1=3 11=3 12=2 13=1 2=2 3=1 5=1
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_1               1 1 4 5 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_3                   1 1 5 6 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_0                    2 1 6 3 7 0=0
ReLU                     relu_25                  1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              convrelu_2               1 1 10 11 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864 9=1
Convolution              conv_5                   1 1 11 12 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
BinaryOp                 add_1                    2 1 12 9 13 0=0
ReLU                     relu_27                  1 1 13 14
Split                    splitncnn_2              1 2 14 15 16
Convolution              convrelu_3               1 1 16 17 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728 9=1
Convolution              conv_7                   1 1 17 18 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Convolution              conv_8                   1 1 15 19 0=128 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=8192
BinaryOp                 add_2                    2 1 18 19 20 0=0
ReLU                     relu_29                  1 1 20 21
Split                    splitncnn_3              1 2 21 22 23
Convolution              convrelu_4               1 1 23 24 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456 9=1
Convolution              conv_10                  1 1 24 25 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
BinaryOp                 add_3                    2 1 25 22 26 0=0
ReLU                     relu_31                  1 1 26 27
Split                    splitncnn_4              1 2 27 28 29
Convolution              convrelu_5               1 1 29 30 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912 9=1
Convolution              conv_12                  1 1 30 31 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Convolution              conv_13                  1 1 28 32 0=256 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=32768
BinaryOp                 add_4                    2 1 31 32 33 0=0
ReLU                     relu_33                  1 1 33 34
Split                    splitncnn_5              1 2 34 35 36
Convolution              convrelu_6               1 1 36 37 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824 9=1
Convolution              conv_15                  1 1 37 38 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
BinaryOp                 add_5                    2 1 38 35 39 0=0
ReLU                     relu_35                  1 1 39 40
Split                    splitncnn_6              1 2 40 41 42
Convolution              convrelu_7               1 1 42 43 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648 9=1
Convolution              conv_17                  1 1 43 44 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
Convolution              conv_18                  1 1 41 45 0=512 1=1 11=1 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=131072
BinaryOp                 add_6                    2 1 44 45 46 0=0
ReLU                     relu_37                  1 1 46 47
Split                    splitncnn_7              1 2 47 48 49
Convolution              convrelu_8               1 1 49 50 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296 9=1
Convolution              conv_20                  1 1 50 51 0=512 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2359296
BinaryOp                 add_7                    2 1 51 48 52 0=0
ReLU                     relu_39                  1 1 52 53
Pooling                  gap_0                    1 1 53 54 0=1 4=1
Reshape                  reshape_40               1 1 54 55 0=1 1=1 2=-1
Flatten                  flatten_41               1 1 55 56
InnerProduct             linear_21                1 1 56 out0 0=1000 1=1 2=512000
